
// Перем
&НаКлиенте
Перем ВремяВводаПоследнегоСимвола; // Если пользователь вводит текст, то не обновляем, чтобы не сбивался текст



// Процедуры и функции
&НаСервереБезКонтекста
Функция ОтправитьСообщение(ТекстСообшения)
	
	Возврат ИгровойСерверПривилегированный.ОтправитьСообщениеНаСервере(ТекстСообшения);		
	
КонецФункции	

&НаСервереБезКонтекста
Функция КлючЗаписи_ПоследнейЗаписиРегистра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Чат.Игра КАК Игра,
	|	Чат.ДатаСообщения КАК ДатаСообщения,
	|	Чат.Отправитель КАК Отправитель
	|ИЗ
	|	РегистрСведений.Чат КАК Чат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСообщения УБЫВ";	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Отбор = Новый Структура("Игра,Отправитель,ДатаСообщения");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Отбор, ВыборкаДетальныеЗаписи);
		КлючЗаписи = РегистрыСведений.Чат.СоздатьКлючЗаписи(Отбор);	
		Возврат КлючЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСообщенияЧата()
	
	// Если пользователь вводит текст, то не обновляем, чтобы не сбивался текст	
	Если ТекущаяДата()-ВремяВводаПоследнегоСимвола>2 Тогда // - задержка секунд
		
		// Запрос данных на сервере
		КлючТекущейЗаписи = КлючЗаписи_ПоследнейЗаписиРегистра();
		Если КлючПредыдущейЗаписи<>КлючТекущейЗаписи Тогда
			
			// Обновление 
			Элементы.Список.Обновить();	
			
			// Позиционирование на последней строке:
			Элементы.Список.ТекущаяСтрока = КлючТекущейЗаписи;	
			
			// Сохранение
			КлючПредыдущейЗаписи = КлючТекущейЗаписи;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры



// Кнопки
&НаКлиенте
Процедура Отправить(Команда)
	
	// Отправка
	Если ЗначениеЗаполнено(ТекстСообшения) Тогда
		КлючЗаписи = ОтправитьСообщение(ТекстСообшения);
		ТекстСообшения = "";
	Иначе
		КлючЗаписи = КлючЗаписи_ПоследнейЗаписиРегистра();
	КонецЕсли;
	
	// Обновление 
	Элементы.Список.Обновить();
	
	// Позиционирование на последней строке:
	Элементы.Список.ТекущаяСтрока = КлючЗаписи;	
	
	// Сохранение
	КлючПредыдущейЗаписи = КлючЗаписи;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры



// Обработчики событий:
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры ДинамическогоСписка
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	// Позиционирование на последней строке:
	Элементы.Список.ТекущаяСтрока = КлючЗаписи_ПоследнейЗаписиРегистра();	
	
	// ВремяОбновленияДанныхИгрока
	ВремяОбновленияДанныхИгрока = Константы.ВремяОбновленияДанныхИгрока.Получить();
	Если ВремяОбновленияДанныхИгрока<5 Тогда
		ВремяОбновленияДанныхИгрока = 5;
	КонецЕсли;	
	
	// Синхронизация
	ТекущаяДатаСеансаНаСервере = ТекущаяДатаСеанса();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Синхронизация
	СинхронизацияСВременемСервера = ТекущаяДатаСеансаНаСервере - ТекущаяДата(); // в секундах	
	//
	// Параметры ДинамическогоСписка для Синхронизации
	Список.Параметры.УстановитьЗначениеПараметра("СинхронизацияСВременемСервера", СинхронизацияСВременемСервера);
	
	// Подключение обработчика обновления чата:
	ПодключитьОбработчикОжидания("ОбновитьСообщенияЧата", ВремяОбновленияДанныхИгрока);
	
	// Для отслеживания ввода текста пользователем
	ВремяВводаПоследнегоСимвола = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСообшенияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	// Для отслеживания ввода текста пользователем
	ВремяВводаПоследнегоСимвола = ТекущаяДата();
	
КонецПроцедуры

