



// Команды
&НаКлиенте
Процедура ВремяБлокировкиРаботыПользователейПриИзменении(Элемент)	
	ВремяБлокировкиРаботыПользователейПриИзмененииНаСервере(Объект.ВремяБлокировкиРаботыПользователей);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВремяБлокировкиРаботыПользователейПриИзмененииНаСервере(ВремяБлокировкиРаботыПользователей)	
	Константы.ВремяБлокировкиРаботыПользователей.Установить(ВремяБлокировкиРаботыПользователей);	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьВходВСистемуПриБлокировкеПриИзменении(Элемент)
	РазрешитьВходВСистемуПриБлокировкеПриИзмененииНаСервере(Объект.РазрешитьВходВСистемуПриБлокировке);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазрешитьВходВСистемуПриБлокировкеПриИзмененииНаСервере(РазрешитьВходВСистемуПриБлокировке)
	Константы.РазрешитьВходВСистемуПриБлокировке.Установить(РазрешитьВходВСистемуПриБлокировке);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБлокировкуНа5Минут(Команда)
	
	УстановитьБлокировкуНаСервере(300);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьБлокировкуНаСервере(ВремяСекунд)
	
	Объект.ВремяБлокировкиРаботыПользователей = ТекущаяДатаСеанса() + ВремяСекунд;
	ВремяБлокировкиРаботыПользователейПриИзмененииНаСервере(Объект.ВремяБлокировкиРаботыПользователей);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьБлокировку(Команда)
	
	Объект.ВремяБлокировкиРаботыПользователей = '00010101';
	ВремяБлокировкиРаботыПользователейПриИзмененииНаСервере(Объект.ВремяБлокировкиРаботыПользователей);
	
КонецПроцедуры




// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Значения констант
	Объект.ВремяБлокировкиРаботыПользователей = Константы.ВремяБлокировкиРаботыПользователей.Получить();
	Объект.РазрешитьВходВСистемуПриБлокировке = Константы.РазрешитьВходВСистемуПриБлокировке.Получить();
		
КонецПроцедуры



