

// Процедуры и функции
&НаСервере
Процедура ОбновлениеРеквизитаДоступныеРоли()
	
	// Процедура обновляем реквизит "ДоступныеРоли" на всякий случай
	// Имеет место быть после порграммного редактирования или удаления
	//
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь1С,
		|	Пользователи.ПометкаУдаления КАК ПометкаУдаления,
		|	Пользователи.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	Пользователи.ДоступныеРоли КАК ДоступныеРоли
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл		
		Если ЗначениеЗаполнено(Выборка.УникальныйИдентификатор) Тогда
			
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.УникальныйИдентификатор);
			Если ПользовательИБ=Неопределено тогда
				
				Если НЕ Выборка.ПометкаУдаления Тогда
					Пользователь1СОбъект = Выборка.Пользователь1С.ПолучитьОбъект();
					Пользователь1СОбъект.ПометкаУдаления = Истина;
					Пользователь1СОбъект.Записать();
				КонецЕсли;
				
			Иначе	
				
				ДоступныеРолиСписок = "";
				Для Каждого Роль Из ПользовательИБ.Роли Цикл
					ДоступныеРолиСписок = ДоступныеРолиСписок + Роль.Имя + "; ";
				КонецЦикла;	
				
				Если ДоступныеРолиСписок<>Выборка.ДоступныеРоли ИЛИ Выборка.ПометкаУдаления Тогда
					Пользователь1СОбъект = Выборка.Пользователь1С.ПолучитьОбъект();
					Пользователь1СОбъект.ПометкаУдаления = Ложь;
					Пользователь1СОбъект.ДоступныеРоли = ДоступныеРолиСписок;
					Пользователь1СОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;			
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры



// Команды
&НаКлиенте
Процедура ОбновитьДоступныеРолиПользователей(Команда)
	
	ОбновлениеРеквизитаДоступныеРоли();
	Элементы.Список.Обновить();
	
КонецПроцедуры


// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеРеквизитаДоступныеРоли();

КонецПроцедуры

