

// Команды
&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры



// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнструкцияИгрока = Константы.ИнструкцияИгрока.Получить();
	
	ИгровойСерверПривилегированный.УстановитьДанныеОтображенияВопроса(ЭтаФорма, ИнструкцияИгрока);
		
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИгровойКлиент.ОбновитьВидимостьДанныхОтображенияВопроса(ЭтаФорма, ИнструкцияИгрока);
	
КонецПроцедуры

