


// Процедуры и функции
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруДанныхВопроса(Вопрос)
	
	Возврат Новый Структура("ВидВопроса,Длительность,Группа", Вопрос.ВидВопроса, Вопрос.Длительность,  Вопрос.Родитель);		
	
КонецФункции

&НаСервере
Процедура ОбновитьРеквезитыТЧ(ОбновитьСписокКоманд, ОбновитьСписокВопросов)
	
	// Обновление реквизитов ТЧ СписокКоманд
	КоличествоИгроковИтого = 0;
	Если ОбновитьСписокКоманд Тогда
		Для Каждого ЭлКоманда Из Объект.СписокКоманд Цикл
			ЭлКоманда.КоличествоИгроков = ЭлКоманда.Команда.Игроки.Количество();
			КоличествоИгроковИтого = КоличествоИгроковИтого + ЭлКоманда.КоличествоИгроков;
		КонецЦикла;	
	КонецЕсли;
	
	// Обновление реквизитов ТЧ СписокВопросов
	Если ОбновитьСписокВопросов Тогда
		Для Каждого ЭлВопрос Из Объект.СписокВопросов Цикл
			ЭлВопрос.ВидВопроса = ЭлВопрос.Вопрос.ВидВопроса;
			ЭлВопрос.Группа = ЭлВопрос.Вопрос.Родитель;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовФормыЭтапыИгры()
	
	// Видимость только у записанного документа		
	Элементы.ГруппаЭтапы.Видимость        = ЗначениеЗаполнено(Объект.Ссылка);	
	Элементы.СписокВопросовЭтап.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры	





// Команды
&НаКлиенте
Процедура ИгрокиКоманд(Команда)
	
	// Состав игроков:
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Необходимо записать документ!");
	Иначе
		ОткрытьФорму("Отчет.ИгрокиКоманд.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии,Игра",Истина,Объект.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаршрутВопросов(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Необходимо записать и провести документ!");
	ИначеЕсли НЕ Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Необходимо провести документ!");
	Иначе	
		ЗаполнитьМаршрутВопросовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаршрутВопросовДляОтладки(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Необходимо записать и провести документ!");
	ИначеЕсли НЕ Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Необходимо провести документ!");
	Иначе	
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаполнитьМаршрутВопросовДляОтладкиЗавершение", ЭтотОбъект);
		ПоказатьВводЧисла(ОписаниеОповещенияОЗавершении, 30);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаршрутВопросовДляОтладкиЗавершение(Результат, ДопПарам) Экспорт
	
	Если Результат<>Неопределено Тогда		
		ЗаполнитьМаршрутВопросовНаСервере(Результат);
	КонецЕсли;	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьМаршрутВопросовНаСервере(ОбщаяДлительностьДляВсех=Неопределено)
	
	// Заполняем регистр маршрута начиная со времени начала игры
	//
	
	// Ощищаем набор
	Набор = РегистрыСведений.МаршрутПроведенияИгры.СоздатьНаборЗаписей();
	Набор.Отбор.Игра.Установить(Объект.Ссылка);
	Набор.Записать(Истина);
	
	// Записываем набор
	НачалоСтарта = Объект.ВремяНачалаИгры;	
	Для Каждого ЭлемВопрос Из Объект.СписокВопросов Цикл
		
		Если ОбщаяДлительностьДляВсех=Неопределено Тогда
			Длительность = ЭлемВопрос.Длительность;
		Иначе
			Длительность = ОбщаяДлительностьДляВсех;
		КонецЕсли;	
		
		Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ЭлемВопрос);
		Запись.Игра = Объект.Ссылка;
		Запись.АктивныйВопрос = ?(ЭлемВопрос.НомерСтроки=1, Истина, Ложь);
		Запись.НомерСледования = ЭлемВопрос.НомерСтроки;
		Запись.ВремяСтарта = НачалоСтарта;
		Запись.ВремяЗавершения = НачалоСтарта + Длительность;
		Запись.Длительность = Длительность;
		Запись.Записать(Истина);
		
		НачалоСтарта = НачалоСтарта + Длительность + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВопросыИзГруппы(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьВопросыИзГруппыЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Игра.Форма.ДобавлениеЗадачИзГруппы", Новый Структура("Игра",Объект.Ссылка),ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВопросыИзГруппыЗавершение(Результат, ДопПарам) Экспорт
	
	Если Результат<>Неопределено Тогда
		КоличествоДобавленныхВопросов = ДобавитьВопросыИзГруппыЗавершениеНаСервере(Результат);
		ПоказатьПредупреждение(,"Добавлено " + КоличествоДобавленныхВопросов + " позиций");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьВопросыИзГруппыЗавершениеНаСервере(Результат)
	
	// Добавление воппрос из выбранной группы, только вопросов
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Вопросы.Ссылка КАК Вопрос,
	|	Вопросы.ВидВопроса КАК ВидВопроса,
	|	Вопросы.Длительность КАК Длительность
	|ИЗ
	|	Справочник.Вопросы КАК Вопросы
	|ГДЕ
	|	Вопросы.Ссылка В ИЕРАРХИИ(&ГруппаВопросов)
	|	И НЕ Вопросы.ЭтоГруппа
	|	И НЕ Вопросы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вопросы.Родитель.Родитель.Родитель.Код,
	|	Вопросы.Родитель.Родитель.Код,
	|	Вопросы.Родитель.Код,
	|	Вопросы.Код,
	|	Вопросы.Наименование";
	Запрос.УстановитьПараметр("ГруппаВопросов", Результат.ГруппаВопросов);
	
	КоличествоДобавленныхВопросов = 0;
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
				
		// Добавление вопроса
		нСтр = Объект.СписокВопросов.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр, Выборка);
		нСтр.Этап = Результат.ЭтапИгры;
		
		// Если вопрос не заголовок, то еще добавляем демонстрацию:
		Если Выборка.ВидВопроса = Перечисления.ВидВопроса.Тест ИЛИ Выборка.ВидВопроса = Перечисления.ВидВопроса.ВопросСОтветом Тогда
			нСтр = Объект.СписокВопросов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр, Выборка);
			нСтр.Длительность = нСтр.Длительность / Результат.ДелительВремениДемо;
			нСтр.Этап = Результат.ЭтапИгры;
			нСтр.ДемонстрацияОтвета = Истина;			
		КонецЕсли;	
		
		КоличествоДобавленныхВопросов = КоличествоДобавленныхВопросов + 1;
		
	КонецЦикла;
	
	Возврат КоличествоДобавленныхВопросов;
	
КонецФункции




// Обработчики событий ФормыДокумента
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	ОбновитьРеквезитыТЧ(Истина, Истина); // Обновление реквизитов ТЧ		
	ЭтапыИгры.Параметры.УстановитьЗначениеПараметра("ВладелецИгра", Объект.Ссылка); // Для этапов отбор только во владельцу
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементовФормыЭтапыИгры();	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьРеквезитыТЧ(Истина, Истина);
	ЭтапыИгры.Параметры.УстановитьЗначениеПараметра("ВладелецИгра", Объект.Ссылка); // Для этапов отбор только во владельцу
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВидимостьЭлементовФормыЭтапыИгры();	
КонецПроцедуры




// Обработчики событий ЭтапыИгры
&НаКлиенте
Процедура СписокКомандПриИзменении(Элемент)
	ОбновитьРеквезитыТЧ(Истина, Ложь);
КонецПроцедуры




// Обработчики событий СписокВопросов
&НаКлиенте
Процедура СписокВопросовВопросПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокВопросов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		СтрДанныхВопроса = ПолучитьСтруктуруДанныхВопроса(ТекущиеДанные.Вопрос);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтрДанныхВопроса);
	КонецЕсли;
	
КонецПроцедуры





// Обработчики событий ЭтапыИгры
&НаКлиенте
Процедура ЭтапыИгрыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина; // Создаем собственный элемент
	Парам = Новый Структура("ВладелецИгра,Родитель,Наименование", Объект.Ссылка, Родитель, ?(Копирование, Элемент.ТекущиеДанные.Наименование, ""));
	ОткрытьФорму("Справочник.ЭтапыИгры.ФормаОбъекта", Парам, Элемент); 	
	
КонецПроцедуры










