


Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;

		Если Длительность<5 Тогда
			ИгровойКлиентСервер.СообщитьПользователю("Время выполнения не должно быть меньше 5 сек!", Ссылка, "Объект.Длительность", , Отказ);		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидВопроса) Тогда
			
			ИгровойКлиентСервер.СообщитьПользователю("Не задан вид вопроса!", Ссылка, "Объект.ВидВопроса", , Отказ);		
			
		Иначе
			
			КоличествоОтветовТЧ = ОтветыНаВопрос.Количество();
			
			// Проверки по виду Вопроса:
			Если ВидВопроса=Перечисления.ВидВопроса.Тест Тогда
								
				Если КоличествоОтветовТЧ<2 Тогда                                      
					ИгровойКлиентСервер.СообщитьПользователю("Количество ответов в тесте должно быть не меньше двух!", Ссылка, "Объект.ОтветыНаВопрос", , Отказ);
				КонецЕсли;
				
				Если ИспользоватьПредставление Тогда // то для списка ответов на тест обязательно должно быть представление!
					Для Каждого Ответ Из ОтветыНаВопрос Цикл
						Если НЕ ЗначениеЗаполнено(Ответ.Представление) Тогда
							ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Ответ.НомерСтроки+" не задано ""Представление"" для вопроса!", Ссылка, "Объект.ОтветыНаВопрос["+(Ответ.НомерСтроки-1)+"].Представление", , Отказ);
						Иначе
							Ответ.Представление = СокрЛП(Ответ.Представление);  // Без лишних символов
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
				
				КоличествоПравильныхОтветов = 0;		                
				Для Каждого Ответ Из ОтветыНаВопрос Цикл
					Если Ответ.ОтветНаТест Тогда
						КоличествоПравильныхОтветов = КоличествоПравильныхОтветов + 1;
					КонецЕсли;
				КонецЦикла;			
				Если КоличествоПравильныхОтветов=0 Тогда
					ИгровойКлиентСервер.СообщитьПользователю("Не задан ответ на тест", Ссылка, "Объект.ОтветыНаВопрос[0].ОтветНаТест", , Отказ);					
				ИначеЕсли КоличествоПравильныхОтветов>1 Тогда
					ИгровойКлиентСервер.СообщитьПользователю("Ответ на тест должен быть только один!", Ссылка, "Объект.ОтветыНаВопрос[0].ОтветНаТест", , Отказ);
				КонецЕсли;
				
				Если Баллы=0 Тогда
					ИгровойКлиентСервер.СообщитьПользователю("Не задана оценка вопроса в баллах!", Ссылка, "Объект.Баллы", , Отказ);
				КонецЕсли;
				
				КоличествоОтветов = 1; // У теста всегда только 1 ответ
				
			ИначеЕсли ВидВопроса=Перечисления.ВидВопроса.ВопросСОтветом Тогда
				
				Если КоличествоОтветовТЧ=0 Тогда
					ИгровойКлиентСервер.СообщитьПользователю("Количество ответов в вопросе должно быть как минимум один!", Ссылка, "Объект.ОтветыНаВопрос", , Отказ);					
				КонецЕсли;	
				
				Если ИспользоватьПредставление Тогда // то для списка ответов обязательно должно быть представление!
					Для Каждого Ответ Из ОтветыНаВопрос Цикл
						Если НЕ ЗначениеЗаполнено(Ответ.Представление) Тогда
							ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Ответ.НомерСтроки+" не задано ""Представление""!", Ссылка, "Объект.ОтветыНаВопрос["+(Ответ.НомерСтроки-1)+"].Представление", , Отказ);				
						Иначе
							Ответ.Представление = СокрЛП(Ответ.Представление); // Без лишних символов
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
				
				// Ответ должен быть всегда!
				Для Каждого Ответ Из ОтветыНаВопрос Цикл
					Если НЕ ЗначениеЗаполнено(Ответ.Ответ) Тогда
						ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Ответ.НомерСтроки+" не задан вариант ответа!", Ссылка, "Объект.ОтветыНаВопрос["+(Ответ.НомерСтроки-1)+"].Ответ", , Отказ);
					Иначе
						Ответ.Ответ = СокрЛП(Ответ.Ответ);  // Без лишних символов
					КонецЕсли;
				КонецЦикла;
				
				Если Баллы=0 Тогда
					ИгровойКлиентСервер.СообщитьПользователю("Не задана оценка вопроса в баллах!", Ссылка, "Объект.Баллы", , Отказ);
				КонецЕсли;
				
				КоличествоОтветов = КоличествоОтветовТЧ;
				
			ИначеЕсли ВидВопроса=Перечисления.ВидВопроса.Заставка Тогда
				
				КоличествоОтветов = 0; // - у Заголовка нет ответов
				Баллы = 0;
				
			КонецЕсли;	
			
		КонецЕсли;	
				
		Если ВидДанныхОтображения=Перечисления.ВидДанныхОтображения.HTML И НЕ ЗначениеЗаполнено(ДанныеHTML) Тогда
			ИгровойКлиентСервер.СообщитьПользователю("Не указан путь URL!", Ссылка, "Объект.ДанныеHTML", , Отказ);				
		КонецЕсли;	
		
		Если ИспользуетсяДемонстрацияОтвета 
			И ВидДанныхОтображенияДемонстрацияОтвета = Перечисления.ВидДанныхОтображения.HTML 
			И НЕ ЗначениеЗаполнено(ДанныеHTMLДемонстрацияОтвета) Тогда
			ИгровойКлиентСервер.СообщитьПользователю("Не указан путь URL демонстрации ответа!", Ссылка, "Объект.ДанныеHTMLДемонстрацияОтвета", , Отказ);				
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры



