

// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение параметров
	Параметры.Свойство("ВариантыОтветовНаТест", ВариантыОтветовНаТест);
	Параметры.Свойство("Масштаб",               Масштаб);
	
	
	// Программное создание больших красивых масштабируемых кнопок
	Индекс = 0;
	Для Каждого Вариант Из ВариантыОтветовНаТест Цикл		
		НовКоманда = Команды.Добавить("Команда_ВыборТест"+Строка(Индекс));
		НовКоманда.Действие = "НажатиеКнопки";	
		НовЭл = Элементы.Добавить("Кнопка_ВыборТест"+Строка(Индекс), Тип("КнопкаФормы"), Элементы.Группа_Кнопки);
		НовЭл.ИмяКоманды = НовКоманда.Имя;
		НовЭл.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовЭл.Шрифт = Новый Шрифт(НовЭл.Шрифт,,14);
		НовЭл.Доступность = Истина;
		НовЭл.Видимость = Истина;
		НовЭл.Заголовок = Строка(Вариант.Значение);
		НовЭл.АвтоМаксимальнаяШирина = Ложь;
		НовЭл.РастягиватьПоГоризонтали = Истина;
		НовЭл.РастягиватьПоВертикали = Истина;
		Индекс = Индекс + 1;		
	КонецЦикла;
	
	//Элементы.Группа_Кнопки.Высота = ВариантыОтветовНаТест.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопки(Команда)
	
	// Получение выбранного значения и закрытие формы:
	Индекс = Число(СтрЗаменить(Команда.Имя, "Команда_ВыборТест", ""));
	Закрыть(ВариантыОтветовНаТест[Индекс]);	
	
КонецПроцедуры	


