

// Команды
&НаКлиенте
Процедура Добавить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ГруппаВопросов) Тогда	
		ПоказатьПредупреждение(,"Не выбрана группа вопросов!");	
	Иначе	
		ДелительВремениДемо = ?(КоэффициентУменьшенияВремениДемонстрацииОтвета=0,1,КоэффициентУменьшенияВремениДемонстрацииОтвета);
		ПараметрыЗакрыти = Новый Структура("ГруппаВопросов, ЭтапИгры, ДелительВремениДемо", ГруппаВопросов, ЭтапИгры, ДелительВремениДемо);	
		Закрыть(ПараметрыЗакрыти);
	КонецЕсли;
	
КонецПроцедуры



// обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение формы
	Игра = Параметры.Игра;
	Элементы.ЭтапИгры.Видимость = ЗначениеЗаполнено(Игра);	
	
	КоэффициентУменьшенияВремениДемонстрацииОтвета = 2;
	
КонецПроцедуры
