
// РАЗРАБОТКА:
// Проверить подключаемость игроков к базе - во время игры
// Заполнение вопросов по группе и этапу



// АДРЕСА БАЗЫ ДАННЫХ:
//Srvr="localhost:6541";Ref="quiz";
//Снаружи http://dev1c-3.i-neti.ru:48888/quiz/ru_RU/
//изнутри http://localhost/quiz/ru_RU/
//dev1c-3.i-neti.ru:33010


// ПЕРЕМЕННЫЕ:
Перем СписокФормИсключенийПриБлокировке Экспорт; // - используется для исключения закрываемых форм при блокировке "Только вход в систему"

// БЛОКИРОВКА РАБОТЫ ПОЛЬЗОВАТЕЛЕЙ:
Процедура ОбработчикОжиданияБлокировки() Экспорт
	
	СтрБлокировка = ИгровойСерверПривилегированный.ПолучитьЗначениеБлокировкиТекущегоПользователя();		
	Если ЗначениеЗаполнено(СтрБлокировка.ВремяЗавершенияБлокировки) И НЕ СтрБлокировка.РазрещенаРабота Тогда // Есть блокировка
		
		Если НЕ СтрБлокировка.РазрешенВходВСистему Тогда
			
			Оповещение = Новый ОписаниеОповещения("УстановкаБлокировки", ИгровойКлиент, Новый Структура("ЗавершитьРаботуСистемы",Истина));
			ПоказатьПредупреждение(Оповещение,"Администратор заблокировал работу пользователей до "+Строка(СтрБлокировка.ВремяЗавершенияБлокировки)+" "+Символы.ПС+"                       Ну всё!     Давай, до свидания!", 10);
			
		Иначе
			
			// Проверка открытых рабочих окон
			ЕстьОткрытыеРабочиеФормы = Ложь;
			Для Каждого ОкноПриложения Из ПолучитьОкна() Цикл
				Если НЕ ОкноПриложения.Основное И НЕ ОкноПриложения.НачальнаяСтраница Тогда
					Если СписокФормИсключенийПриБлокировке.НайтиПоЗначению(ОкноПриложения.Заголовок)=Неопределено Тогда
						ЕстьОткрытыеРабочиеФормы = Истина;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;	
			
			// Предупреждаем
			Если ЕстьОткрытыеРабочиеФормы Тогда
				Оповещение = Новый ОписаниеОповещения("УстановкаБлокировки", ИгровойКлиент, Новый Структура("ЗакрытьВсеРабочиеФормы",Истина));
				ПоказатьПредупреждение(Оповещение,"Администратор не разрешает работу в программе до "+Строка(СтрБлокировка.ВремяЗавершенияБлокировки), 10);
			КонецЕсли;
			
		КонецЕсли; 	
		
	КонецЕсли;
	
КонецПроцедуры

// НАЧАЛО РАБОТЫ:
Процедура ПриНачалеРаботыСистемы()
	
	// Заголовок
	УстановитьЗаголовокКлиентскогоПриложения("NetiQuiz v1.1");
	
	// Эти формы не будут закрывать при блокировке "Только вход в систему"
	СписокФормИсключенийПриБлокировке = Новый СписокЗначений;
	СписокФормИсключенийПриБлокировке.Добавить("Инструкция игрока"); 
	СписокФормИсключенийПриБлокировке.Добавить("Изменение пароля");
	СписокФормИсключенийПриБлокировке.Добавить("Отзыв о программе");
	СписокФормИсключенийПриБлокировке.Добавить("Подача апелляции");
	
	// Для отработки блокировки и обновления текущей формы
	ОбработчикОжиданияБлокировки();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияБлокировки", 15);
	
КонецПроцедуры
