

Процедура УстановкаПараметровСеанса()
	
	// Установка текущего пользователя
	//
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Параметр ТекущийПользователь
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ<>Неопределено Тогда
		
		Пользователь1С = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);	
		Если ЗначениеЗаполнено(Пользователь1С) Тогда // Устанавливаем и обновляем
			
			// Проверка / Jбновление данных 1С по данным ИБ
			Если Пользователь1С.Код<>ПользовательИБ.Имя 
				ИЛИ Пользователь1С.Наименование<>ПользовательИБ.ПолноеИмя 
				ИЛИ Пользователь1С.ПометкаУдаления Тогда
				Попытка
					Пользователь1СОбъект = Пользователь1С.ПолучитьОбъект();
					Пользователь1СОбъект.Код             = ПользовательИБ.Имя;
					Пользователь1СОбъект.Наименование    = ПользовательИБ.ПолноеИмя;
					Пользователь1СОбъект.ПометкаУдаления = Ложь;
					Пользователь1СОбъект.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;		
			КонецЕсли;	
			
			// Установка
			ПараметрыСеанса.ТекущийПользователь = Пользователь1С;
			
		Иначе
			
			// Создадим пользователя, если не нашли
			Попытка
				Пользователь1СОбъект =  Справочники.Пользователи.СоздатьЭлемент();
				Пользователь1СОбъект.Код                     = ПользовательИБ.Имя;
				Пользователь1СОбъект.Наименование            = ПользовательИБ.ПолноеИмя;
				Пользователь1СОбъект.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
				Пользователь1СОбъект.Записать();
				Сообщить("Создан новый пользователь: " + Пользователь1СОбъект.Код);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
			// Установка
			ПараметрыСеанса.ТекущийПользователь = Пользователь1СОбъект.Ссылка;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры