

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Т.к. объекты не доступны для пользователя с ролью "Игрок"
	// то отчет на СКД формируется в привилигированном режиме
	//	
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;	
	ОтчетСКД = Отчеты.РейтингИгроков.Создать();	                       
	НастройкиОтчета = ОтчетСКД.КомпоновщикНастроек.ПолучитьНастройки();
	
	// Установка текущей игры
	Для Каждого Элем Из НастройкиОтчета.ПараметрыДанных.Элементы Цикл		
		Если Элем.Параметр = Новый ПараметрКомпоновкиДанных("Игра") Тогда
			Элем.Значение = Константы.ТекущаяИгра.Получить();
		КонецЕсли;
		Если Элем.Параметр = Новый ПараметрКомпоновкиДанных("ТекущийПользователь") Тогда
			Элем.Значение = ПараметрыСеанса.ТекущийПользователь; 
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОтчетСКД.СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	ОтчетСКД = Неопределено;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
