

Функция СкопироватьЭтапыИгрыЛоВладельцу(Источник, Приемник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыИгры.Ссылка КАК Этап,
	               |	ЗНАЧЕНИЕ(Справочник.ЭтапыИгры.ПустаяСсылка) КАК ЭтапКопия
	               |ИЗ
	               |	Справочник.ЭтапыИгры КАК ЭтапыИгры
	               |ГДЕ
	               |	ЭтапыИгры.ВладелецИгра = &Источник
	               |АВТОУПОРЯДОЧИВАНИЕ";	
	Запрос.УстановитьПараметр("Источник", Источник);	
	ТЗ_КопируемыеЭтапы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ЭлТ Из ТЗ_КопируемыеЭтапы Цикл
		
		ЭтапКопияОбъект = ЭлТ.Этап.Скопировать();
		ЭтапКопияОбъект.ВладелецИгра = Приемник;
		Если ЗначениеЗаполнено(ЭтапКопияОбъект.Родитель) Тогда
			МассивСтр = ТЗ_КопируемыеЭтапы.НайтиСтроки(Новый Структура("Этап", ЭтапКопияОбъект.Родитель));
			Если МассивСтр.Количество()>0 Тогда
				ЭтапКопияОбъект.Родитель = МассивСтр[0].ЭтапКопия;
			КонецЕсли;	
		КонецЕсли;	
		ЭтапКопияОбъект.Записать();
		ЭлТ.ЭтапКопия = ЭтапКопияОбъект.Ссылка;
		
	КонецЦикла;	
	
	Возврат ТЗ_КопируемыеЭтапы;
	
КонецФункции