

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ Тогда
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			
			// Проверка "чужих" Этапов   [ПОСЛЕ КОПИРОВАНИИ]
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИграСписокВопросов.Этап.ВладелецИгра КАК Источник
			|ИЗ
			|	Документ.Игра.СписокВопросов КАК ИграСписокВопросов
			|ГДЕ
			|	ИграСписокВопросов.Ссылка = &Игра
			|	И ИграСписокВопросов.Этап.ВладелецИгра <> &Игра";
			Запрос.УстановитьПараметр("Игра", Ссылка);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				
				// Копируем этапы
				ТЗ_СкопированныеЭтапы = Документы.Игра.СкопироватьЭтапыИгрыЛоВладельцу(Выборка.Источник, Ссылка);
				
				// Заменяем на новые
				Для Каждого Эл Из СписокВопросов Цикл
					Если ЗначениеЗаполнено(Эл.Этап) Тогда
						МассивСтр = ТЗ_СкопированныеЭтапы.НайтиСтроки(Новый Структура("Этап",Эл.Этап));
						Если МассивСтр.Количество()>0 Тогда
							Эл.Этап = МассивСтр[0].ЭтапКопия; // замена
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				// Фиксируем новые этапы:
				Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка наличия состава команд
	// 
	Если СписокКоманд.Количество()=0 Тогда
		ИгровойКлиентСервер.СообщитьПользователю("Не выбрана ни одна команда для игры!", Ссылка, "Объект.СписокКоманд", , Отказ);
	Иначе	
		
		// Провека введенности данных
		Для Каждого Эл Из СписокКоманд Цикл
			Если НЕ ЗначениеЗаполнено(Эл.Команда) Тогда
				ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Эл.НомерСтроки+" не выбрана команда!", Ссылка, "Объект.СписокКоманд["+(Эл.НомерСтроки-1)+"].Команда", , Отказ);
			КонецЕсли;	
		КонецЦикла;	
		
		// Проверка задвоения участников
		//		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИграСписокКоманд.Команда КАК Команда
		|ПОМЕСТИТЬ СписокКоманд
		|ИЗ
		|	Документ.Игра.СписокКоманд КАК ИграСписокКоманд
		|ГДЕ
		|	ИграСписокКоманд.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомандыИгроки.Игрок КАК Игрок,
		|	СписокКоманд.Команда КАК Команда
		|ПОМЕСТИТЬ СписокКомандИИгроков
		|ИЗ
		|	Справочник.Команды.Игроки КАК КомандыИгроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокКоманд КАК СписокКоманд
		|		ПО КомандыИгроки.Ссылка = СписокКоманд.Команда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокКомандИИгроков.Игрок КАК Игрок
		|ПОМЕСТИТЬ ЗадвоенныеИгроки
		|ИЗ
		|	СписокКомандИИгроков КАК СписокКомандИИгроков
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокКомандИИгроков.Игрок
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(СписокКомандИИгроков.Команда) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокКомандИИгроков.Игрок КАК Игрок,
		|	СписокКомандИИгроков.Команда КАК Команда
		|ИЗ
		|	СписокКомандИИгроков КАК СписокКомандИИгроков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадвоенныеИгроки КАК ЗадвоенныеИгроки
		|		ПО СписокКомандИИгроков.Игрок = ЗадвоенныеИгроки.Игрок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Игрок";		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл			
				ИгровойКлиентСервер.СообщитьПользователю("Повторение игрока """ + СокрЛП(Выборка.Игрок) + """ в команде """ + СокрЛП(Выборка.Команда) + """", Ссылка, "Объект.СписокКоманд");
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	
	// Проверка наличия состава вопросов
	// 
	Если СписокВопросов.Количество()=0 Тогда
		ИгровойКлиентСервер.СообщитьПользователю("Не задан ни один вопрос для игры!", Ссылка, "Объект.СписокВопросов");		
	Иначе	
		
		
		// Проверка этапов
		Если ЗначениеЗаполнено(Ссылка) Тогда
			
			// На запонленность
			Для Каждого Эл Из СписокВопросов Цикл
				Если НЕ Эл.ДемонстрацияОтвета И НЕ ЗначениеЗаполнено(Эл.Этап) И (Эл.Вопрос.ВидВопроса=Перечисления.ВидВопроса.Тест ИЛИ Эл.Вопрос.ВидВопроса=Перечисления.ВидВопроса.ВопросСОтветом) Тогда
					ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Эл.НомерСтроки+" не задан этап!", Ссылка, "Объект.СписокВопросов["+(Эл.НомерСтроки-1)+"].Этап");
				КонецЕсли;
			КонецЦикла;	
			
			// На последовательность
			МассивПройденныхЭтапов = Новый Массив;
			Для Каждого Эл Из СписокВопросов Цикл
				Если НЕ Эл.ДемонстрацияОтвета И ЗначениеЗаполнено(Эл.Этап) И (Эл.Вопрос.ВидВопроса=Перечисления.ВидВопроса.Тест ИЛИ Эл.Вопрос.ВидВопроса=Перечисления.ВидВопроса.ВопросСОтветом) Тогда
					
					Если МассивПройденныхЭтапов.Найти(Эл.Этап)<>Неопределено Тогда					
						Если МассивПройденныхЭтапов.Получить(МассивПройденныхЭтапов.ВГраница())<>Эл.Этап Тогда
							ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Эл.НомерСтроки+" обнаружена последовательность этапов, не совпадающая с последовательностью номеров строк!", Ссылка, "Объект.СписокВопросов["+(Эл.НомерСтроки-1)+"].Этап");
						КонецЕсли;
					Иначе
						МассивПройденныхЭтапов.Добавить(Эл.Этап);			
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;			
			
		КонецЕсли;
		
		
		// Проверка установленного вопроса, времени
		//
		Для Каждого Эл Из СписокВопросов Цикл
			Если НЕ ЗначениеЗаполнено(Эл.Вопрос) Тогда
				ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Эл.НомерСтроки+" не введен вопрос!", Ссылка, "Объект.СписокВопросов["+(Эл.НомерСтроки-1)+"].Вопрос", , Отказ);
			КонецЕсли;
			Если Эл.Длительность=0 Тогда
				ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Эл.НомерСтроки+" не задана длительность!", Ссылка, "Объект.СписокВопросов["+(Эл.НомерСтроки-1)+"].Длительность", , Отказ);	
			КонецЕсли;
		КонецЦикла;	
		
		// Проверка ДемонстрационногоОтвета (показ ответа)
		Для Каждого Эл1 Из СписокВопросов Цикл
			Если ЗначениеЗаполнено(Эл1.Вопрос) И НЕ Эл1.ДемонстрацияОтвета Тогда			
				Для Каждого Эл2 Из СписокВопросов Цикл
					Если Эл2.НомерСтроки>=Эл1.НомерСтроки Тогда 
						Прервать; 
					КонецЕсли;		
					Если ЗначениеЗаполнено(Эл2.Вопрос) И Эл2.ДемонстрацияОтвета И Эл2.Вопрос = Эл1.Вопрос Тогда
						ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Эл2.НомерСтроки+" вопрос в режиме ""Демонстрация ответа"" расположен раньше, чем вопрос в строке №"+Эл1.НомерСтроки, Ссылка, "Объект.СписокВопросов["+(Эл2.НомерСтроки-1)+"].ДемонстрацияОтвета", , Отказ);
					КонецЕсли;	
				КонецЦикла;						
			КонецЕсли;
		КонецЦикла;	
		
		
		
		// Проверка задвоения вопросов
		//
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИграСписокВопросов.Вопрос КАК Вопрос,
		|	МАКСИМУМ(ИграСписокВопросов.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.Игра.СписокВопросов КАК ИграСписокВопросов
		|ГДЕ
		|	ИграСписокВопросов.Ссылка = &Ссылка
		|	И ИграСписокВопросов.Вопрос.ВидВопроса В (ЗНАЧЕНИЕ(Перечисление.ВидВопроса.Тест), ЗНАЧЕНИЕ(Перечисление.ВидВопроса.ВопросСОтветом))
		|	И НЕ ИграСписокВопросов.ДемонстрацияОтвета
		|
		|СГРУППИРОВАТЬ ПО
		|	ИграСписокВопросов.Вопрос
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ИграСписокВопросов.НомерСтроки) > 1
		|АВТОУПОРЯДОЧИВАНИЕ";	
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл			
				ИгровойКлиентСервер.СообщитьПользователю("В строке №"+Выборка.НомерСтроки+" повторение вопроса """ + СокрЛП(Выборка.Вопрос) + """ с ВидВоапроса=(Тест,ВопросСответом)", Ссылка, "Объект.СписокВопросов["+(Выборка.НомерСтроки-1)+"].Вопрос");		
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры


