

// Процедуры и функции
&НаСервере
Процедура УстановитьОтборПоИгреВДинамическихСписках()
	
	// Устанавливаем фиксированнный отбор в ДинамическихСписках
	//
	
	// ОтветыКоманд
	ФиксированныйОтбор = ОтветыКоманд.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Игра;
	Если ТолькоТекстовыеВопросы Тогда
		ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидВопроса");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.ВидВопроса.ВопросСОтветом;
	КонецЕсли;
	Если ТолькоНеОбработанныеОтветы Тогда
		ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	// ОтветыИгроков
	ФиксированныйОтбор = ОтветыИгроков.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Игра;
	
	// РейтингиИгроков
	ФиксированныйОтбор = РейтингиИгроков.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Игра;
	
КонецПроцедуры

&НаСервере
Процедура ОтветКомандыНаСервере(ОтветПравильный)
	
	Если ЗначениеЗаполнено(Объект.Игра) И ЗначениеЗаполнено(Объект.ОК_Вопрос) И ЗначениеЗаполнено(Объект.ОК_Команда) Тогда
		
		Запись = РегистрыСведений.ОтветыКоманд.СоздатьМенеджерЗаписи();
		Запись.Игра = Объект.Игра;
		Запись.Вопрос = Объект.ОК_Вопрос;
		Запись.Команда = Объект.ОК_Команда;
		Запись.НомерСтр = Объект.ОК_НомерСтр;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Баллы = ?(ОтветПравильный, Запись.БаллыНоминальные, 0);
			Запись.Ответственный = Объект.Ответственный;
			Запись.Записать(Истина);
		КонецЕсли;
		
		Элементы.ОтветыКоманд.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетСтатьи(СтатьяРейтинга, Рассчитывать, Коэффициент)
	
	Если Ложь Тогда СтатьяРейтинга = Справочники.СтатьиРейтинга.ПустаяСсылка(); КонецЕсли;
	
	// Очистка данных по статье:
	Набор = РегистрыСведений.РейтингиИгроков.СоздатьНаборЗаписей();
	Набор.Отбор.Игра.Установить(Объект.Игра);
	Набор.Отбор.СтатьяРейтинга.Установить(СтатьяРейтинга);
	Набор.Очистить();
	Набор.Записать(Истина);
	
	// Т.е. только очищаем регистр от данных этой статьи
	Если НЕ Рассчитывать Тогда Возврат; КонецЕсли;
	
	
	Если СтатьяРейтинга.Имя = "ЗаОтветыНаТест" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветыИгроков.Игра КАК Игра,
		|	ОтветыИгроков.Вопрос КАК Вопрос,
		|	ОтветыИгроков.НомерСтр КАК НомерСтр,
		|	ОтветыИгроков.Игрок КАК Игрок,
		|	ОтветыИгроков.Ответ КАК Ответ,
		|	ОтветыИгроков.Вопрос.Баллы КАК БаллыОценка
		|ПОМЕСТИТЬ Д_ОтветыИгроковНаТесты
		|ИЗ
		|	РегистрСведений.ОтветыИгроков КАК ОтветыИгроков
		|ГДЕ
		|	ОтветыИгроков.Игра = &Игра
		|	И ОтветыИгроков.НомерСтр = 1
		|	И ОтветыИгроков.Вопрос.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.ВидВопроса.Тест)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ОтветыИгроковНаТесты.Вопрос КАК Вопрос
		|ПОМЕСТИТЬ О_Вопросы
		|ИЗ
		|	Д_ОтветыИгроковНаТесты КАК Д_ОтветыИгроковНаТесты
		|
		|СГРУППИРОВАТЬ ПО
		|	Д_ОтветыИгроковНаТесты.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВопросыОтветыНаВопрос.Ссылка КАК Вопрос,
		|	ВЫБОР
		|		КОГДА ВопросыОтветыНаВопрос.Ссылка.ИспользоватьПредставление
		|			ТОГДА ВопросыОтветыНаВопрос.Представление
		|		ИНАЧЕ ВопросыОтветыНаВопрос.НомерСтроки
		|	КОНЕЦ КАК ОтветПравильный
		|ПОМЕСТИТЬ Д_ПравильныеОтветы
		|ИЗ
		|	О_Вопросы КАК О_Вопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вопросы.ОтветыНаВопрос КАК ВопросыОтветыНаВопрос
		|		ПО О_Вопросы.Вопрос = ВопросыОтветыНаВопрос.Ссылка
		|			И (ВопросыОтветыНаВопрос.ОтветНаТест)
		|ГДЕ
		|	ВопросыОтветыНаВопрос.ОтветНаТест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ОтветыИгроковНаТесты.Игра КАК Игра,
		|	Д_ОтветыИгроковНаТесты.Вопрос КАК Вопрос,
		|	Д_ОтветыИгроковНаТесты.НомерСтр КАК НомерСтр,
		|	Д_ОтветыИгроковНаТесты.Игрок КАК Игрок,
		|	Д_ОтветыИгроковНаТесты.БаллыОценка КАК Баллы,
		|	Д_ОтветыИгроковНаТесты.Ответ КАК Ответ,
		|	Д_ПравильныеОтветы.ОтветПравильный КАК ОтветПравильный
		|ИЗ
		|	Д_ОтветыИгроковНаТесты КАК Д_ОтветыИгроковНаТесты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Д_ПравильныеОтветы КАК Д_ПравильныеОтветы
		|		ПО Д_ОтветыИгроковНаТесты.Вопрос = Д_ПравильныеОтветы.Вопрос";
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			
			Если Строка(Выборка.Ответ)=Строка(Выборка.ОтветПравильный) Тогда			
				Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Баллы = Выборка.Баллы * Коэффициент;
				Запись.СтатьяРейтинга = СтатьяРейтинга;
				Запись.ДатаОбработки = Объект.ДатаОбработки;
				Запись.ОсновныеБаллы = Истина;
				Запись.Записать();			
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;	
	
	
	
	Если СтатьяРейтинга.Имя = "ЗаОтветыНаТекстовыеВопросы" Тогда
		
		//1. Расстояние Левенштейна
		//Возвращает число, которое показывает сколько нужно сделать операций (вставка, удаление или замена) для того, 
		//чтобы превратить одну строку в другую.
		//Свойства: простая реализация; зависимость от порядка слов; на выходе число; которое надо с чем-то сравнить.
		//	
		//2. Алгоритм шинглов
		//Разбивает тексты на шинглы (англ. — чешуйки), т.е цепочки по 10 слов (с пересечениями), 
		//применив к шинглам хеш-функции получает матрицы, которые и сравнивает между собой.
		//Свойства: чтобы реализовать алгоритм надо подробно изучать мат.часть; работает на больших текстах; 
		//нет зависимости от порядка предложений.
		//	
		//3. Коэффициент Жаккара (частное — коэф. Танимото)
		// К = с/(a+b-c)
		//Вычисляет коэффициент по формуле:
		//здесь a — количество символов в первой строке, b — количество символов во второй строке, c — количество совпадающих символов.
		//Свойства: прост в реализации; низкая точность, так как «abc» и «bca» для него одно и то же.
		//
		// Необходимо предусмотреть транслит с Анг. на Рус.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветыИгроков.Игра КАК Игра,
		|	ОтветыИгроков.Вопрос КАК Вопрос,
		|	ОтветыИгроков.НомерСтр КАК НомерСтр,
		|	ОтветыИгроков.Игрок КАК Игрок,
		|	ОтветыИгроков.Ответ КАК Ответ,
		|	ОтветыИгроков.Вопрос.Баллы КАК БаллыОценка
		|ПОМЕСТИТЬ Д_ОтветыИгроковНаТесты
		|ИЗ
		|	РегистрСведений.ОтветыИгроков КАК ОтветыИгроков
		|ГДЕ
		|	ОтветыИгроков.Игра = &Игра
		|	И ОтветыИгроков.Вопрос.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.ВидВопроса.ВопросСОтветом)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ОтветыИгроковНаТесты.Вопрос КАК Вопрос
		|ПОМЕСТИТЬ О_Вопросы
		|ИЗ
		|	Д_ОтветыИгроковНаТесты КАК Д_ОтветыИгроковНаТесты
		|
		|СГРУППИРОВАТЬ ПО
		|	Д_ОтветыИгроковНаТесты.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВопросыОтветыНаВопрос.Ссылка КАК Вопрос,
		|	ВопросыОтветыНаВопрос.НомерСтроки КАК НомерСтр,
		|	ВопросыОтветыНаВопрос.Ответ КАК ОтветПравильный
		|ПОМЕСТИТЬ Д_ПравильныеОтветы
		|ИЗ
		|	О_Вопросы КАК О_Вопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вопросы.ОтветыНаВопрос КАК ВопросыОтветыНаВопрос
		|		ПО О_Вопросы.Вопрос = ВопросыОтветыНаВопрос.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ОтветыИгроковНаТесты.Игра КАК Игра,
		|	Д_ОтветыИгроковНаТесты.Вопрос КАК Вопрос,
		|	Д_ОтветыИгроковНаТесты.НомерСтр КАК НомерСтр,
		|	Д_ОтветыИгроковНаТесты.Игрок КАК Игрок,
		|	Д_ОтветыИгроковНаТесты.БаллыОценка КАК Баллы,
		|	Д_ОтветыИгроковНаТесты.Ответ КАК Ответ,
		|	Д_ПравильныеОтветы.ОтветПравильный КАК ОтветПравильный
		|ИЗ
		|	Д_ОтветыИгроковНаТесты КАК Д_ОтветыИгроковНаТесты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Д_ПравильныеОтветы КАК Д_ПравильныеОтветы
		|		ПО Д_ОтветыИгроковНаТесты.Вопрос = Д_ПравильныеОтветы.Вопрос
		|			И Д_ОтветыИгроковНаТесты.НомерСтр = Д_ПравильныеОтветы.НомерСтр";
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			
			СтрОтветИгрока = НРЕГ(СокрЛП(Выборка.Ответ));
			СтрОтветВерный = НРЕГ(СокрЛП(Выборка.ОтветПравильный));
			
			КоэффициентСовпадения = 0;
			
			// Опредлеление коэффициента совпадения строки [комбинированный способ]
			Если СтрОтветИгрока=СтрОтветВерный Тогда
				
				// Полное совпадение 100%
				КоэффициентСовпадения = 1;
				
			ИначеЕсли СтрНайти(СтрОтветВерный, СтрОтветИгрока)>0 Тогда
				
				// Полное совпадение 95%  "условный" Нет точного совпадение но ответ точно верный или нет ошибки в слове ответа
				КоэффициентСовпадения = 0.95;
				
			Иначе	
				
				// Коэффициент Жаккара (частное — коэф. Танимото)
				КолСовпадающихСимв = 0;
				Для _н=1 По СтрДлина(СтрОтветИгрока) Цикл				
					ПозицияСимволаВСтроке = СтрНайти(СтрОтветВерный, Сред(СтрОтветИгрока,_н,1));				
					Если ПозицияСимволаВСтроке>0 Тогда 
						КолСовпадающихСимв = КолСовпадающихСимв + 1;				
					КонецЕсли;						
				КонецЦикла;
				// К = с/(a+b-c);		
				КоэффициентСовпадения = КолСовпадающихСимв / (СтрДлина(СтрОтветИгрока) + СтрДлина(СтрОтветВерный) - КолСовпадающихСимв);
				
				
				//// Коэффициент Мальцева "ТРИ символьное совпадение"
				//// Процент совпадения "тройного" символа
				////			
				//ДлинаСтрИгрока = СтрДлина(СтрОтветИгрока);
				//Если ДлинаСтрИгрока >=3 Тогда
				//	ЧислоПоследовательныхСимволов = 0;
				//	Для _н=1 По ДлинаСтрИгрока-2 Цикл							
				//		Если СтрНайти(СтрОтветВерный, Сред(СтрОтветИгрока,_н,3))>0 Тогда
				//			ЧислоПоследовательныхСимволов = ЧислоПоследовательныхСимволов + 1;
				//		КонецЕсли;				
				//	КонецЦикла;				
				//	КоэффициентСовпадения2 = ЧислоПоследовательныхСимволов / (ДлинаСтрИгрока-2);				
				//Иначе			
				//	КоэффициентСовпадения2 = 1;					
				//КонецЕсли;
				
			КонецЕсли;			
			
			Если КоэффициентСовпадения>0 Тогда			
				Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Баллы = Выборка.Баллы * Коэффициент * КоэффициентСовпадения;
				Запись.СтатьяРейтинга = СтатьяРейтинга;
				Запись.ДатаОбработки = Объект.ДатаОбработки;
				Запись.ОсновныеБаллы = Истина;
				Запись.Записать();			
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;	         
	
	
	Если СтатьяРейтинга.Имя = "НадбавкаЗаЛидирующуюКоманду" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветыКоманд.Игра КАК Игра,
		|	ОтветыКоманд.Команда КАК Команда,
		|	СУММА(ОтветыКоманд.Баллы) КАК БаллыИтого
		|ПОМЕСТИТЬ Д_ИтогИгры
		|ИЗ
		|	РегистрСведений.ОтветыКоманд КАК ОтветыКоманд
		|ГДЕ
		|	ОтветыКоманд.Игра = &Игра
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтветыКоманд.Игра,
		|	ОтветыКоманд.Команда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ИтогИгры.Игра КАК Игра,
		|	МАКСИМУМ(Д_ИтогИгры.БаллыИтого) КАК БаллыИтого
		|ПОМЕСТИТЬ Д_МаксимумБаллов
		|ИЗ
		|	Д_ИтогИгры КАК Д_ИтогИгры
		|
		|СГРУППИРОВАТЬ ПО
		|	Д_ИтогИгры.Игра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ИтогИгры.Игра КАК Игра,
		|	Д_ИтогИгры.Команда КАК Команда,
		|	Д_ИтогИгры.БаллыИтого КАК БаллыИтого
		|ПОМЕСТИТЬ Д_ЛидирующиеКоманды
		|ИЗ
		|	Д_ИтогИгры КАК Д_ИтогИгры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Д_МаксимумБаллов КАК Д_МаксимумБаллов
		|		ПО Д_ИтогИгры.БаллыИтого = Д_МаксимумБаллов.БаллыИтого
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ЛидирующиеКоманды.Игра КАК Игра,
		|	КомандыИгроки.НомерСтроки КАК НомерИгрока,
		|	КомандыИгроки.Игрок КАК Игрок
		|ИЗ
		|	Д_ЛидирующиеКоманды КАК Д_ЛидирующиеКоманды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
		|		ПО Д_ЛидирующиеКоманды.Команда = КомандыИгроки.Ссылка";		
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл		
			Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Баллы = Коэффициент;
			Запись.СтатьяРейтинга = СтатьяРейтинга;
			Запись.ДатаОбработки = Объект.ДатаОбработки;
			Запись.Записать();		
		КонецЦикла;	
		
	КонецЕсли;
	
	
	Если СтатьяРейтинга.Имя = "ЛучшийИгрокВСвоейКоманде_РасчетТолькоПоОдиночнымВопросам" Тогда
		
		// Должен быть после основного расчета баллов игроков
		// Только по вопросам с одиночными ответами
		//
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейтингиИгроков.Игра КАК Игра,
		|	РейтингиИгроков.СтатьяРейтинга КАК СтатьяРейтинга,
		|	РейтингиИгроков.Игрок КАК Игрок,
		|	РейтингиИгроков.Вопрос КАК Вопрос,
		|	РейтингиИгроков.НомерСтр КАК НомерСтр,
		|	РейтингиИгроков.Баллы КАК Баллы
		|ПОМЕСТИТЬ БаллыЗаОтветыНаВопросы
		|ИЗ
		|	РегистрСведений.РейтингиИгроков КАК РейтингиИгроков
		|ГДЕ
		|	РейтингиИгроков.Игра = &Игра
		|	И РейтингиИгроков.ОсновныеБаллы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Вопрос КАК Вопрос,
		|	МАКСИМУМ(БаллыЗаОтветыНаВопросы.НомерСтр) КАК КоличествоОтветов
		|ПОМЕСТИТЬ ОпределениеКоличестваОтветов
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыНаВопросы.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Игрок КАК Игрок,
		|	СУММА(БаллыЗаОтветыНаВопросы.Баллы) КАК Баллы
		|ПОМЕСТИТЬ БаллыИгрокаЗаОдиночныеВопросы
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОпределениеКоличестваОтветов КАК ОпределениеКоличестваОтветов
		|		ПО БаллыЗаОтветыНаВопросы.Вопрос = ОпределениеКоличестваОтветов.Вопрос
		|			И (ОпределениеКоличестваОтветов.КоличествоОтветов = 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыНаВопросы.Игрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИграСписокКоманд.Команда КАК Команда
		|ПОМЕСТИТЬ Команды
		|ИЗ
		|	Документ.Игра.СписокКоманд КАК ИграСписокКоманд
		|ГДЕ
		|	ИграСписокКоманд.Ссылка = &Игра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомандыИгроки.Ссылка КАК Команда,
		|	КомандыИгроки.НомерСтроки КАК НомерИгрока,
		|	КомандыИгроки.Игрок КАК Игрок
		|ПОМЕСТИТЬ ИгрокиКоманды
		|ИЗ
		|	Команды КАК Команды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
		|		ПО Команды.Команда = КомандыИгроки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИгрокиКоманды.Команда КАК Команда,
		|	ИгрокиКоманды.НомерИгрока КАК НомерИгрока,
		|	ИгрокиКоманды.Игрок КАК Игрок,
		|	БаллыИгрокаЗаОдиночныеВопросы.Баллы КАК Баллы
		|ПОМЕСТИТЬ БаллыЗаОтветыПоИгрокамИКомандам
		|ИЗ
		|	ИгрокиКоманды КАК ИгрокиКоманды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БаллыИгрокаЗаОдиночныеВопросы КАК БаллыИгрокаЗаОдиночныеВопросы
		|		ПО ИгрокиКоманды.Игрок = БаллыИгрокаЗаОдиночныеВопросы.Игрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыПоИгрокамИКомандам.Команда КАК Команда,
		|	БаллыЗаОтветыПоИгрокамИКомандам.Игрок КАК Игрок,
		|	СУММА(БаллыЗаОтветыПоИгрокамИКомандам.Баллы) КАК Баллы,
		|	БаллыЗаОтветыПоИгрокамИКомандам.НомерИгрока КАК НомерИгрока
		|ПОМЕСТИТЬ МаксимальныеБаллыВКомандеУИгрока
		|ИЗ
		|	БаллыЗаОтветыПоИгрокамИКомандам КАК БаллыЗаОтветыПоИгрокамИКомандам
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыПоИгрокамИКомандам.Команда,
		|	БаллыЗаОтветыПоИгрокамИКомандам.Игрок,
		|	БаллыЗаОтветыПоИгрокамИКомандам.НомерИгрока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллыВКомандеУИгрока.Команда КАК Команда,
		|	МАКСИМУМ(МаксимальныеБаллыВКомандеУИгрока.Баллы) КАК Баллы
		|ПОМЕСТИТЬ МаксимальныеБаллыВКоманде
		|ИЗ
		|	МаксимальныеБаллыВКомандеУИгрока КАК МаксимальныеБаллыВКомандеУИгрока
		|
		|СГРУППИРОВАТЬ ПО
		|	МаксимальныеБаллыВКомандеУИгрока.Команда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллыВКомандеУИгрока.Команда КАК Команда,
		|	МаксимальныеБаллыВКомандеУИгрока.Игрок КАК Игрок,
		|	МаксимальныеБаллыВКомандеУИгрока.НомерИгрока КАК НомерИгрока,
		|	МаксимальныеБаллыВКомандеУИгрока.Баллы КАК Баллы
		|ИЗ
		|	МаксимальныеБаллыВКомандеУИгрока КАК МаксимальныеБаллыВКомандеУИгрока
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныеБаллыВКоманде КАК МаксимальныеБаллыВКоманде
		|		ПО МаксимальныеБаллыВКомандеУИгрока.Команда = МаксимальныеБаллыВКоманде.Команда
		|			И МаксимальныеБаллыВКомандеУИгрока.Баллы = МаксимальныеБаллыВКоманде.Баллы";		
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		Результат = Запрос.Выполнить();		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл		
			Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
			Запись.Игра = Объект.Игра;
			Запись.СтатьяРейтинга = СтатьяРейтинга;
			Запись.Игрок = Выборка.Игрок;
			Запись.Баллы = Коэффициент;
			Запись.ДатаОбработки = Объект.ДатаОбработки;
			Запись.Комментарий = Строка(Выборка.Команда) + " №"+Строка(Выборка.НомерИгрока);
			Запись.Записать();				
		КонецЦикла;
		
	КонецЕсли;	
	
	
	Если СтатьяРейтинга.Имя = "ЛучшийИгрокВСвоейКоманде_РасчетТолькоИгроков_БольшиеВопросы" Тогда // [Уравниватель] - надбавка за активность в текстовых вопросах среди игроков
		
		// Должен быть после основного расчета баллов игроков
		// Только игроки
		// Только вопросы с ответами более > 1    Пример: "Фильмы по смайликам"
		
		//
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейтингиИгроков.Игра КАК Игра,
		|	РейтингиИгроков.СтатьяРейтинга КАК СтатьяРейтинга,
		|	РейтингиИгроков.Игрок КАК Игрок,
		|	РейтингиИгроков.Вопрос КАК Вопрос,
		|	РейтингиИгроков.НомерСтр КАК НомерСтр,
		|	РейтингиИгроков.Баллы КАК Баллы
		|ПОМЕСТИТЬ БаллыЗаОтветыНаВопросы
		|ИЗ
		|	РегистрСведений.РейтингиИгроков КАК РейтингиИгроков
		|ГДЕ
		|	РейтингиИгроков.Игра = &Игра
		|	И РейтингиИгроков.ОсновныеБаллы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Вопрос КАК Вопрос,
		|	МАКСИМУМ(БаллыЗаОтветыНаВопросы.НомерСтр) КАК КоличествоОтветов
		|ПОМЕСТИТЬ ОпределениеКоличестваОтветов
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыНаВопросы.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Игрок КАК Игрок,
		|	СУММА(БаллыЗаОтветыНаВопросы.Баллы) КАК Баллы
		|ПОМЕСТИТЬ БаллыИгрокаЗаОдиночныеВопросы
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОпределениеКоличестваОтветов КАК ОпределениеКоличестваОтветов
		|		ПО БаллыЗаОтветыНаВопросы.Вопрос = ОпределениеКоличестваОтветов.Вопрос
		|			И (ОпределениеКоличестваОтветов.КоличествоОтветов > 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыНаВопросы.Игрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИграСписокКоманд.Команда КАК Команда
		|ПОМЕСТИТЬ Команды
		|ИЗ
		|	Документ.Игра.СписокКоманд КАК ИграСписокКоманд
		|ГДЕ
		|	ИграСписокКоманд.Ссылка = &Игра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомандыИгроки.Ссылка КАК Команда,
		|	КомандыИгроки.НомерСтроки КАК НомерИгрока,
		|	КомандыИгроки.Игрок КАК Игрок
		|ПОМЕСТИТЬ ИгрокиКоманды
		|ИЗ
		|	Команды КАК Команды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
		|		ПО Команды.Команда = КомандыИгроки.Ссылка
		|ГДЕ
		|	КомандыИгроки.НомерСтроки > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИгрокиКоманды.Команда КАК Команда,
		|	ИгрокиКоманды.НомерИгрока КАК НомерИгрока,
		|	ИгрокиКоманды.Игрок КАК Игрок,
		|	БаллыИгрокаЗаОдиночныеВопросы.Баллы КАК Баллы
		|ПОМЕСТИТЬ БаллыЗаОтветыПоИгрокамИКомандам
		|ИЗ
		|	ИгрокиКоманды КАК ИгрокиКоманды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БаллыИгрокаЗаОдиночныеВопросы КАК БаллыИгрокаЗаОдиночныеВопросы
		|		ПО ИгрокиКоманды.Игрок = БаллыИгрокаЗаОдиночныеВопросы.Игрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыПоИгрокамИКомандам.Команда КАК Команда,
		|	БаллыЗаОтветыПоИгрокамИКомандам.Игрок КАК Игрок,
		|	СУММА(БаллыЗаОтветыПоИгрокамИКомандам.Баллы) КАК Баллы,
		|	БаллыЗаОтветыПоИгрокамИКомандам.НомерИгрока КАК НомерИгрока
		|ПОМЕСТИТЬ МаксимальныеБаллыВКомандеУИгрока
		|ИЗ
		|	БаллыЗаОтветыПоИгрокамИКомандам КАК БаллыЗаОтветыПоИгрокамИКомандам
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыПоИгрокамИКомандам.Команда,
		|	БаллыЗаОтветыПоИгрокамИКомандам.Игрок,
		|	БаллыЗаОтветыПоИгрокамИКомандам.НомерИгрока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллыВКомандеУИгрока.Команда КАК Команда,
		|	МАКСИМУМ(МаксимальныеБаллыВКомандеУИгрока.Баллы) КАК Баллы
		|ПОМЕСТИТЬ МаксимальныеБаллыВКоманде
		|ИЗ
		|	МаксимальныеБаллыВКомандеУИгрока КАК МаксимальныеБаллыВКомандеУИгрока
		|
		|СГРУППИРОВАТЬ ПО
		|	МаксимальныеБаллыВКомандеУИгрока.Команда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллыВКомандеУИгрока.Команда КАК Команда,
		|	МаксимальныеБаллыВКомандеУИгрока.Игрок КАК Игрок,
		|	МаксимальныеБаллыВКомандеУИгрока.НомерИгрока КАК НомерИгрока,
		|	МаксимальныеБаллыВКомандеУИгрока.Баллы КАК Баллы
		|ИЗ
		|	МаксимальныеБаллыВКомандеУИгрока КАК МаксимальныеБаллыВКомандеУИгрока
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныеБаллыВКоманде КАК МаксимальныеБаллыВКоманде
		|		ПО МаксимальныеБаллыВКомандеУИгрока.Команда = МаксимальныеБаллыВКоманде.Команда
		|			И МаксимальныеБаллыВКомандеУИгрока.Баллы = МаксимальныеБаллыВКоманде.Баллы";			
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		Результат = Запрос.Выполнить();		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл		
			Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
			Запись.Игра = Объект.Игра;
			Запись.СтатьяРейтинга = СтатьяРейтинга;
			Запись.Игрок = Выборка.Игрок;
			Запись.Баллы = Коэффициент;
			Запись.ДатаОбработки = Объект.ДатаОбработки;
			Запись.Комментарий = Строка(Выборка.Команда) + " №"+Строка(Выборка.НомерИгрока);
			Запись.Записать();				
		КонецЦикла;
		
	КонецЕсли;	
	
	
	Если СтатьяРейтинга.Имя = "ЗаСамыйБыстрыйПравильныйОтвет" Тогда // Расчет среди всех игроков игры
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейтингиИгроков.Игра КАК Игра,
		|	РейтингиИгроков.СтатьяРейтинга КАК СтатьяРейтинга,
		|	РейтингиИгроков.Игрок КАК Игрок,
		|	РейтингиИгроков.Вопрос КАК Вопрос,
		|	РейтингиИгроков.НомерСтр КАК НомерСтр,
		|	РейтингиИгроков.Баллы КАК Баллы
		|ПОМЕСТИТЬ БаллыЗаОтветыНаВопросы
		|ИЗ
		|	РегистрСведений.РейтингиИгроков КАК РейтингиИгроков
		|ГДЕ
		|	РейтингиИгроков.Игра = &Игра
		|	И РейтингиИгроков.ОсновныеБаллы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Вопрос КАК Вопрос,
		|	БаллыЗаОтветыНаВопросы.НомерСтр КАК НомерСтр,
		|	МАКСИМУМ(БаллыЗаОтветыНаВопросы.Баллы) КАК МаксимальныеБаллы
		|ПОМЕСТИТЬ ОпределениеМаксимальногоКоличестваБаллов
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыНаВопросы.Вопрос,
		|	БаллыЗаОтветыНаВопросы.НомерСтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Игра КАК Игра,
		|	БаллыЗаОтветыНаВопросы.Игрок КАК Игрок,
		|	БаллыЗаОтветыНаВопросы.Вопрос КАК Вопрос,
		|	БаллыЗаОтветыНаВопросы.НомерСтр КАК НомерСтр,
		|	БаллыЗаОтветыНаВопросы.Баллы КАК Баллы
		|ПОМЕСТИТЬ О_МаксимальныеОтветы
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОпределениеМаксимальногоКоличестваБаллов КАК ОпределениеМаксимальногоКоличестваБаллов
		|		ПО БаллыЗаОтветыНаВопросы.Вопрос = ОпределениеМаксимальногоКоличестваБаллов.Вопрос
		|			И БаллыЗаОтветыНаВопросы.НомерСтр = ОпределениеМаксимальногоКоличестваБаллов.НомерСтр
		|			И БаллыЗаОтветыНаВопросы.Баллы = ОпределениеМаксимальногоКоличестваБаллов.МаксимальныеБаллы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	О_МаксимальныеОтветы.Игра КАК Игра,
		|	О_МаксимальныеОтветы.Игрок КАК Игрок,
		|	О_МаксимальныеОтветы.Вопрос КАК Вопрос,
		|	О_МаксимальныеОтветы.НомерСтр КАК НомерСтр,
		|	О_МаксимальныеОтветы.Баллы КАК Баллы,
		|	ОтветыИгроков.ВремяОтвета КАК ВремяОтвета
		|ПОМЕСТИТЬ ВремяОтветовИгроков
		|ИЗ
		|	РегистрСведений.ОтветыИгроков КАК ОтветыИгроков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ О_МаксимальныеОтветы КАК О_МаксимальныеОтветы
		|		ПО ОтветыИгроков.Игра = О_МаксимальныеОтветы.Игра
		|			И ОтветыИгроков.Вопрос = О_МаксимальныеОтветы.Вопрос
		|			И ОтветыИгроков.НомерСтр = О_МаксимальныеОтветы.НомерСтр
		|			И ОтветыИгроков.Игрок = О_МаксимальныеОтветы.Игрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремяОтветовИгроков.Вопрос КАК Вопрос,
		|	ВремяОтветовИгроков.НомерСтр КАК НомерСтр,
		|	МИНИМУМ(ВремяОтветовИгроков.ВремяОтвета) КАК МинимальноеВремяОтвета
		|ПОМЕСТИТЬ ПервоеВремяОтвета
		|ИЗ
		|	ВремяОтветовИгроков КАК ВремяОтветовИгроков
		|
		|СГРУППИРОВАТЬ ПО
		|	ВремяОтветовИгроков.Вопрос,
		|	ВремяОтветовИгроков.НомерСтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремяОтветовИгроков.Игра КАК Игра,
		|	ВремяОтветовИгроков.Игрок КАК Игрок,
		|	ВремяОтветовИгроков.Вопрос КАК Вопрос,
		|	ВремяОтветовИгроков.НомерСтр КАК НомерСтр,
		|	ВремяОтветовИгроков.ВремяОтвета КАК ВремяОтвета,
		|	ВремяОтветовИгроков.Баллы КАК Баллы
		|ИЗ
		|	ВремяОтветовИгроков КАК ВремяОтветовИгроков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоеВремяОтвета КАК ПервоеВремяОтвета
		|		ПО ВремяОтветовИгроков.Вопрос = ПервоеВремяОтвета.Вопрос
		|			И ВремяОтветовИгроков.НомерСтр = ПервоеВремяОтвета.НомерСтр
		|			И ВремяОтветовИгроков.ВремяОтвета = ПервоеВремяОтвета.МинимальноеВремяОтвета";		
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		Результат = Запрос.Выполнить();		
		Выборка = Результат.Выбрать();		
		Пока Выборка.Следующий() Цикл
			
			Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
			Запись.Игра = Выборка.Игра;
			Запись.СтатьяРейтинга = СтатьяРейтинга;
			Запись.Игрок = Выборка.Игрок;
			Запись.Вопрос = Выборка.Вопрос;
			Запись.НомерСтр = Выборка.НомерСтр;
			Запись.Баллы =  Выборка.Баллы * Коэффициент;
			Запись.ДатаОбработки = Объект.ДатаОбработки;
			Запись.Комментарий = "Время ответа: "+Строка(Выборка.ВремяОтвета);
			Запись.Записать();		
			
		КонецЦикла;
		
	КонецЕсли;	
	
	
	Если СтатьяРейтинга.Имя = "НадбавкаИгрокамЗаТекстовыеОтветы_БольшиеВопросы" Тогда  // [Уравниватель]
		
		// Только игрокам, чьи правильные ответы были даны раньше капитанов
		// Только по вопросам количество которых больше > 1      Пример: "Фильмы по смайликам"
		// 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИграСписокКоманд.Команда КАК Команда
		|ПОМЕСТИТЬ Команды
		|ИЗ
		|	Документ.Игра.СписокКоманд КАК ИграСписокКоманд
		|ГДЕ
		|	ИграСписокКоманд.Ссылка = &Игра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомандыИгроки.Ссылка КАК Команда,
		|	КомандыИгроки.НомерСтроки КАК НомерИгрока,
		|	КомандыИгроки.Игрок КАК Игрок
		|ПОМЕСТИТЬ ИгрокиКоманды
		|ИЗ
		|	Команды КАК Команды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
		|		ПО Команды.Команда = КомандыИгроки.Ссылка
		|ГДЕ
		|	КомандыИгроки.НомерСтроки > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейтингиИгроков.Игра КАК Игра,
		|	РейтингиИгроков.Игрок КАК Игрок,
		|	РейтингиИгроков.Вопрос КАК Вопрос,
		|	РейтингиИгроков.НомерСтр КАК НомерСтр,
		|	РейтингиИгроков.Баллы КАК Баллы
		|ПОМЕСТИТЬ БаллыЗаОтветыНаВопросы
		|ИЗ
		|	РегистрСведений.РейтингиИгроков КАК РейтингиИгроков
		|ГДЕ
		|	РейтингиИгроков.Игра = &Игра
		|	И РейтингиИгроков.ОсновныеБаллы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БаллыЗаОтветыНаВопросы.Вопрос КАК Вопрос,
		|	МАКСИМУМ(БаллыЗаОтветыНаВопросы.НомерСтр) КАК КоличествоОтветов
		|ПОМЕСТИТЬ ОпределениеКоличестваОтветов
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|
		|СГРУППИРОВАТЬ ПО
		|	БаллыЗаОтветыНаВопросы.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИгрокиКоманды.Команда КАК Команда,
		|	ИгрокиКоманды.НомерИгрока КАК НомерИгрока,
		|	БаллыЗаОтветыНаВопросы.Игра КАК Игра,
		|	БаллыЗаОтветыНаВопросы.Игрок КАК Игрок,
		|	БаллыЗаОтветыНаВопросы.Вопрос КАК Вопрос,
		|	БаллыЗаОтветыНаВопросы.НомерСтр КАК НомерСтр,
		|	БаллыЗаОтветыНаВопросы.Баллы КАК Баллы
		|ПОМЕСТИТЬ Команда_БаллыИгрокаЗаБольшиеВопросы
		|ИЗ
		|	БаллыЗаОтветыНаВопросы КАК БаллыЗаОтветыНаВопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОпределениеКоличестваОтветов КАК ОпределениеКоличестваОтветов
		|		ПО БаллыЗаОтветыНаВопросы.Вопрос = ОпределениеКоличестваОтветов.Вопрос
		|			И (ОпределениеКоличестваОтветов.КоличествоОтветов > 1)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИгрокиКоманды КАК ИгрокиКоманды
		|		ПО БаллыЗаОтветыНаВопросы.Игрок = ИгрокиКоманды.Игрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.Команда КАК Команда,
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.НомерИгрока КАК НомерИгрока,
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.Игра КАК Игра,
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.Игрок КАК Игрок,
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.Вопрос КАК Вопрос,
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.НомерСтр КАК НомерСтр,
		|	Команда_БаллыИгрокаЗаБольшиеВопросы.Баллы КАК Баллы,
		|	ЕСТЬNULL(ОтветыКоманд.ВремяОтвета, ДАТАВРЕМЯ(3000, 5, 31)) КАК ВремяОтветаКоманды,
		|	ЕСТЬNULL(ОтветыИгроков.ВремяОтвета, ДАТАВРЕМЯ(3000, 5, 31)) КАК ВремяОтветаИгрока
		|ПОМЕСТИТЬ Д_ВремяОтветовИгроков
		|ИЗ
		|	Команда_БаллыИгрокаЗаБольшиеВопросы КАК Команда_БаллыИгрокаЗаБольшиеВопросы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыКоманд КАК ОтветыКоманд
		|		ПО (Команда_БаллыИгрокаЗаБольшиеВопросы.Команда = ОтветыКоманд.Команда)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.Игра = ОтветыКоманд.Игра)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.Вопрос = ОтветыКоманд.Вопрос)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.НомерСтр = ОтветыКоманд.НомерСтр)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыИгроков КАК ОтветыИгроков
		|		ПО (Команда_БаллыИгрокаЗаБольшиеВопросы.Команда = ОтветыИгроков.Команда)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.Игра = ОтветыИгроков.Игра)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.Игрок = ОтветыИгроков.Игрок)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.Вопрос = ОтветыИгроков.Вопрос)
		|			И (Команда_БаллыИгрокаЗаБольшиеВопросы.НомерСтр = ОтветыИгроков.НомерСтр)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Д_ВремяОтветовИгроков.Команда КАК Команда,
		|	Д_ВремяОтветовИгроков.НомерИгрока КАК НомерИгрока,
		|	Д_ВремяОтветовИгроков.Игра КАК Игра,
		|	Д_ВремяОтветовИгроков.Игрок КАК Игрок,
		|	Д_ВремяОтветовИгроков.Вопрос КАК Вопрос,
		|	Д_ВремяОтветовИгроков.НомерСтр КАК НомерСтр,
		|	Д_ВремяОтветовИгроков.Баллы КАК Баллы,
		|	Д_ВремяОтветовИгроков.ВремяОтветаКоманды КАК ВремяОтветаКоманды,
		|	Д_ВремяОтветовИгроков.ВремяОтветаИгрока КАК ВремяОтветаИгрока
		|ИЗ
		|	Д_ВремяОтветовИгроков КАК Д_ВремяОтветовИгроков
		|ГДЕ
		|	Д_ВремяОтветовИгроков.ВремяОтветаИгрока <= Д_ВремяОтветовИгроков.ВремяОтветаКоманды";			
		Запрос.УстановитьПараметр("Игра", Объект.Игра);
		
		Результат = Запрос.Выполнить();		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл		
			Запись = РегистрыСведений.РейтингиИгроков.СоздатьМенеджерЗаписи();
			Запись.Игра = Объект.Игра;
			Запись.СтатьяРейтинга = СтатьяРейтинга;
			Запись.Игрок = Выборка.Игрок;
			Запись.Вопрос = Выборка.Вопрос;
			Запись.НомерСтр = Выборка.НомерСтр;
			Запись.Баллы = Выборка.Баллы * Коэффициент;
			Запись.ДатаОбработки = Объект.ДатаОбработки;
			Запись.Комментарий = Строка(Выборка.Команда) + "  ВИ:"+Строка(Выборка.ВремяОтветаИгрока) + "  ВК:"+Строка(Выборка.ВремяОтветаКоманды);
			Запись.Записать();				
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьКолонокТЧОтветовКоманд()
	
	Элементы.ОтветыКомандВидВопроса.Видимость    = НЕ ТолькоТекстовыеВопросы;
	Элементы.ОтветыКомандОтветственный.Видимость = НЕ ТолькоНеОбработанныеОтветы;
	
КонецПроцедуры	







// Команды: ОтветыКоманд
&НаКлиенте
Процедура ОбновитьДинамическийСписокОтветовКоманд(Команда)
	
	Элементы.ОтветыКоманд.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДинамическийСписокРассмотренияАпелляций(Команда)
	
	Элементы.ПодачаАпелляции.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПравильныеОтветыКоманды(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Игра) Тогда
		ПоказатьПредупреждение(,"Не задана игра!");
		Возврат;
	КонецЕсли;
	ОбновитьПравильныеОтветыКомандыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПравильныеОтветыКомандыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветыКоманд.Игра КАК Игра,
	|	ОтветыКоманд.Вопрос КАК Вопрос,
	|	ОтветыКоманд.Команда КАК Команда,
	|	ОтветыКоманд.НомерСтр КАК НомерСтр
	|ПОМЕСТИТЬ Д_ОтветыКоманд
	|ИЗ
	|	РегистрСведений.ОтветыКоманд КАК ОтветыКоманд
	|ГДЕ
	|	ОтветыКоманд.Игра = &Игра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Д_ОтветыКоманд.Вопрос КАК Вопрос
	|ПОМЕСТИТЬ Д_Вопросы
	|ИЗ
	|	Д_ОтветыКоманд КАК Д_ОтветыКоманд
	|
	|СГРУППИРОВАТЬ ПО
	|	Д_ОтветыКоманд.Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветыНаВопрос_Тесты.Ссылка КАК Вопрос,
	|	1 КАК НомерСтр,
	|	ВЫБОР
	|		КОГДА ОтветыНаВопрос_Тесты.Ссылка.ИспользоватьПредставление
	|			ТОГДА ОтветыНаВопрос_Тесты.Представление
	|		ИНАЧЕ ОтветыНаВопрос_Тесты.НомерСтроки
	|	КОНЕЦ КАК ОтветПравильный,
	|	ОтветыНаВопрос_Тесты.Ссылка.Баллы КАК БаллыНоминальные
	|ПОМЕСТИТЬ Д_ПравильныеОтветыНаТесты
	|ИЗ
	|	Д_Вопросы КАК Д_Вопросы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вопросы.ОтветыНаВопрос КАК ОтветыНаВопрос_Тесты
	|		ПО Д_Вопросы.Вопрос = ОтветыНаВопрос_Тесты.Ссылка
	|			И (ОтветыНаВопрос_Тесты.ОтветНаТест = ИСТИНА)
	|			И (Д_Вопросы.Вопрос.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.ВидВопроса.Тест))
	|ГДЕ
	|	ОтветыНаВопрос_Тесты.ОтветНаТест = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветыНаВопрос_Тесты.Ссылка КАК Вопрос,
	|	ОтветыНаВопрос_Тесты.НомерСтроки КАК НомерСтр,
	|	ОтветыНаВопрос_Тесты.Ответ КАК ОтветПравильный,
	|	ОтветыНаВопрос_Тесты.Ссылка.Баллы КАК БаллыНоминальные
	|ПОМЕСТИТЬ Д_ПравильныеТекстовыеОтветыНаВопросы
	|ИЗ
	|	Д_Вопросы КАК Д_Вопросы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вопросы.ОтветыНаВопрос КАК ОтветыНаВопрос_Тесты
	|		ПО Д_Вопросы.Вопрос = ОтветыНаВопрос_Тесты.Ссылка
	|			И (Д_Вопросы.Вопрос.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.ВидВопроса.ВопросСОтветом))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Д_ОтветыКоманд.Игра КАК Игра,
	|	Д_ОтветыКоманд.Вопрос КАК Вопрос,
	|	Д_ОтветыКоманд.Команда КАК Команда,
	|	Д_ОтветыКоманд.НомерСтр КАК НомерСтр,
	|	ЕСТЬNULL(Д_ПравильныеОтветыНаТесты.ОтветПравильный, Д_ПравильныеТекстовыеОтветыНаВопросы.ОтветПравильный) КАК ОтветПравильный,
	|	ЕСТЬNULL(Д_ПравильныеОтветыНаТесты.БаллыНоминальные, Д_ПравильныеТекстовыеОтветыНаВопросы.БаллыНоминальные) КАК БаллыНоминальные
	|ИЗ
	|	Д_ОтветыКоманд КАК Д_ОтветыКоманд
	|		ЛЕВОЕ СОЕДИНЕНИЕ Д_ПравильныеОтветыНаТесты КАК Д_ПравильныеОтветыНаТесты
	|		ПО Д_ОтветыКоманд.Вопрос = Д_ПравильныеОтветыНаТесты.Вопрос
	|			И Д_ОтветыКоманд.НомерСтр = Д_ПравильныеОтветыНаТесты.НомерСтр
	|		ЛЕВОЕ СОЕДИНЕНИЕ Д_ПравильныеТекстовыеОтветыНаВопросы КАК Д_ПравильныеТекстовыеОтветыНаВопросы
	|		ПО Д_ОтветыКоманд.Вопрос = Д_ПравильныеТекстовыеОтветыНаВопросы.Вопрос
	|			И Д_ОтветыКоманд.НомерСтр = Д_ПравильныеТекстовыеОтветыНаВопросы.НомерСтр";	
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл	
		Запись = РегистрыСведений.ОтветыКоманд.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "Игра,Вопрос,Команда,НомерСтр");
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(Запись, Выборка, "ОтветПравильный,БаллыНоминальные");
			Запись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;	
	
	Элементы.ОтветыКоманд.Обновить();
	
	Сообщить("Успешно обновлено "+Выборка.Количество()+" ответов / начисляемых баллов команд!");
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаТестовКоманды(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Игра) Тогда
		ПоказатьПредупреждение(,"Не задана игра!");
		Возврат;
	КонецЕсли;
	ОценкаТестовКомандыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОценкаТестовКомандыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветыКоманд.Игра КАК Игра,
	|	ОтветыКоманд.Вопрос КАК Вопрос,
	|	ОтветыКоманд.Команда КАК Команда,
	|	ОтветыКоманд.НомерСтр КАК НомерСтр,
	|	ВЫБОР
	|		КОГДА ОтветыКоманд.Ответ = ОтветыКоманд.ОтветПравильный
	|			ТОГДА ОтветыКоманд.БаллыНоминальные
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Баллы
	|ИЗ
	|	РегистрСведений.ОтветыКоманд КАК ОтветыКоманд
	|ГДЕ
	|	ОтветыКоманд.Игра = &Игра
	|	И ОтветыКоманд.Вопрос.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.ВидВопроса.Тест)";	
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл	
		Запись = РегистрыСведений.ОтветыКоманд.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "Игра,Вопрос,Команда,НомерСтр");
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Баллы = Выборка.Баллы;
			Запись.Ответственный = Объект.Ответственный;
			Запись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;	
	
	Элементы.ОтветыКоманд.Обновить();
	
	Сообщить("Успешно оценено "+Выборка.Количество()+" ответов на тесты!");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветКомандыПравильный(Команда)
	ОтветКомандыПравильныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтветКомандыПравильныйНаСервере()	
	ОтветКомандыНаСервере(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ОтветКомандыЛожный(Команда)
	ОтветКомандыЛожныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтветКомандыЛожныйНаСервере()
	ОтветКомандыНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АнализИСопоставлениеОтветовНаВопросыКоманды(Команда)
	АнализИСопоставлениеОтветовНаВопросыКомандыНаСервере();
КонецПроцедуры

&НаСервере
Процедура АнализИСопоставлениеОтветовНаВопросыКомандыНаСервере()
	
	// Вставить содержимое обработчика.
КонецПроцедуры



// Команды: РасчётРейтингаИгроков
&НаКлиенте
Процедура ЗаполнитьВсеСтатьиРейтингаИгроков(Команда)
	
	ЗаполнитьВсеСтатьиРейтингаИгроковНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеСтатьиРейтингаИгроковНаСервере()
	
	// Очистка
	Объект.ТЧСтатьиРейтинга.Очистить();
	
	
	// Заполнение
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Рассчитывать,
	|	СтатьиРейтинга.Код КАК Код,
	|	СтатьиРейтинга.Ссылка КАК СтатьяРейтинга,
	|	СтатьиРейтинга.Коэффициент КАК Коэффициент
	|ИЗ
	|	Справочник.СтатьиРейтинга КАК СтатьиРейтинга
	|ГДЕ
	|	НЕ СтатьиРейтинга.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатьиРейтинга.Код";	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ТЧСтатьиРейтинга.Добавить(), Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРейтингИгроков(Команда)
	
	РассчитатьРейтингИгроковНаСервере();
	Элементы.РейтингиИгроков.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьРейтингИгроковНаСервере()
	
	Если Объект.Игра.Пустая() Тогда
		ИгровойКлиентСервер.СообщитьПользователю("Не заполнена игра!", , "Объект.Игра");
		Возврат;
	КонецЕсли;	 
	
	Объект.ДатаОбработки = ТекущаяДатаСеанса();
	
	// Последовательный расчёт
	Для Каждого ЭлТЧ Из Объект.ТЧСтатьиРейтинга Цикл
		Если ЗначениеЗаполнено(ЭлТЧ.СтатьяРейтинга) Тогда			
			РасчетСтатьи(ЭлТЧ.СтатьяРейтинга, ЭлТЧ.Рассчитывать, ЭлТЧ.Коэффициент);		
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДинамическийСписокРейтингИгроков(Команда)
	
	Элементы.РейтингиИгроков.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРейтингИгроков(Команда)
	
	ОткрытьФорму("Отчет.РейтингИгроков.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии",Истина));
	
КонецПроцедуры


// Команды (Масштаб)
&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры





// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	ТолькоТекстовыеВопросы = Истина;
	ТолькоНеОбработанныеОтветы = Истина;
	Объект.Игра = Константы.ТекущаяИгра.Получить();
	УстановитьОтборПоИгреВДинамическихСписках();
	ВидимостьКолонокТЧОтветовКоманд();
	
	ЗаполнитьВсеСтатьиРейтингаИгроковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИграПриИзменении(Элемент)
	ИграПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИграПриИзмененииНаСервере()
	УстановитьОтборПоИгреВДинамическихСписках();
КонецПроцедуры

&НаКлиенте
Процедура ОтветыКомандПриАктивизацииСтроки(Элемент)
	
	// Реквизиты активизированной строки
	Если Элемент.ТекущиеДанные<>Неопределено Тогда
		Объект.ОК_Вопрос   = Элемент.ТекущиеДанные.Вопрос;
		Объект.ОК_Команда  = Элемент.ТекущиеДанные.Команда;
		Объект.ОК_НомерСтр = Элемент.ТекущиеДанные.НомерСтр;
	Иначе
		Объект.ОК_Вопрос   = ПредопределенноеЗначение("Справочник.Вопросы.ПустаяСсылка");
		Объект.ОК_Команда  = ПредопределенноеЗначение("Справочник.Команды.ПустаяСсылка");
		Объект.ОК_НомерСтр = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНеОбработанныеОтветыПриИзменении(Элемент)
	
	УстановитьОтборПоИгреВДинамическихСписках();
	ВидимостьКолонокТЧОтветовКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоТекстовыеВопросыПриИзменении(Элемент)
	
	УстановитьОтборПоИгреВДинамическихСписках();
	ВидимостьКолонокТЧОтветовКоманд();
	
КонецПроцедуры
















