

// БЛОКИРОВКА РАБОТЫ ПОЛЬЗОВАТЕЛЕЙ
Процедура УстановкаБлокировки(ДопПараметры) Экспорт
	
	// Проверка:
	Если ДопПараметры.Свойство("ЗавершитьРаботуСистемы") Тогда
		
		// Просто выбрасываем из системы
		ЗавершитьРаботуСистемы(Ложь);
		
	ИначеЕсли ДопПараметры.Свойство("ЗакрытьВсеРабочиеФормы") Тогда	
		
		// Закрываем все открытые формы, кроме начальной страницы и системы
		Для Каждого ОкноПриложения Из ПолучитьОкна() Цикл
			Если НЕ ОкноПриложения.Основное И НЕ ОкноПриложения.НачальнаяСтраница Тогда
				Если СписокФормИсключенийПриБлокировке.НайтиПоЗначению(ОкноПриложения.Заголовок)=Неопределено Тогда		
					Форма = ОкноПриложения.ПолучитьСодержимое();
					Форма.Закрыть();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры



// ВРЕМЯ "0:00:00"
Функция ПолучитьВремяВЧасахМинутахИСекундах(ВремяСекунд) Экспорт
	
	// Алгоритм развертывания времени из секунд в строку 
	// в формате "0:00:00" ИЛИ "0:00"
	//
	
	Если ВремяСекунд<=0 Тогда
		ВремяМинутСекунд = "0:00";
	Иначе	
		// Часы:
		Если ВремяСекунд>=3600 Тогда 
			ВремяЧасов = Цел(ВремяСекунд/3600);
			ВремяСекунд = ВремяСекунд-ВремяЧасов*3600; // -оставшееся время секунд
		Иначе
			ВремяЧасов = 0;
		КонецЕсли;
		// Минуты:
		ВремяМинут = Цел(ВремяСекунд/60);
		// Развернутое время в формате "0:00:00" ИЛИ "0:00"
		ВремяМинутСекунд = ?(ВремяЧасов>0,Строка(ВремяЧасов)+":","")+?(ВремяЧасов>0,Прав("00"+Строка(ВремяМинут),2),Строка(ВремяМинут))+":"+Прав("00"+Строка(ВремяСекунд-ВремяМинут*60),2);
	КонецЕсли;
	
	Возврат ВремяМинутСекунд;
	
КонецФункции



// ДАННЫЕ ОТОБРАЖЕНИЯ ВОПРОСА
Процедура ОбновитьВидимостьДанныхОтображенияВопроса(Форма, Объект, ЭтоДемонстрацияОтвета=Ложь) Экспорт
			
	ДемонстрацияОтвета = ?(ЭтоДемонстрацияОтвета, "ДемонстрацияОтвета", "");  
		
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Вопросы") Тогда // Это ссылка
		ВидДанныхОтображения = ИгровойСерверПривилегированный.ПолучитьРеквизитОбъекта(Объект, "ВидДанныхОтображения"+ДемонстрацияОтвета);	
	Иначе
		ВидДанныхОтображения = Объект["ВидДанныхОтображения"+ДемонстрацияОтвета];
	КонецЕсли;	
	
	Если ВидДанныхОтображения = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
		
		Форма.Элементы["Группа_ФорматируемыйДокумент"+ДемонстрацияОтвета].Видимость = Ложь;
		Форма.Элементы["Группа_HTML"+ДемонстрацияОтвета].Видимость = Истина;		
		
	Иначе // по-умолчанию "Форматируемый документ"		
		
		Форма.Элементы["Группа_ФорматируемыйДокумент"+ДемонстрацияОтвета].Видимость = Истина;
		Форма.Элементы["Группа_HTML"+ДемонстрацияОтвета].Видимость = Ложь;	
		
	КонецЕсли;	
	
КонецПроцедуры
