

// Команды
&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры



// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение параметров:
	Параметры.Свойство("Игра", Отчет.Игра);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	СкомпоноватьРезультат();
	
КонецПроцедуры

