



// Процедуры и функции
&НаСервере
Процедура ОбновитьДанныеФормыНаСервере()
	
	СтруктураИнф = ИгровойСерверПривилегированный.ПолучитьДанныеТекущейИгры();
	ЗаголовокСтрока = СтруктураИнф.Заголовок;
	ДанныеСтрока    = СтруктураИнф.Информация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеФормыОбработчикОжидания();
			
	ОбновитьДанныеФормыНаСервере();
	
КонецПроцедуры



// Команды
&НаКлиенте
Процедура ОбновитьДанныеФормы(Команда)
	
	ОбновитьДанныеФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПарольТекущегоПользователя(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаИзмененияПароля", , ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура Выйти(Команда)
	
	// Давай, до свидания!
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОставитьОтзыв(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаОставитьОтзыв", , ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияИгрока(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаИнструкцияИгрока", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧат(Команда)
	
	// Чат
	ОткрытьФорму("РегистрСведений.Чат.Форма.Чат");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтветовКомандыРассмотренныхАпелляций(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаОтветовКомандыРассмотренныхАпелляций", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры



// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
		Заголовок = "Добро пожаловать  "+СокрЛП(ПараметрыСеанса.ТекущийПользователь)+"!";
	КонецЕсли;	
	
	ОбновитьДанныеФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Для обновления данных на случай изменения администратором
	ПодключитьОбработчикОжидания("ОбновитьДанныеФормыОбработчикОжидания", 60, Ложь);
	
КонецПроцедуры




