



// Команды
&НаКлиенте
Процедура Подать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Обращение) Тогда
		ПоказатьПредупреждение(,"Не заполнено обращение!");
	Иначе	
		ПодатьНаСервере();
		ПоказатьПредупреждение(,"Ответ появится после рассмотрения в окне ""Рассмотренные апелляции""");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Создание записи в регистре:
	Запись = РегистрыСведений.ПодачаАпелляции.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма, "Игра,Команда,Вопрос,НомерСтр,Игрок,Обращение");
	Запись.ВремяПодачи = ТекущаяДата();	
	Запись.Записать();	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
		
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
		
КонецПроцедуры



// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Вопрос") Тогда // - это произвольное открытие формы;
		Отказ = Истина; 
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Игра,Команда,Вопрос,НомерСтр,ОтветКоманды,ОтветПравильный");
	ИгровойСерверПривилегированный.УстановитьДанныеОтображенияВопроса(ЭтаФорма, Вопрос);
	
	Игрок = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИгровойКлиент.ОбновитьВидимостьДанныхОтображенияВопроса(ЭтаФорма, Вопрос);
	
КонецПроцедуры
