


// Команды
&НаСервере
Функция ПолучитьКлючЗаписи()
	
	Ключ = Новый Структура("Игра,Вопрос,Команда,НомерСтр");
	ЗаполнитьЗначенияСвойств(Ключ, Запись, "Игра,Вопрос,Команда,НомерСтр");
	
	Возврат РегистрыСведений.ОтветыКоманд.СоздатьКлючЗаписи(Ключ);
	
КонецФункции	

&НаКлиенте
Процедура ОткрытьОтветКоманды(Команда)
	
	Парам = Новый Структура("Ключ", ПолучитьКлючЗаписи());
	ОткрытьФорму("РегистрСведений.ОтветыКоманд.ФормаЗаписи", Парам);	
	
КонецПроцедуры





// Процедуры и функции
&НаКлиенте
Процедура ДоступностьПолейРедактирования()
	
	Элементы.Решение.ТолькоПросмотр = Запись.Рассмотрена;
	
КонецПроцедуры




// Обработчики событий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступностьПолейРедактирования(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РассмотренаПриИзменении(Элемент)
	
	Если Запись.Рассмотрена Тогда
		Если НЕ ЗначениеЗаполнено(Запись.Решение) Тогда
			ПоказатьПредупреждение(,"Не заполнено решение по апелляции!");
			Запись.Рассмотрена = Ложь;
		Иначе
			Записать();
			Закрыть();		
		КонецЕсли;
	КонецЕсли;
	
	ДоступностьПолейРедактирования();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ВремяРассмотрения = ТекущаяДатаСеанса();
	ТекущийОбъект.ОтветственныйЗаРассмотрение = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры



