


// Процедуры и функции
&НаКлиенте
Процедура ОбновитьВидимостьКолонокТЧОтветов()
	
	Если Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Тест") Тогда
		
		Элементы.СтраницаВопрос.Заголовок = "ТЕСТ";
		Элементы.СтраницаОтвет.Заголовок  = "ВАРИАНТЫ ОТВЕТОВ НА ТЕСТ";
		
		Элементы.ИспользоватьПредставление.Видимость = Истина;
		Элементы.ИспользоватьПредставление.Заголовок = "Использовать колонку ""Представление"" вместо номера № при выборе ответов на тест";
		Элементы.ОтветыНаВопрос.Видимость = Истина;	
		Элементы.ОтветыНаВопросОтвет.Видимость = Ложь;
		Элементы.ОтветыНаВопросОтветНаТест.Видимость = Истина;		
		Элементы.ОтветыНаВопросПредставление.Видимость = Объект.ИспользоватьПредставление;
		
		Элементы.Баллы.Видимость = Истина;
		
		Элементы.ОтветыНаВопросШаблонДаНет.Видимость = Истина;
		Элементы.ОтветыНаВопросШаблонПравдаЛожь.Видимость = Истина;
		
	ИначеЕсли Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.ВопросСОтветом") Тогда
		
		Элементы.СтраницаВопрос.Заголовок = "ВОПРОС";
		Элементы.СтраницаОтвет.Заголовок  = "ПИСЬМЕННЫЕ ВАРИАНТЫ ОТВЕТОВ";
		
		Элементы.ИспользоватьПредставление.Видимость = Истина;
		Элементы.ИспользоватьПредставление.Заголовок = "Использовать колонку ""Представление""";
		Элементы.ОтветыНаВопрос.Видимость = Истина;
		Элементы.ОтветыНаВопросОтвет.Видимость = Истина;
		Элементы.ОтветыНаВопросОтветНаТест.Видимость = Ложь;		 
		Элементы.ОтветыНаВопросПредставление.Видимость = Объект.ИспользоватьПредставление;	
		
		Элементы.Баллы.Видимость = Истина;	
		
		Элементы.ОтветыНаВопросШаблонДаНет.Видимость = Ложь;
		Элементы.ОтветыНаВопросШаблонПравдаЛожь.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Заставка") Тогда		
		
		Элементы.СтраницаВопрос.Заголовок = "ЗАСТАВКА";
		Элементы.СтраницаОтвет.Заголовок  = "Комментарий";
		
		Элементы.ИспользоватьПредставление.Видимость = Ложь;
		Элементы.ОтветыНаВопрос.Видимость = Ложь;
		
		Элементы.Баллы.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСтраницыДемонстрацияОтвета()
	
	Элементы.СтраницаДемонстрацияОтвета.Видимость   = Объект.ИспользуетсяДемонстрацияОтвета;
	Элементы.СтраницаДемонстрацияОтвета.Доступность = Объект.ИспользуетсяДемонстрацияОтвета;
	
КонецПроцедуры

&НаСервере
Процедура ИгровойСерверПривилегированный_УстановитьДанные_HTML(ЭтоДемонстрацияОтвета=Ложь) 
	
	// Чтобы не передавать контекст с &Клиента на &Сервер [ошибка сериализации]
	//
	ИгровойСерверПривилегированный.УстановитьДанные_HTML(ЭтаФорма, Объект, ЭтоДемонстрацияОтвета);
	
КонецПроцедуры	




// Команды
&НаКлиенте
Процедура ШаблонДаНет(Команда)
	
	// МАА+ 2026.10.16 Пример 2-го изменнеия для проверки в GIT
	// Сообщить("Привет!");
	
	Объект.ИспользоватьПредставление = Истина;
	ОбновитьВидимостьКолонокТЧОтветов();
	
	Объект.ОтветыНаВопрос.Очистить();
	Стр1 = Объект.ОтветыНаВопрос.Добавить();
	Стр1.Представление = "Да";
	Стр2 = Объект.ОтветыНаВопрос.Добавить();
	Стр2.Представление = "Нет";
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПравдаЛожь(Команда)
	
	Объект.ИспользоватьПредставление = Истина;
	ОбновитьВидимостьКолонокТЧОтветов();
	
	Объект.ОтветыНаВопрос.Очистить();
	Стр1 = Объект.ОтветыНаВопрос.Добавить();
	Стр1.Представление = "Правда";
	Стр2 = Объект.ОтветыНаВопрос.Добавить();
	Стр2.Представление = "Ложь";
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрВИгровомСтоле(Команда)
	
	Попытка
		Записать();
		
		// Открыть форму для просмотра вопроса:
		Парам = Новый Структура("РежимДемонстрационногоПросмотраВопроса,Вопрос,ДемонстрацияОтвета", Истина, Объект.Ссылка, Ложь);
		ОткрытьФорму("Обработка.ИгровойСтолУчастника.Форма", Парам, ЭтаФорма);	
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрВИгровомСтолеДемонстрацияОтвета(Команда)
	
	Попытка
		Записать();
		
		// Открыть форму для просмотра демонстрации ответа на вопрос:
		Парам = Новый Структура("РежимДемонстрационногоПросмотраВопроса,Вопрос,ДемонстрацияОтвета", Истина, Объект.Ссылка, Истина);
		ОткрытьФорму("Обработка.ИгровойСтолУчастника.Форма", Парам, ЭтаФорма);	
	Исключение
	КонецПопытки;	
	
КонецПроцедуры




// Обработчики событий
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ФорматированныйДокумент - Получение данных нашего вопроса-заставки из ХранилищаЗначений
	ИгровойСерверПривилегированный.УстановитьДанные_ФорматированныйДокумент(ЭтаФорма, ТекущийОбъект);
	ИгровойСерверПривилегированный.УстановитьДанные_ФорматированныйДокумент(ЭтаФорма, ТекущийОбъект, True);
	
	// HTML
	ИгровойСерверПривилегированный.УстановитьДанные_HTML(ЭтаФорма, ТекущийОбъект);
	ИгровойСерверПривилегированный.УстановитьДанные_HTML(ЭтаФорма, ТекущийОбъект, True);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда // Это НОВЫЙ*		
		Объект.Ответственный                          = ПараметрыСеанса.ТекущийПользователь; // Автор вопроса
		Объект.ВидДанныхОтображения                   = Перечисления.ВидДанныхОтображения.ФорматируемыйДокумент;
		Объект.ВидДанныхОтображенияДемонстрацияОтвета = Перечисления.ВидДанныхОтображения.ФорматируемыйДокумент;
	КонецЕсли;
	
	// Длительность
	Объект.Длительность = 60;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьКолонокТЧОтветов();	
	ОбновитьВидимостьСтраницыДемонстрацияОтвета();
	
	ИгровойКлиент.ОбновитьВидимостьДанныхОтображенияВопроса(ЭтаФорма, Объект);
	ИгровойКлиент.ОбновитьВидимостьДанныхОтображенияВопроса(ЭтаФорма, Объект, True);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДанныеФорматированныйДокумент                   = Новый ХранилищеЗначения(ФорматированныйДокумент);
	ТекущийОбъект.ДанныеФорматированныйДокументДемонстрацияОтвета = Новый ХранилищеЗначения(ФорматированныйДокументДемонстрацияОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВопросаПриИзменении(Элемент)
	
	ОбновитьВидимостьКолонокТЧОтветов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПредставлениеПриИзменении(Элемент)
	
	ОбновитьВидимостьКолонокТЧОтветов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяДемонстрацияОтветаПриИзменении(Элемент)
	
	ОбновитьВидимостьСтраницыДемонстрацияОтвета();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДанныхОтображенияПриИзменении(Элемент)
	
	ИгровойКлиент.ОбновитьВидимостьДанныхОтображенияВопроса(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДанныхОтображенияДемонстрацияОтветаПриИзменении(Элемент)
	
	ИгровойКлиент.ОбновитьВидимостьДанныхОтображенияВопроса(ЭтаФорма, Объект, True);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеHTMLПриИзменении(Элемент)
	
	ИгровойСерверПривилегированный_УстановитьДанные_HTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеHTMLДемонстрацияОтветаПриИзменении(Элемент)
	
	ИгровойСерверПривилегированный_УстановитьДанные_HTML(True);
	
КонецПроцедуры



