

// Процедуры и функции
&НаКлиенте
Процедура НовыйПарольПриИзменении(Элемент)
	
	Если НовыйПароль1=НовыйПароль2 Тогда
		СовпаденияПаролей = "";
	Иначе	
		СовпаденияПаролей = "(не совпадают)";	
	КонецЕсли;
	
КонецПроцедуры




// Команды
&НаКлиенте
Процедура ИзменитьПароль(Команда)
	
	Если НовыйПароль2="" Тогда
		ПоказатьПредупреждение(,"Новый пароль должен быть обязательно задан!");
	Иначе		
		Если НовыйПароль1<>НовыйПароль2 Тогда
			ПоказатьПредупреждение(,"Нет совпадений с новым подтверждением пароля!");
		Иначе	
			ПарольУспешноИзменен = ИзменитьПарольНаСервере();
			Если ПарольУспешноИзменен Тогда
				ПоказатьПредупреждение(,"Пароль успешно изменен!");
				Закрыть();
			Иначе
				ПоказатьПредупреждение(,"Пароль не изменен! Не верно был указан текущий пароль.");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьПарольНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Если хеш подтверждения пароля совпадает со старым хешем тогда изменяем пароль
	ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.ТекущийПользователь();
	ХешАвторизации = ПользовательИнформационнойБазы.СохраняемоеЗначениеПароля;
	
	ПользовательИнформационнойБазы.Пароль = ТекущийПароль;
	ПользовательИнформационнойБазы.Записать();
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПараметрыСеанса.ТекущийПользователь.УникальныйИдентификатор);
	ХешПроверкиТекущегоПароля = Пользователь.СохраняемоеЗначениеПароля;
	
	ПарольУспешноИзменен = Ложь;
	Если ХешПроверкиТекущегоПароля = ХешАвторизации Тогда
		ПользовательИнформационнойБазы.Пароль = НовыйПароль2;
		ПользовательИнформационнойБазы.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;
		ПользовательИнформационнойБазы.Записать();
		ПарольУспешноИзменен = Истина;
	Иначе
		ПользовательИнформационнойБазы.СохраняемоеЗначениеПароля = ХешАвторизации;
		ПользовательИнформационнойБазы.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат ПарольУспешноИзменен;
	
КонецФункции

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры



// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Текущие параметры
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Имя                     = Пользователь.Имя;
	ПолноеИмя               = Пользователь.ПолноеИмя;
	ПоказыватьВСпискеВыбора = Пользователь.ПоказыватьВСпискеВыбора;
	//Наименование            = ПараметрыСеанса.ТекущийПользователь.Наименование;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

