
// РЕКВИЗИТ ОБЪЕКТА
Функция ПолучитьРеквизитОбъекта(СсылкаНаОбъект,ИмяРеквизита) Экспорт
	
	Возврат СсылкаНаОбъект[ИмяРеквизита];
	
КонецФункции



// ОПЕРАТИВНЫЕ ФУНКЦИИ
Функция ПолучитьДанныеТекущегоВопроса(Игра) Экспорт
	
	// Как только устанавливается активный вопрос, то его данные обновляются системой согласно текущим 
	// и все пользователи начинают считывать этот новый вопрос
	// Старые при этом могут оставаться активными, но чтобы до них добраться
	// нужно сбросить активность всех следующих за ним записей
	//	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьАктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.ДемонстрацияОтвета КАК ДемонстрацияОтвета,
	|	МаршрутПроведенияИгры.Длительность КАК Длительность,
	|	МаршрутПроведенияИгры.ВремяСтарта КАК ВремяСтарта,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения,
	|	МаршрутПроведенияИгры.ВремяНачалаПаузы КАК ВремяНачалаПаузы,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы,
	|	МаршрутПроведенияИгры.СтрокаСостояния КАК СтрокаСостояния
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.Игра = &Игра
	|	И МаршрутПроведенияИгры.АктивныйВопрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутПроведенияИгры.НомерСледования УБЫВ";
	Запрос.УстановитьПараметр("Игра", Игра);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда // Игра еще не введена
		
		СтрВопрос = Новый Структура("ЕстьАктивныйВопрос,НомерСледования,Вопрос,ДемонстрацияОтвета,ВремяНачалаПаузы,ВремяОкончанияПаузы,ВремяЗавершения,СтрокаСостояния", Ложь, 0, Справочники.Вопросы.ПустаяСсылка(), Ложь, Дата(1,1,1), Дата(1,1,1), Дата(1,1,1));
		
	иначе	
		
		СтрВопрос = Новый Структура("ЕстьАктивныйВопрос,НомерСледования,Вопрос,ДемонстрацияОтвета,ВремяНачалаПаузы,ВремяОкончанияПаузы,ВремяЗавершения,СтрокаСостояния");	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтрВопрос, Выборка);
		
	КонецЕсли;
	
	Возврат СтрВопрос;
	
КонецФункции	

Функция ПолучитьДанныеОтветовДругихИгроковКоманды(Игра, Вопрос, Команда, ВремяОтвета) Экспорт
	
	// ОПТИМИЗИРОВАННЫЙ ЗАПРОС МАХ быстрого считывания данных ответов игроков
	//
	
	МассивСтр = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветыИгроков.НомерСтр КАК НомерСтр,
	|	ОтветыИгроков.НомерИгрока КАК НомерИгрока,
	|	ОтветыИгроков.Ответ КАК Ответ
	|ИЗ
	|	РегистрСведений.ОтветыИгроков КАК ОтветыИгроков
	|ГДЕ
	|	ОтветыИгроков.Игра = &Игра
	|	И ОтветыИгроков.Вопрос = &Вопрос
	|	И ОтветыИгроков.Команда = &Команда
	|	И ОтветыИгроков.ВремяОтвета >= &ВремяОтвета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтр,
	|	НомерИгрока";
	
	Запрос.УстановитьПараметр("ВремяОтвета", ВремяОтвета);
	Запрос.УстановитьПараметр("Игра",        Игра);
	Запрос.УстановитьПараметр("Вопрос",      Вопрос);
	Запрос.УстановитьПараметр("Команда",     Команда);
	
	
	// Формирование двумерного массива для передачи только &НаКлиент
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда
		
		ТекущийНомерСтр = 0;
		МассивОтветов   = Новый Массив;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			Если Выборка.НомерСтр<>ТекущийНомерСтр И ТекущийНомерСтр>0 Тогда // Изменилась строка, поэтому можно записать предыдцщую строку								
				// Запись строки:
				МассивСтр.Вставить(ТекущийНомерСтр-1, МассивОтветов);			
				// Новые параметры ответов
				МассивОтветов = Новый Массив;								
			КонецЕсли;				
			// Обновление текущего номера стр.
			ТекущийНомерСтр = Выборка.НомерСтр;
			// Добавление ответа для игрока
			МассивОтветов.Вставить(Выборка.НомерИгрока-1, Выборка.Ответ); 	
		КонецЦикла;
		
		// Запись строки (завершающая):
		МассивСтр.Вставить(ТекущийНомерСтр-1, МассивОтветов);
		
	КонецЕсли;
	
	Возврат МассивСтр; 
	
КонецФункции	

Функция ОтправитьДанныеОтветаИгрока(Игра, Вопрос, Команда, НомерСтр, НомерИгрока, Игрок, Ответ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Игра) Тогда Возврат Неопределено; КонецЕсли; 
	
	// Отправка ответа игрока
	//
	ЗаписьОтветИгрока = РегистрыСведений.ОтветыИгроков.СоздатьМенеджерЗаписи();
	ЗаписьОтветИгрока.Игра = Игра;
	ЗаписьОтветИгрока.Вопрос = Вопрос;
	ЗаписьОтветИгрока.Команда = Команда;
	ЗаписьОтветИгрока.НомерСтр = НомерСтр;
	ЗаписьОтветИгрока.НомерИгрока = НомерИгрока;
	ЗаписьОтветИгрока.Игрок = Игрок;
	ЗаписьОтветИгрока.Ответ = Ответ;	
	ЗаписьОтветИгрока.ВремяОтвета = ТекущаяДатаСеанса();		
	ЗаписьОтветИгрока.Записать(Истина);
	
	// Отправление ответа команды
	//	
	Если НомерИгрока=1 Тогда // т.е. это Капитан		
		ЗаписьОтветКоманды = РегистрыСведений.ОтветыКоманд.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(ЗаписьОтветКоманды,ЗаписьОтветИгрока, "Игра,Вопрос,Команда,НомерСтр"); 
		//ЗаписьОтветКоманды.Прочитать();
		//Если НЕ (ЗаписьОтветКоманды.Выбран() И ЗаписьОтветКоманды.Ответ=Ответ) Тогда // - не обновляем, т.к. ответ совпал с ранее введенным
		//	ЗаполнитьЗначенияСвойств(ЗаписьОтветКоманды,ЗаписьОтветИгрока, "Игра,Вопрос,Команда,НомерСтр,ВремяОтвета,Ответ");
		//	ЗаписьОтветКоманды.Записать(Истина);
		//КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЗаписьОтветКоманды,ЗаписьОтветИгрока, "Игра,Вопрос,Команда,НомерСтр,ВремяОтвета,Ответ");
		ЗаписьОтветКоманды.Записать(Истина);
	КонецЕсли;
	
КонецФункции	



// ЗАПОЛНЕНИЕ НАСТРОЕК
Функция ПолучитьДанныеКомандыИгрока(Игра, Игрок) Экспорт
	
	// Для заполнения настроек колонок ТЧ
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИграСписокКоманд.НомерСтроки КАК НомерКоманды,
	|	ИграСписокКоманд.Команда КАК Команда
	|ПОМЕСТИТЬ ОТБОР_Команды
	|ИЗ
	|	Документ.Игра.СписокКоманд КАК ИграСписокКоманд
	|ГДЕ
	|	ИграСписокКоманд.Ссылка = &Игра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КомандыИгроки.Ссылка КАК Команда,
	|	КомандыИгроки.Игрок КАК Игрок,
	|	КомандыИгроки.НомерСтроки КАК НомерТекущегоИгрока
	|ПОМЕСТИТЬ ДанныеИгрока
	|ИЗ
	|	ОТБОР_Команды КАК Команды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
	|		ПО Команды.Команда = КомандыИгроки.Ссылка
	|ГДЕ
	|	КомандыИгроки.Игрок = &Игрок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Команды.НомерКоманды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомандыИгроки.Ссылка КАК Команда,
	|	КомандыИгроки.Игрок КАК Игрок,
	|	КомандыИгроки.Игрок.Наименование КАК ИгрокНаименование,
	|	КомандыИгроки.НомерСтроки КАК НомерИгрока,
	|	ДанныеИгрока.НомерТекущегоИгрока КАК НомерТекущегоИгрока
	|ИЗ
	|	ДанныеИгрока КАК ДанныеИгрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
	|		ПО (КомандыИгроки.Ссылка = ДанныеИгрока.Команда)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КомандыИгроки.НомерСтроки";
	Запрос.УстановитьПараметр("Игра",  Игра);
	Запрос.УстановитьПараметр("Игрок", Игрок);
	
	ТЗ_ИгрокиКоманды = Запрос.Выполнить().Выгрузить();	
	Возврат ТЗ_ИгрокиКоманды;
	
КонецФункции	

Функция ПолучитьДанныеВопросовИзМаршрутаТекущейИгры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.Игра = &Игра
	|	И МаршрутПроведенияИгры.Вопрос <> ЗНАЧЕНИЕ(Справочник.Вопросы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаршрутПроведенияИгры.Вопрос";	
	Запрос.УстановитьПараметр("Игра", Константы.ТекущаяИгра.Получить());	
	
	
	// Описание строки для поиска вопросов
	МассивИндексВопросов = Новый Массив;
	МассивИндексВопросов.Добавить(Неопределено); // Первый элемент не заполняем
	МассивИндексВопросов.Добавить(Справочники.Вопросы.ПустаяСсылка()); // пустой элемент - пригодится
	
	// Заполнение индекса структуры для поиска в ней структур вопросов:
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл				
		МассивИндексВопросов.Добавить(Выборка.Вопрос);	
	КонецЦикла;
	
	// Массив всех данных
	МассивДанных = Новый Массив;
	МассивДанных.Добавить(МассивИндексВопросов);
	
	// Заполнение данных вопросов
	Для Каждого ЭлИндексВопрос Из МассивИндексВопросов Цикл
		Если ЭлИндексВопрос<>Неопределено Тогда
			нСтр = ПолучитьСтруктуруВопроса(ЭлИндексВопрос);		
			МассивДанных.Добавить(нСтр);
		КонецЕсли;	
	КонецЦикла;			
	
	Возврат Новый Структура("МассивДанных",МассивДанных);	
	
КонецФункции	



// ДАННЫЕ ВОПРОСА
Функция ПолучитьСтруктуруВопроса(Вопрос) Экспорт
	
	// Структура данных вопроса:                                                                                                                                                              
	СтрВопрос = Новый Структура("Вопрос,Наименование,ВидВопроса,ВопросЗаголовок,ИспользоватьПредставление,ИспользуетсяДемонстрацияОтвета,КоличествоОтветов,ТЧОтветыИгроков,ВариантыОтветовНаТест,ВидДанныхОтображения,ДанныеHTML,ДанныеHTMLДемонстрацияОтвета,ВидДанныхОтображенияДемонстрацияОтвета",
	Справочники.Вопросы.ПустаяСсылка(),
	"<нет вопроса>",
	Перечисления.ВидВопроса.ПустаяСсылка(),
	"Нет вопроса",
	Ложь,
	Ложь,
	0,
	Новый Массив,
	Новый СписокЗначений);
	
	// Если пустой вопрос
	Если НЕ ЗначениеЗаполнено(Вопрос) Тогда
		Возврат СтрВопрос;
	КонецЕсли;	
	
	// Заполнение структуры:
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Вопросы.Ссылка КАК Вопрос,
	|	Вопросы.Наименование КАК Наименование,
	|	Вопросы.ВидВопроса КАК ВидВопроса,
	|	Вопросы.Заголовок КАК ВопросЗаголовок,
	|	Вопросы.ИспользоватьПредставление КАК ИспользоватьПредставление,
	|	Вопросы.КоличествоОтветов КАК КоличествоОтветов,
	|	Вопросы.ИспользуетсяДемонстрацияОтвета КАК ИспользуетсяДемонстрацияОтвета,
	|	Вопросы.ВидДанныхОтображения КАК ВидДанныхОтображения,
	|	Вопросы.ДанныеHTML КАК ДанныеHTML,
	|	Вопросы.ВидДанныхОтображенияДемонстрацияОтвета КАК ВидДанныхОтображенияДемонстрацияОтвета,
	|	Вопросы.ДанныеHTMLДемонстрацияОтвета КАК ДанныеHTMLДемонстрацияОтвета
	|ИЗ
	|	Справочник.Вопросы КАК Вопросы
	|ГДЕ
	|	Вопросы.Ссылка = &Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВопросыОтветыНаВопрос.НомерСтроки КАК НомерСтроки,
	|	ВопросыОтветыНаВопрос.Представление КАК Представление,
	|	ВопросыОтветыНаВопрос.Ответ КАК ПравильныйОтвет,
	|	ВопросыОтветыНаВопрос.ОтветНаТест КАК ОтветНаТест
	|ИЗ
	|	Справочник.Вопросы.ОтветыНаВопрос КАК ВопросыОтветыНаВопрос
	|ГДЕ
	|	ВопросыОтветыНаВопрос.Ссылка = &Вопрос";	
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	// Данные вопроса:
	ВыборкаВопрос = ПакетЗапросов[0].Выбрать();
	ВыборкаВопрос.Следующий();
	ЗаполнитьЗначенияСвойств(СтрВопрос, ВыборкаВопрос);	                                                                               
	
	// Данные ТЧ:
	ВыборкаТЧ = ПакетЗапросов[1].Выбрать();	
	Массив_ОтветыИгроков         = Новый Массив;
	Список_ВариантыОтветовНаТест = Новый СписокЗначений;
	Если СтрВопрос.ВидВопроса = Перечисления.ВидВопроса.ВопросСОтветом Тогда	
		
		// Заполнение ТЧ.ОтветыИгроков
		Пока ВыборкаТЧ.Следующий() Цикл			
			СтрТЧ = Новый Структура("Представление,ПравильныйОтвет");
			ЗаполнитьЗначенияСвойств(СтрТЧ, ВыборкаТЧ);
			Массив_ОтветыИгроков.Добавить(СтрТЧ);		
		КонецЦикла;
		
	ИначеЕсли СтрВопрос.ВидВопроса = Перечисления.ВидВопроса.Тест Тогда
		
		// Заполнение списка для выбора ответа на Тест:
		ЗначениеПравильногоОтвета = "";
		Пока ВыборкаТЧ.Следующий() Цикл
			ПредставлениеОтвета = ?(СтрВопрос.ИспользоватьПредставление, ВыборкаТЧ.Представление, Строка(ВыборкаТЧ.НомерСтроки));
			Список_ВариантыОтветовНаТест.Добавить(ПредставлениеОтвета, ПредставлениеОтвета);
			Если ВыборкаТЧ.ОтветНаТест Тогда ЗначениеПравильногоОтвета = ПредставлениеОтвета; КонецЕсли;
		КонецЦикла;
		СтрВопрос.ИспользоватьПредставление = Ложь; // ВАЖНЫЙ МОМЕНТ ИСПОЛЬЗОВАНИЯ ЭТОГО РЕКВИЗИТА ПРИ ОТОБРАЖЕНИИ НА ЭЛЕМЕНТАХ ФОРМ ДЛЯ ТЕСТА!
		
		// Заполнение ТЧ.ОтветыИгроков
		СтрТЧ = Новый Структура("Представление,ПравильныйОтвет", "", ЗначениеПравильногоОтвета);
		Массив_ОтветыИгроков.Добавить(СтрТЧ);
		
	Иначе
		СтрВопрос.ИспользоватьПредставление = Ложь;
		
	КонецЕсли;	
	
	СтрВопрос.ТЧОтветыИгроков       = Массив_ОтветыИгроков; 
	СтрВопрос.ВариантыОтветовНаТест = Список_ВариантыОтветовНаТест;
	
	Возврат СтрВопрос;
	
КонецФункции	



// ЭМОЦИОНАЛЬНЫЕ ОЦЕНКИ ВОПРОСА
Функция ЭмоциональнаяОценкаВопроса(Игра, Вопрос, Оценка=0) Экспорт
	
	// Создание записи в регистре и получение предудущего значения оценки
	//
	
	Запись = РегистрыСведений.ЭмоциональныеОценкиВопросов.СоздатьМенеджерЗаписи();
	Запись.Игра         = Игра;
	Запись.Вопрос       = Вопрос;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		БылаОценка = Запись.Оценка;
	Иначе
		БылаОценка = 0;		
		Запись.Игра         = Игра;
		Запись.Вопрос       = Вопрос;
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	Запись.Оценка       = Оценка;
	Запись.ВремяОценки  = ТекущаяДатаСеанса();
	Запись.Записать();
	
	Возврат БылаОценка;
	
КонецФункции	

Функция ЭмоциональнаяОценкаВопросаОбщийРейтинг(Игра, Вопрос, Оценка=0) Экспорт
	
	// Создание записи в регистре и получение предудущего значения оценки
	//
	
	Запись = РегистрыСведений.ЭмоциональныеОценкиВопросов.СоздатьМенеджерЗаписи();
	Запись.Игра         = Игра;
	Запись.Вопрос       = Вопрос;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	Запись.Оценка       = Оценка;
	Запись.ВремяОценки  = ТекущаяДатаСеанса();
	Запись.Записать();
	
	СтрВозврат = Новый Структура("КоличествоЛайков,КоличествоДизлайков",0,0);
	
	// Определяем общий рейтинг вопроса:	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ЭмоциональныеОценкиВопросов.Оценка > 0
	|				ТОГДА ЭмоциональныеОценкиВопросов.Оценка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЛайков,
	|	СУММА(ВЫБОР
	|			КОГДА ЭмоциональныеОценкиВопросов.Оценка < 0
	|				ТОГДА -ЭмоциональныеОценкиВопросов.Оценка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДизлайков
	|ИЗ
	|	РегистрСведений.ЭмоциональныеОценкиВопросов КАК ЭмоциональныеОценкиВопросов
	|ГДЕ
	|	ЭмоциональныеОценкиВопросов.Вопрос = &Вопрос";
	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда		
		Выборка = Результат.Выбрать();	
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтрВозврат, Выборка);		
	КонецЕсли;	
	
	Возврат СтрВозврат;
	
КонецФункции


// СТРОКА СОСТОЯНИЯ ОТВЕТОВ КОМАНД
Функция ОбновитьИнформациюСтрокиСостоянияТекущегоВопроса(Игра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.СтрокаСостояния КАК СтрокаСостояния,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования
	|ПОМЕСТИТЬ ТекущийВопрос
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.Игра = &Игра
	|	И МаршрутПроведенияИгры.АктивныйВопрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутПроведенияИгры.НомерСледования УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийВопрос.Игра КАК Игра,
	|	ТекущийВопрос.АктивныйВопрос КАК АктивныйВопрос,
	|	ТекущийВопрос.НомерСледования КАК НомерСледования,
	|	ТекущийВопрос.Вопрос КАК Вопрос,
	|	ТекущийВопрос.СтрокаСостояния КАК СтрокаСостояния,
	|	ТекущийВопрос.Вопрос.КоличествоОтветов КАК КоличествоОтветовВсего
	|ПОМЕСТИТЬ ДанныеТекущегоВопроса
	|ИЗ
	|	ТекущийВопрос КАК ТекущийВопрос
	|ГДЕ
	|	ТекущийВопрос.Вопрос.КоличествоОтветов > 0
	|	И ТекущийВопрос.Вопрос.ВидВопроса В (ЗНАЧЕНИЕ(Перечисление.ВидВопроса.Тест), ЗНАЧЕНИЕ(Перечисление.ВидВопроса.ВопросСОтветом))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТекущегоВопроса.Игра КАК Игра,
	|	ДанныеТекущегоВопроса.АктивныйВопрос КАК АктивныйВопрос,
	|	ДанныеТекущегоВопроса.НомерСледования КАК НомерСледования,
	|	ДанныеТекущегоВопроса.Вопрос КАК Вопрос,
	|	ДанныеТекущегоВопроса.СтрокаСостояния КАК СтрокаСостояния,
	|	МИНИМУМ(ДанныеТекущегоВопроса.КоличествоОтветовВсего) КАК КоличествоОтветовВсего,
	|	ОтветыКоманд.Команда КАК Команда,
	|	ОтветыКоманд.Команда.Наименование КАК КомандаНаименование,
	|	СУММА(ВЫБОР
	|			КОГДА ОтветыКоманд.Ответ <> """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОтветовКоманды,
	|	МИНИМУМ(ОтветыКоманд.ВремяОтвета) КАК ВремяПервогоОтвета
	|ИЗ
	|	ДанныеТекущегоВопроса КАК ДанныеТекущегоВопроса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыКоманд КАК ОтветыКоманд
	|		ПО ДанныеТекущегоВопроса.Игра = ОтветыКоманд.Игра
	|			И ДанныеТекущегоВопроса.Вопрос = ОтветыКоманд.Вопрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеТекущегоВопроса.Игра,
	|	ДанныеТекущегоВопроса.Вопрос,
	|	ДанныеТекущегоВопроса.СтрокаСостояния,
	|	ОтветыКоманд.Команда,
	|	ОтветыКоманд.Команда.Наименование,
	|	ДанныеТекущегоВопроса.АктивныйВопрос,
	|	ДанныеТекущегоВопроса.НомерСледования
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОтветовКоманды УБЫВ,
	|	ВремяПервогоОтвета";
	Запрос.УстановитьПараметр("Игра", Игра);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Информация = "";
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			КолиОтвВсего = Выборка.КоличествоОтветовВсего;		
			Если Выборка.КоличествоОтветовВсего>1 Тогда		
				Информация = Информация+"«"+СокрЛП(Выборка.КомандаНаименование)+"»=["+Строка(Выборка.КоличествоОтветовКоманды)+"]   ";		
			Иначе
				Информация = Информация+"«"+СокрЛП(Выборка.КомандаНаименование)+"»   ";			
			КонецЕсли;			
		КонецЦикла;
		
		//СтрокаСостояния = ?(КолиОтвВсего>1,"[max="+Строка(КолиОтвВсего)+"]   ","")+"Ответы:  " + Информация;
		//СтрокаСостояния = "Ответы: " + Информация;
		СтрокаСостояния = "уже даны:  " + Информация;
		
		Если СтрокаСостояния<>Выборка.СтрокаСостояния Тогда // т.е. изменилась, поэтому одновляем		
			// Обновление строки состояния маршрута
			ЗаписьМаршрут = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьМаршрут, Выборка, "Игра,АктивныйВопрос,НомерСледования");
			ЗаписьМаршрут.Прочитать();
			Если ЗаписьМаршрут.Выбран() Тогда
				ЗаписьМаршрут.СтрокаСостояния = СтрокаСостояния;
				ЗаписьМаршрут.Записать(Истина);	
			КонецЕсли;				
		КонецЕсли;	
		
	Иначе
		СтрокаСостояния = "";
		
	КонецЕсли;
	
	Возврат СтрокаСостояния;
	
КонецФункции	



// ИНФОРМАЦИЯ СТАРТОВОЙ СТРАНИЦЫ
Процедура ЗаполнитьСтрутуруИнформации(Структура, Заголовок, Информация)
	
	Структура.Заголовок  = Структура.Заголовок + СокрЛП(Заголовок) + Символы.ПС;
	Структура.Информация = Структура.Информация + СокрЛП(Информация) + Символы.ПС;
	
КонецПроцедуры	

Функция ПолучитьДанныеТекущейИгры() Экспорт
	
	Структура = Новый Структура("Заголовок,Информация,Игра,Команда","","",Неопределено,Неопределено);
	
	// Игра
	Игра = Константы.ТекущаяИгра.Получить();
	Если ЗначениеЗаполнено(Игра) Тогда		
		Структура.Игра = Игра;		
		ЗаполнитьСтрутуруИнформации(Структура, "Игра:", СокрЛП(Игра.ОписаниеИгры) + ?(НЕ ЗначениеЗаполнено(Игра.ОписаниеИгры),"№"+Строка(Игра.Номер),""));					
	Иначе
		ЗаполнитьСтрутуруИнформации(Структура, "", "Нет игры!");		
	КонецЕсли;
	
	// Администратор игры
	АдминистраторИгры = Константы.АдминистраторИгры.Получить();
	Если ЗначениеЗаполнено(АдминистраторИгры) Тогда
		ЗаполнитьСтрутуруИнформации(Структура, "Администратор игры:", АдминистраторИгры);
	Иначе
		ЗаполнитьСтрутуруИнформации(Структура, "", "Нет администратора игры!");
	КонецЕсли;
	
	// Команды
	Если ЗначениеЗаполнено(Игра) Тогда	
		СписокКоманд = "";
		Для Каждого Эл Из Игра.СписокКоманд Цикл
			СписокКоманд = СписокКоманд + СокрЛП(Эл.Команда) + ";  ";
		КонецЦикла;	
		ЗаполнитьСтрутуруИнформации(Структура, "Участвующие команды:", СокрЛП(СписокКоманд));
	КонецЕсли;
	
	
	Игрок = ПараметрыСеанса.ТекущийПользователь;	
	Если ЗначениеЗаполнено(Игра) И ЗначениеЗаполнено(Игрок) Тогда
		ТЗ_ДанныеИгроков = ПолучитьДанныеКомандыИгрока(Игра, Игрок);	
		Если ТЗ_ДанныеИгроков.Количество()>0 Тогда 		
			
			НомерИгрока = ТЗ_ДанныеИгроков.Получить(0).НомерТекущегоИгрока;	
			Команда = ТЗ_ДанныеИгроков.Получить(0).Команда;
			Капитан = ТЗ_ДанныеИгроков.Получить(0).Игрок;
			
			Структура.Команда = Команда; 
			
			ЗаполнитьСтрутуруИнформации(Структура, "Ваша команда:", Команда);
			ЗаполнитьСтрутуруИнформации(Структура, "Капитан:", Капитан);
			
			СтрИгроки = "";
			КоличествоИгроковКоманды = 0;
			Для Каждого Эл Из ТЗ_ДанныеИгроков Цикл
				СтрИгроки = СтрИгроки + СокрЛП(Эл.Игрок)+";  ";
				КоличествоИгроковКоманды = КоличествоИгроковКоманды + 1;
			КонецЦикла;
			ЗаполнитьСтрутуруИнформации(Структура, "Игроки:", СокрЛП(СтрИгроки));
			
		Иначе
			ЗаполнитьСтрутуруИнформации(Структура, "", "Вас нет в команде!");
		КонецЕсли;			
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции



// БЛОКИРОВКИ РАБОТЫ ПОЛЬЗОВАТЕЛЕЙ
Функция ПолучитьЗначениеБлокировкиТекущегоПользователя() Экспорт
	
	// Описание структуры
	СтрБлокировка = Новый Структура("ВремяЗавершенияБлокировки,РазрешенВходВСистему,РазрещенаРабота", '00010101', Истина, Истина);
	
	ВремяЗавершенияБлокировки = Константы.ВремяБлокировкиРаботыПользователей.Получить();	
	Если ЗначениеЗаполнено(ВремяЗавершенияБлокировки) Тогда
		
		Если ВремяЗавершенияБлокировки>ТекущаяДатаСеанса() Тогда // Есть Блокировка
			
			// Провка исключений
			
			// ВремяЗавершенияБлокировки
			СтрБлокировка.ВремяЗавершенияБлокировки = ВремяЗавершенияБлокировки;
			
			// РазрешениеРаботыПользователямПриБлокировке	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Исключения.Пользователь КАК Пользователь,
			|	Исключения.ТолькоВходВСистему КАК ТолькоВходВСистему
			|ИЗ
			|	РегистрСведений.РазрешениеРаботыПользователямПриБлокировке КАК Исключения
			|ГДЕ
			|	Исключения.Пользователь = &Пользователь";	
			Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();	
				Выборка.Следующий();
				СтрБлокировка.РазрешенВходВСистему = Истина;
				СтрБлокировка.РазрещенаРабота      = НЕ Выборка.ТолькоВходВСистему;
				
			Иначе // нет данных в регистре	
				
				СтрБлокировка.РазрешенВходВСистему = Константы.РазрешитьВходВСистемуПриБлокировке.Получить();
				СтрБлокировка.РазрещенаРабота      = Ложь;				
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрБлокировка;
	
КонецФункции	


// ЧАТ - СООБЩЕНИЯ
Функция ОтправитьСообщениеНаСервере(ТекстСообшения) Экспорт
	
	// Отправка сообщения
	Запись = РегистрыСведений.Чат.СоздатьМенеджерЗаписи();
	Запись.Игра           = Константы.ТекущаяИгра.Получить();
	Запись.ДатаСообщения  = ТекущаяДатаСеанса();
	Запись.Отправитель    = ПараметрыСеанса.ТекущийПользователь;
	Запись.ТекстСообщения = СокрЛП(ТекстСообшения);	
	Запись.Записать(Истина);
	
	СтрКлючЗаписи = Новый Структура("Игра,Отправитель,ДатаСообщения", Запись.Игра, Запись.Отправитель, Запись.ДатаСообщения);	
	КлючЗаписи    = РегистрыСведений.Чат.СоздатьКлючЗаписи(СтрКлючЗаписи);
	
	Возврат КлючЗаписи;		
	
КонецФункции


// HTML-ПЕРЕАДРЕСАЦИЯ
Функция ПолучитьПутьURLКорректировочный(URLПутьОригинальный) Экспорт
	
	Если ЗначениеЗаполнено(URLПутьОригинальный) Тогда
		
		Если СтрНайти(URLПутьОригинальный,"www.youtube.com")> 0 Тогда // Преобразователь для сайта Youtube.com
			
			ПозицияСтрПоиска = СтрНайти(URLПутьОригинальный,"?v=");
			Путь = СокрЛП(Сред(URLПутьОригинальный, ПозицияСтрПоиска + 3));
			
			Возврат "<html>
			|<head>
			|</head>	
			|<body>
			|<iframe type='text/html' width='100%' height='100%' frameborder='0' allowfullscreen src=""https://www.youtube-nocookie.com/embed/"+Путь+"?controls=0"" frameborder=""0"" allow=""accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"" allowfullscreen></iframe>
			|</body>	
			|</html>";	
			
		Иначе // Все остальные ссылки не преобразовываются
			
			Возврат СокрЛП(URLПутьОригинальный);
			
		КонецЕсли;	
		
	Иначе
		Возврат "";
		
	КонецЕсли;	
	
КонецФункции



// ДАННЫЕ ОТОБРАЖЕНИЯ ВОПРОСА
Процедура УстановитьДанныеОтображенияВопроса(Форма, Объект, ЭтоДемонстрацияОтвета=false) Экспорт
	
	ДемонстрацияОтвета = ?(ЭтоДемонстрацияОтвета, "ДемонстрацияОтвета", ""); 
	
	Если Объект["ВидДанныхОтображения"+ДемонстрацияОтвета] = Перечисления.ВидДанныхОтображения.HTML Тогда		
		УстановитьДанные_HTML(Форма, Объект, ЭтоДемонстрацияОтвета);
	Иначе
		УстановитьДанные_ФорматированныйДокумент(Форма, Объект, ЭтоДемонстрацияОтвета);
	КонецЕсли;	
	
КонецПроцедуры                    

Процедура УстановитьДанные_ФорматированныйДокумент(Форма, Объект, ЭтоДемонстрацияОтвета=False) Экспорт
	
	ДемонстрацияОтвета = ?(ЭтоДемонстрацияОтвета, "ДемонстрацияОтвета", ""); 
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Вопросы") ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.Вопросы") Тогда // только для объекта или ссылки получаем значение ФорматируемогоДокумента
		Форма["ФорматированныйДокумент"+ДемонстрацияОтвета] = Объект["ДанныеФорматированныйДокумент"+ДемонстрацияОтвета].Получить();	
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьДанные_HTML(Форма, Объект, ЭтоДемонстрацияОтвета=False) Экспорт
	
	ДемонстрацияОтвета = ?(ЭтоДемонстрацияОтвета, "ДемонстрацияОтвета", ""); 
	
	Форма["HTML"+ДемонстрацияОтвета] = ПолучитьПутьURLКорректировочный(Объект["ДанныеHTML"+ДемонстрацияОтвета]);		
	
КонецПроцедуры


