




// Процедуры и функции обновлений
&НаСервереБезКонтекста
Функция ПолучитьДанныеТекущегоВопросаИОтветовИгроков(Игра, Вопрос, НеСчитыватьОтветыИгроков, Команда, ВремяПоследнегоОбновления)
	
	// ОПТИМИЗАЦИЯ
	//
	
	// Текущий вопрос:
	СтрВопрос = ИгровойСерверПривилегированный.ПолучитьДанныеТекущегоВопроса(Игра);
	
	// Считывание данных ответов ироков:
	Если СтрВопрос.Вопрос<>Вопрос Тогда 		
		ВремяСчитыванияДанных = '00010101'; // загрузка вопроса, поэтому ответы за весь период
		МассивДанныхИгроков = ИгровойСерверПривилегированный.ПолучитьДанныеОтветовДругихИгроковКоманды(Игра, СтрВопрос.Вопрос, Команда, ВремяСчитыванияДанных); // Запрос данных игроков по текущему вопросу	
	Иначе			
		Если НеСчитыватьОтветыИгроков Тогда
			МассивДанныхИгроков = Новый Массив;
		Иначе
			ВремяСчитыванияДанных = ВремяПоследнегоОбновления - 3; // 3 секунды отнимаем на всякий случай, погрешность синхронизации данных
			МассивДанныхИгроков = ИгровойСерверПривилегированный.ПолучитьДанныеОтветовДругихИгроковКоманды(Игра, СтрВопрос.Вопрос, Команда, ВремяСчитыванияДанных); // Запрос данных игроков по текущему вопросу
		КонецЕсли;	
	КонецЕсли;
	СтрВопрос.Вставить("МассивДанныхИгроков", МассивДанныхИгроков);
	
	
	// Время последнего обновления
	ВремяПоследнегоОбновления = ТекущаяДатаСеанса();
	
	// Переменная позволяет играть с разными часовыми поясами в одно и тоже время on-line 
	СтрВопрос.Вставить("ТекущаяДатаСеансаНаСервере", ТекущаяДатаСеанса());
	
	Возврат СтрВопрос;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьДанные_ОтветыИгроковНаКлиенте(МассивДанныхИгроков, ДанныеВсехИгроков)
	
	КоличествоСтр = МассивДанныхИгроков.Количество();	
	Если КоличествоСтр>0 Тогда // Проверка наличия данных
		
		// Перебираем цикл строк ТЧ  
		Для Каждого СтрТЧ Из Объект.ОтветыИгроков Цикл
			
			Если СтрТЧ.НомерСтроки>КоличествоСтр Тогда Прервать; КонецЕсли; // - далее нет данных
			
			ДанныеПо1Строке = МассивДанныхИгроков.Получить(СтрТЧ.НомерСтроки-1); // - получение массива данных по каждому игроку
			Если ДанныеПо1Строке<>Неопределено Тогда // - проверка наличия данных в этой строке  
				
				// Перебираем данные одной строки и обновляем их на форме ТЧ
				НомерИгрока = 0;
				Для Каждого ЭлИгрок Из ДанныеПо1Строке Цикл	
					НомерИгрока = НомерИгрока + 1;
					Если ЭлИгрок<>Неопределено Тогда					
						// Обновляем если параметр ОбновитьВсеДанные=Истина ИЛИ не колонка самого игрока
						Если ДанныеВсехИгроков ИЛИ НомерИгрока<>Объект.НомерИгрока Тогда
							СтрТЧ["Ответ"+Строка(НомерИгрока)] = ЭлИгрок;
						КонецЕсли;					
					КонецЕсли;					
				КонецЦикла;		
				
			КонецЕсли;		
			
		КонецЦикла;	
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные_ОтветыИгроковНаСервере(МассивДанныхИгроков, ДанныеВсехИгроков)
	
	КоличествоСтр = МассивДанныхИгроков.Количество();	
	Если КоличествоСтр>0 Тогда // Проверка наличия данных
		
		// Перебираем цикл строк ТЧ  
		Для Каждого СтрТЧ Из Объект.ОтветыИгроков Цикл
			
			Если СтрТЧ.НомерСтроки>КоличествоСтр Тогда Прервать; КонецЕсли; // - далее нет данных
			
			ДанныеПо1Строке = МассивДанныхИгроков.Получить(СтрТЧ.НомерСтроки-1); // - получение массива данных по каждому игроку
			Если ДанныеПо1Строке<>Неопределено Тогда // - проверка наличия данных в этой строке  
				
				// Перебираем данные одной строки и обновляем их на форме ТЧ
				НомерИгрока = 0;
				Для Каждого ЭлИгрок Из ДанныеПо1Строке Цикл	
					НомерИгрока = НомерИгрока + 1;
					Если ЭлИгрок<>Неопределено Тогда					
						// Обновляем если параметр ОбновитьВсеДанные=Истина ИЛИ не колонка самого игрока
						Если ДанныеВсехИгроков ИЛИ НомерИгрока<>Объект.НомерИгрока Тогда
							СтрТЧ["Ответ"+Строка(НомерИгрока)] = ЭлИгрок;
						КонецЕсли;					
					КонецЕсли;					
				КонецЦикла;		
				
			КонецЕсли;		
			
		КонецЦикла;	
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные_Вопрос(ИзменениеВопроса, МассивДанныхИгроков)
	
	// ОПТИМИЗАЦИЯ
	//
	// Обновление данных вопроса
	//
	Если ИзменениеВопроса Тогда
		
		// Получение вопроса:
		НомерВопросаВОперативномХранилище = Объект.ДанныеВопросовТекущейИгры.МассивДанных[0].Найти(Объект.Вопрос);
		Если НомерВопросаВОперативномХранилище<>Неопределено Тогда
			СтрВопрос = Объект.ДанныеВопросовТекущейИгры.МассивДанных[НомерВопросаВОперативномХранилище];
		Иначе // Если новый и его не было в маршруте на момент открытия формы
			СтрВопрос = ИгровойСерверПривилегированный.ПолучитьСтруктуруВопроса(Объект.Вопрос);
		КонецЕсли;
		
		// Обновление реквизитов вопроса:
		ЗаполнитьЗначенияСвойств(Объект, СтрВопрос);
		
		// Структура ответов игроков:
		Объект.ОтветыИгроков.Очистить();
		Для Каждого ЭлОтвет Из СтрВопрос.ТЧОтветыИгроков Цикл
			ЗаполнитьЗначенияСвойств(Объект.ОтветыИгроков.Добавить(), ЭлОтвет);
		КонецЦикла;
		
		// Изображение вопроса. К сожалению только на &Cервере  :(
		Если Объект.ДемонстрацияОтвета И Объект.ИспользуетсяДемонстрацияОтвета Тогда
			Если Объект.ВидДанныхОтображенияДемонстрацияОтвета = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
				HTML = ИгровойСерверПривилегированный.ПолучитьПутьURLКорректировочный(Объект.ДанныеHTMLДемонстрацияОтвета); 
			Иначе	
				Объект.ДанныеФорматированныйДокумент = Объект.Вопрос.ДанныеФорматированныйДокументДемонстрацияОтвета.Получить();
			КонецЕсли;
		Иначе
			Если Объект.ВидДанныхОтображения = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
				HTML = ИгровойСерверПривилегированный.ПолучитьПутьURLКорректировочный(Объект.ДанныеHTML); 
			Иначе
				Объект.ДанныеФорматированныйДокумент = Объект.Вопрос.ДанныеФорматированныйДокумент.Получить();
			КонецЕсли;
		КонецЕсли;	
		
	Иначе                    
		
		// Изменился только параметр "ДемонстрацияОтвета"
		Если Объект.ИспользуетсяДемонстрацияОтвета Тогда		
			Если Объект.ДемонстрацияОтвета Тогда
				Если Объект.ВидДанныхОтображенияДемонстрацияОтвета = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
					HTML = ИгровойСерверПривилегированный.ПолучитьПутьURLКорректировочный(Объект.ДанныеHTMLДемонстрацияОтвета); 
				Иначе
					Объект.ДанныеФорматированныйДокумент = Объект.Вопрос.ДанныеФорматированныйДокументДемонстрацияОтвета.Получить();
				КонецЕсли;	
			Иначе
				Если Объект.ВидДанныхОтображения = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
					HTML = ИгровойСерверПривилегированный.ПолучитьПутьURLКорректировочный(Объект.ДанныеHTML); 
				Иначе
					Объект.ДанныеФорматированныйДокумент = Объект.Вопрос.ДанныеФорматированныйДокумент.Получить();
				КонецЕсли;	
			КонецЕсли;
		Иначе
			// Ничего не делаем. т.к. всего одно изображение и оно не меняется
		КонецЕсли;	
		
	КонецЕсли;
	
	
	// Флаг позволяет не делать лишний запрос на считвание данных ответов других игроков
	Объект.НеСчитыватьОтветыИгроков = Объект.ДемонстрацияОтвета ИЛИ Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Заставка");
	//
	
	// Обновление данныех по вводу ответов от других игроков
	ОбновитьДанные_ОтветыИгроковНаСервере(МассивДанныхИгроков, ИзменениеВопроса);	
	
	// Обновление видимости и доступности элементов управления в завичимости от данных:
	ОбновитьЭлементы_ВидимостьДоступностьПолейРедактированияНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьЭлементы_ВидимостьДоступностьПолейРедактированияНаКлиенте()
	
	// Обновление видимости и доступности элементов управления в завичимости от данных:
	//
	
	//Идёт Пауза
	ЭтоПауза = (ТекущаяДата() + Объект.СинхронизацияСВременемСервера <= Объект.ВремяОкончанияПаузы);	
	
	Если Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Тест") ИЛИ Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.ВопросСОтветом") Тогда				
		
		Элементы.Группа_Данные.Видимость                 = Объект.ДемонстрацияОтвета ИЛИ Не ЭтоПауза;
		Элементы.ОтветыИгроков.Видимость                 = Объект.ДемонстрацияОтвета ИЛИ Не ЭтоПауза;
		Элементы.ОтветыИгроков.ТолькоПросмотр            = Объект.ДемонстрацияОтвета;
		//Элементы.ОтветыИгроковПравильныйОтвет.Видимость  = Объект.ДемонстрацияОтвета И НЕ Объект.ИспользуетсяДемонстрацияОтвета;	
		Элементы.ОтветыИгроковПравильныйОтвет.Видимость  = Объект.ДемонстрацияОтвета;
		
		// Подстройка под высоту экрана игрока:
		КоличествоЭлементовТЧ = Объект.ОтветыИгроков.Количество();
		Если РасчетнаяВысотаТЧОтветыИгроков>0 Тогда
			КоличествоЭлементовТЧ=МИН(КоличествоЭлементовТЧ,РасчетнаяВысотаТЧОтветыИгроков); 
		КонецЕсли;		
		Элементы.ОтветыИгроков.Высота = КоличествоЭлементовТЧ + 2; // Высота таблицы ответов		
		Элементы.ОтветыИгроковНомерСтроки.Видимость = ?(КоличествоЭлементовТЧ=1, Ложь, Истина);
		Элементы.ОтветыИгроковПредставление.Видимость = Объект.ИспользоватьПредставление;
		
	Иначе // Заголовок	
		
		Элементы.Группа_Данные.Видимость = Истина;
		Элементы.ОтветыИгроков.Видимость = Ложь;
		
	КонецЕсли;		
	
	// Видимость: ФорматируемыйДокумент / HTML
	ДемонстрацияОтвета = ?((Объект.ДемонстрацияОтвета И Объект.ИспользуетсяДемонстрацияОтвета), "ДемонстрацияОтвета", "");
	Если Объект["ВидДанныхОтображения"+ДемонстрацияОтвета] = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
		Элементы.HTML.Видимость = Истина;
		Элементы.ФорматированныйДокумент.Видимость = Ложь;
	Иначе
		Элементы.HTML.Видимость = Ложь;
		Элементы.ФорматированныйДокумент.Видимость = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементы_ВидимостьДоступностьПолейРедактированияНаСервере()
	
	// Обновление видимости и доступности элементов управления в завичимости от данных:
	//
	
	//Идёт Пауза
	ЭтоПауза = (ТекущаяДата() + Объект.СинхронизацияСВременемСервера <= Объект.ВремяОкончанияПаузы);	
	
	Если Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Тест") ИЛИ Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.ВопросСОтветом") Тогда				
		
		Элементы.Группа_Данные.Видимость                 = Объект.ДемонстрацияОтвета ИЛИ Не ЭтоПауза;
		Элементы.ОтветыИгроков.Видимость                 = Объект.ДемонстрацияОтвета ИЛИ Не ЭтоПауза;
		Элементы.ОтветыИгроков.ТолькоПросмотр            = Объект.ДемонстрацияОтвета;
		//Элементы.ОтветыИгроковПравильныйОтвет.Видимость  = Объект.ДемонстрацияОтвета И НЕ Объект.ИспользуетсяДемонстрацияОтвета;	
		Элементы.ОтветыИгроковПравильныйОтвет.Видимость  = Объект.ДемонстрацияОтвета;
		
		КоличествоЭлементовТЧ = Объект.ОтветыИгроков.Количество();
		// Подстройка под высоту экрана игрока:
		КоличествоЭлементовТЧ = Объект.ОтветыИгроков.Количество();
		Если РасчетнаяВысотаТЧОтветыИгроков>0 Тогда
			КоличествоЭлементовТЧ=МИН(КоличествоЭлементовТЧ,РасчетнаяВысотаТЧОтветыИгроков); 
		КонецЕсли;
		Элементы.ОтветыИгроков.Высота = КоличествоЭлементовТЧ + 2; // Высота таблицы ответов		
		Элементы.ОтветыИгроковНомерСтроки.Видимость = ?(КоличествоЭлементовТЧ=1, Ложь, Истина);
		Элементы.ОтветыИгроковПредставление.Видимость = Объект.ИспользоватьПредставление;
		
	Иначе // Заголовок	
		               
		Элементы.Группа_Данные.Видимость = Истина;
		Элементы.ОтветыИгроков.Видимость = Ложь;
		
	КонецЕсли;
	                  
	// Видимость: ФорматируемыйДокумент / HTML
	ДемонстрацияОтвета = ?((Объект.ДемонстрацияОтвета И Объект.ИспользуетсяДемонстрацияОтвета), "ДемонстрацияОтвета", "");
	Если Объект["ВидДанныхОтображения"+ДемонстрацияОтвета] = ПредопределенноеЗначение("Перечисление.ВидДанныхОтображения.HTML") Тогда
		Элементы.HTML.Видимость = Истина;
		Элементы.ФорматированныйДокумент.Видимость = Ложь;
	Иначе
		Элементы.HTML.Видимость = Ложь;
		Элементы.ФорматированныйДокумент.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте          
Процедура ОбновитьЭлементы_ОперативныйСчетчикВремени()
	
	ВремяНаСервере = ТекущаяДата() + Объект.СинхронизацияСВременемСервера;	
	
	Если ВремяНаСервере<Объект.ВремяОкончанияПаузы Тогда
		
		ТекстИнформация_ПаузаИгра = "<Пауза>";
		ВремяСекунд = МАКС(Объект.ВремяОкончанияПаузы-ВремяНаСервере,0);	
		
	Иначе 	
		
		ВремяСекунд = МАКС(Объект.ВремяЗавершения-ВремяНаСервере,0);
		
		Если ВремяНаСервере<Объект.ВремяЗавершения Тогда // еще не истекло время			
			ТекстИнформация_ПаузаИгра = "";   // Игра					
		Иначе
			
			// время истекло а вопрос не сменился			
			Если ВремяНаСервере<Объект.ВремяЗавершения+10 Тогда
				ТекстИнформация_ПаузаИгра = "";   // Игра
			Иначе			
				ТекстИнформация_ПаузаИгра = "Игра остановлена";
			КонецЕсли;	
			
			Если ВремяОбновленияДанныхИгрока>3 И ВремяНаСервере=Объект.ВремяЗавершения+2 И Объект.ВремяПоследнегоОбновления+1<ВремяНаСервере Тогда // 2-я секунда при истечении времени вопроса
				ОбновитьДанные_ХодИгры(); // Оперативное обновление, если очень большое значение Константы.ВремяОбновленияДанныхИгрока, т.е. много активных игрокове
			КонецЕсли;                                                                  
			
		КонецЕсли;
		
	КонецЕсли;		
	
	Информация_Время = ИгровойКлиент.ПолучитьВремяВЧасахМинутахИСекундах(ВремяСекунд); // Переводим в минуты
	
	Заголовок = ?(ПустаяСтрока(ТекстИнформация_ПаузаИгра), ?(Объект.ДемонстрацияОтвета,"Демонстрация:",Объект.ВопросЗаголовок), ТекстИнформация_ПаузаИгра)+" "+Информация_Время;	
	
	ПодключитьОбработчикОжидания("ОбновитьЭлементы_ОперативныйСчетчикВремени", 0.3, Истина);   // 0.3 - идеально:)
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьДанные_ХодИгры()
	
	// ОПТИМИЗАЦИЯ
	//
	// Получение данных во выполнению текущего маршрута выполнения вопроса и ответов пользователей
	// &НаСервереБезКонтекста !!!
	СтрВопрос = ПолучитьДанныеТекущегоВопросаИОтветовИгроков(Объект.Игра, Объект.Вопрос, Объект.НеСчитыватьОтветыИгроков, Объект.Команда, Объект.ВремяПоследнегоОбновления);
	//
	Новая_СинхронизацияСВременемСервера = СтрВопрос.ТекущаяДатаСеансаНаСервере - ТекущаяДата(); // Обновление синхронизации
	РассинхронизацияСекунд = Новая_СинхронизацияСВременемСервера - Объект.СинхронизацияСВременемСервера; 
	Объект.СинхронизацияСВременемСервера = Новая_СинхронизацияСВременемСервера;
	
	// Фиксация изменений:
	ИзменениеВопроса = (СтрВопрос.Вопрос<>Объект.Вопрос);
	Если НЕ ИзменениеВопроса Тогда		
		ИзмениласьДемонстрацииОтвета = (СтрВопрос.ДемонстрацияОтвета<>Объект.ДемонстрацияОтвета);
		Если НЕ ИзмениласьДемонстрацииОтвета Тогда
			ИзменениеВремени = ?(РассинхронизацияСекунд>0, РассинхронизацияСекунд,-РассинхронизацияСекунд)>2 
			ИЛИ (СтрВопрос.ВремяОкончанияПаузы<>Объект.ВремяОкончанияПаузы)
			ИЛИ (СтрВопрос.ВремяЗавершения<>Объект.ВремяЗавершения);
		КонецЕсли;			
	КонецЕсли;
	
	// Обновленных реквизитов маршрута
	ЗаполнитьЗначенияСвойств(Объект, СтрВопрос);	
	
	
	// Обновление полученных данных 
	Если ИзменениеВопроса Тогда 	
		ОбновитьДанные_Вопрос(Истина, СтрВопрос.МассивДанныхИгроков); // &НаСервере !!!
	ИначеЕсли ИзмениласьДемонстрацииОтвета Тогда // но не изменился вопрос
		ОбновитьДанные_Вопрос(Ложь, СтрВопрос.МассивДанныхИгроков);   // &НаСервере !!!
	Иначе
		Если НЕ Объект.НеСчитыватьОтветыИгроков Тогда // обновление ответов только для выполняемых вопросов
			ОбновитьДанные_ОтветыИгроковНаКлиенте(СтрВопрос.МассивДанныхИгроков, Ложь); // &НаКлиенте
		КонецЕсли;			
		Если ИзменениеВремени Тогда		
			ОбновитьЭлементы_ВидимостьДоступностьПолейРедактированияНаКлиенте();        // &НаКлиенте
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ОкончаниеЛайка(Число)
	
	// Очень смешная функция
	// ЛАЙК :)
	
	Окончание = "ов";
	Если Число<5 ИЛИ Число>20 Тогда		
		ПравыйСимвол = Прав(Строка(Число),1);	
		Если ПравыйСимвол="1" Тогда
			Окончание = "";
		ИначеЕсли СтрНайти("2,3,4",ПравыйСимвол)>0 Тогда
			Окончание = "а";
		КонецЕсли; 			
	КонецЕсли;	
	
	Возврат Окончание;
	
КонецФункции	




// Команды (Команды управления)
&НаКлиенте
Процедура ОткрытьВопрос(Команда)
	
	Если ЗначениеЗаполнено(Объект.Вопрос) Тогда  // - используется для Отладки администратором игры
		Парам = Новый Структура("Ключ", Объект.Вопрос);
		ОткрытьФорму("Справочник.Вопросы.ФормаОбъекта", Парам);
	Иначе
		ПоказатьПредупреждение(,"Нет текущего вопроса!");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеДанные(Команда)
	
	// Эмуляция создания и заполнения данных формы	
	ПриСозданииНаСервере(Неопределено, Неопределено);
	
	// СТОП: счетчика Времени
	ОтключитьОбработчикОжидания("ОбновитьЭлементы_ОперативныйСчетчикВремени");	
	// СТОП: обновления игровых данных из базы
	ОтключитьОбработчикОжидания("ОбновитьДанные_ХодИгры");	
	
	// Эмуляция открытия формы
	Отказ = Ложь;
	ПриОткрытии(Отказ);
	
	Если Отказ Тогда
		Закрыть(); // Закрываем форму
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОставитьКомментарийКВопросу(Команда)
	
	// Мнение игрока о вопросе
	ОткрытьФорму("ОбщаяФорма.ФормаОставитьОтзыв", Новый Структура("Вопрос", Объект.Вопрос));
	
КонецПроцедуры

&НаКлиенте
Процедура Лайк(Команда)
	
	// Нравится! :)
	СтрВозврат = ИгровойСерверПривилегированный.ЭмоциональнаяОценкаВопросаОбщийРейтинг(Объект.Игра, Объект.Вопрос, 1);
	Состояние("Спасибо за классную оценку :)          Итого:  "+Строка(СтрВозврат.КоличествоЛайков)+" лайк"+ОкончаниеЛайка(СтрВозврат.КоличествоЛайков)+" и "+Строка(СтрВозврат.КоличествоДизлайков)+" дизлайк"+ОкончаниеЛайка(СтрВозврат.КоличествоДизлайков));
	
КонецПроцедуры

&НаКлиенте
Процедура ДизЛайк(Команда)
	
	// НЕ нравится! =(
	СтрВозврат = ИгровойСерверПривилегированный.ЭмоциональнаяОценкаВопросаОбщийРейтинг(Объект.Игра, Объект.Вопрос, -1);
	Состояние("Спасибо за честную оценку =(          Итого:  "+Строка(СтрВозврат.КоличествоЛайков)+" лайк"+ОкончаниеЛайка(СтрВозврат.КоличествоЛайков)+" и "+Строка(СтрВозврат.КоличествоДизлайков)+" дизлайк"+ОкончаниеЛайка(СтрВозврат.КоличествоДизлайков));
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийРезультатИгры(Команда)
	
	// Текущие результаты команд
	ОткрытьФорму("Отчет.РезультатИгры.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии",Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура РейтингИгроков(Команда)
	
	// Рейтинг игроков
	ОткрытьФорму("Отчет.РейтингИгроков.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии",Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрокиКоманд(Команда)
	
	// Рейтинг игроков
	ОткрытьФорму("Отчет.ИгрокиКоманд.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии",Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьВысотуТаблицыОтветов(Команда)
	
	// Высоты ТЧ  (+2)
	РасчетнаяВысотаТЧОтветыИгроков = РасчетнаяВысотаТЧОтветыИгроков + 2;
	Состояние("MAX высота: "+Строка(РасчетнаяВысотаТЧОтветыИгроков+2));
	ОбновитьЭлементы_ВидимостьДоступностьПолейРедактированияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьВысотуТаблицыОтветов(Команда)
	
	// Высоты ТЧ  (-2)
	РасчетнаяВысотаТЧОтветыИгроков = РасчетнаяВысотаТЧОтветыИгроков - 2;
	Если РасчетнаяВысотаТЧОтветыИгроков<2 Тогда
		РасчетнаяВысотаТЧОтветыИгроков = 2;
	КонецЕсли;	
	Состояние("MAX высота: "+Строка(РасчетнаяВысотаТЧОтветыИгроков+2));
	ОбновитьЭлементы_ВидимостьДоступностьПолейРедактированияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	
	ОповещениеОВыбореИзСписка = Новый ОписаниеОповещения("ОтчетыВыборИзМеню", ЭтотОбъект);	
	ПоказатьВыборИзМеню(ОповещениеОВыбореИзСписка, СписокКнопокОтчеты, Элементы.Отчеты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыВыборИзМеню(Результат, ДопПарам) Экспорт
	
	// Запуск выбранных команд но кнопке "Отчёты"
	//
	
	Если Результат<>Неопределено Тогда		
		Если Результат.Значение = "Рейтинг игроков" Тогда			
			РейтингИгроков(Неопределено);
		ИначеЕсли Результат.Значение = "Состав команд" Тогда
			ИгрокиКоманд(Неопределено);
		ИначеЕсли Результат.Значение = "Результат игры" Тогда
			ТекущийРезультатИгры(Неопределено);
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйВводОтвета(Команда)
	
	// БЫСТРЫЙ ВВОД ОТВЕТА		
	Если Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Тест") Тогда // ТЕСТ		
		Если НЕ Объект.ДемонстрацияОтвета Тогда 
			ОповещениеОВыбореИзСписка = Новый ОписаниеОповещения("ОтветыИгроковПередНачаломИзмененияВыборИзМеню", ЭтотОбъект);
			//ПоказатьВыборИзМеню(ОповещениеОВыбореИзСписка, Объект.ВариантыОтветовНаТест, Элементы.БыстрыйВводОтвета);	// - старая процедура		
			ОповещениеОВыбореИзСписка = Новый ОписаниеОповещения("ОтветыИгроковПередНачаломИзмененияВыборИзМеню", ЭтотОбъект);
			Парам = Новый Структура("ВариантыОтветовНаТест,Масштаб",Объект.ВариантыОтветовНаТест, Масштаб);
			ОткрытьФорму("Обработка.ИгровойСтолУчастника.Форма.БыстрыйВыборЗначенияТеста", Парам, ЭтаФорма, , , , ОповещениеОВыбореИзСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			 
		Иначе
			// Демонстрация ответа на тест
		КонецЕсли;		
	ИначеЕсли Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.ВопросСОтветом") Тогда // ТЕКСТОВЫЙ ВОПРОС
		Если НЕ Объект.ДемонстрацияОтвета Тогда 
			
			ТекстПодсказки = "ОТВЕТ";
			ТекущиеДанныеСтроки = ""; 
			ТекДанные = Элементы.ОтветыИгроков.ТекущиеДанные;			
			Если ТекДанные<>Неопределено Тогда
				Если Объект.ОтветыИгроков.Количество()>1 Тогда
					ТекстПодсказки = "ОТВЕТ №"+Строка(ТекДанные.НомерСтроки) + ?(Объект.ИспользоватьПредставление," "+СокрЛП(ТекДанные.Представление),"");			
				КонецЕсли;
				ТекущиеДанныеСтроки = ТекДанные["Ответ"+Строка(Объект.НомерИгрока)];
			КонецЕсли;	
			
			ОповещениеОБыстромВводеСтроки = Новый ОписаниеОповещения("ОтветыИгроковБыстрыйВводСтроки", ЭтотОбъект);
			//ПоказатьВводСтроки(ОповещениеОБыстромВводеСтроки, ТекущиеДанныеСтроки, ТекстПодсказки, , Истина);	// - старая процедура			
			Парам = Новый Структура("ТекстПодсказки,ТекущиеДанныеСтроки, Масштаб",ТекстПодсказки,ТекущиеДанныеСтроки, Масштаб);
			ОткрытьФорму("Обработка.ИгровойСтолУчастника.Форма.БыстрыйВыборТекста", Парам, ЭтаФорма, , , , ОповещениеОБыстромВводеСтроки);			
			ТекущийЭлемент = Элементы.ОтветыИгроков; // Устанавливаем активность поля ТЧ, чтобы избежать ошибки непроизвольного вызова Enter после события завершения редактирования поля текстового ответа
			
		Иначе
			// Демонстрация ответа на тестовый вопрос
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧат(Команда)
	
	// Чат
	ОткрытьФорму("РегистрСведений.Чат.Форма.Чат");
	
КонецПроцедуры




// Обработчики событий общие
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	// БЛОКИРОВКА
	СтрБлокировка = ИгровойСерверПривилегированный.ПолучитьЗначениеБлокировкиТекущегоПользователя();		
	Если ЗначениеЗаполнено(СтрБлокировка.ВремяЗавершенияБлокировки) И НЕ СтрБлокировка.РазрещенаРабота Тогда
		Сообщить("Администратор не разрешает работу в программе до "+Строка(СтрБлокировка.ВремяЗавершенияБлокировки));
		Отказ = Истина;
	КонецЕсли;	
	
		
	// КНОПКА: ОТЧЕТЫ
	СписокКнопокОтчеты.Очистить();
	СписокКнопокОтчеты.Добавить("Рейтинг игроков");
	СписокКнопокОтчеты.Добавить("Состав команд");
	СписокКнопокОтчеты.Добавить("Результат игры");
	
	
	// ИНФОРМАЦИЯ ОБ ЭКРАНАХ КЛИЕНТА:  {Эмпирический расчет}
	МассивЭкрановКлиента = ПолучитьИнформациюЭкрановКлиента();
	Если МассивЭкрановКлиента.Количество()>0 Тогда		
		ВысотаОсновногоЭкрана = МассивЭкрановКлиента[0].Высота;	// - высота основного экрана
		Если ВысотаОсновногоЭкрана>=1200 Тогда
			РасчетнаяВысотаТЧОтветыИгроков = 10;
		ИначеЕсли ВысотаОсновногоЭкрана>=1000 Тогда 	
			РасчетнаяВысотаТЧОтветыИгроков = 7;
		ИначеЕсли ВысотаОсновногоЭкрана>=900 Тогда 	
			РасчетнаяВысотаТЧОтветыИгроков = 5;	
		ИначеЕсли ВысотаОсновногоЭкрана>=800 Тогда 	
			РасчетнаяВысотаТЧОтветыИгроков = 4;
		Иначе	
			РасчетнаяВысотаТЧОтветыИгроков = 3;
		КонецЕсли;
	Иначе
		РасчетнаяВысотаТЧОтветыИгроков = 10;
	КонецЕсли;
	
	
	// При открытии обработки из элемента справочника "Вопросы"
	Параметры.Свойство("РежимДемонстрационногоПросмотраВопроса", РежимДемонстрационногоПросмотраВопроса);	
	Если НЕ РежимДемонстрационногоПросмотраВопроса Тогда
				
		// СТАТИЧЕСКИЕ ДАННЫЕ
		//
		// Получить Текущую игру
		Объект.Игра = Константы.ТекущаяИгра.Получить();
		//
		// Получить Текущего игрока
		Объект.Игрок = ПараметрыСеанса.ТекущийПользователь;		
		
		
		// Время Обновления данных игроков:
		ВремяОбновленияДанныхИгрока = Константы.ВремяОбновленияДанныхИгрока.Получить();
		Если ВремяОбновленияДанныхИгрока=0 Тогда
			ВремяОбновленияДанныхИгрока = 3;
		КонецЕсли;
		
		// Заполнение данных по всем вопросам текущего маршрута игры:
		Объект.ДанныеВопросовТекущейИгры = ИгровойСерверПривилегированный.ПолучитьДанныеВопросовИзМаршрутаТекущейИгры();
		
		
		// ДИНАМИЧЕСКИЕ ДАННЫЕ
		Если ЗначениеЗаполнено(Объект.Игра) И ЗначениеЗаполнено(Объект.Игрок) Тогда			
			
			// Получение данных всех игроков команды, заполнение команды и номера текущего игрока
			ТЗ_ДанныеИгроков = ИгровойСерверПривилегированный.ПолучитьДанныеКомандыИгрока(Объект.Игра, Объект.Игрок);	
			Если ТЗ_ДанныеИгроков.Количество()>0 Тогда // Заполнняем данные настройки колонок ТЧ
				
				// Заполнить Номер текущего игрока:
				Объект.НомерИгрока = ТЗ_ДанныеИгроков.Получить(0).НомерТекущегоИгрока;
				
				// Заполнить Номер текущего игрока:
				Объект.Команда = ТЗ_ДанныеИгроков.Получить(0).Команда;
				
				// Заполнение настроек в ТЧ команды
				Для Каждого КолонкаТЧ Из Элементы.ОтветыИгроков.ПодчиненныеЭлементы Цикл	
					Если СтрНайти(КолонкаТЧ.Имя,"ОтветыИгроковОтвет")>0 Тогда		
						НомерКолонки = Число(СтрЗаменить(КолонкаТЧ.Имя,"ОтветыИгроковОтвет",""));	
						Отбор = Новый Структура("НомерИгрока", НомерКолонки);
						МассивСтрок = ТЗ_ДанныеИгроков.НайтиСтроки(Отбор);
						Если МассивСтрок.Количество()>0 Тогда
							КолонкаТЧ.Заголовок = СокрЛП(МассивСтрок[0].ИгрокНаименование) + ?(НомерКолонки=1," [Капитан]","");
							КолонкаТЧ.Видимость = Истина;				
							Если НомерКолонки=1 Тогда
								КолонкаТЧ.ЦветТекстаЗаголовка = WebЦвета.Синий;  // Капитан
							ИначеЕсли Объект.НомерИгрока=НомерКолонки Тогда
								КолонкаТЧ.ЦветТекстаЗаголовка = WebЦвета.ТемноФиолетовый; // Для себя увеличим видимость
							Иначе
								КолонкаТЧ.ЦветТекстаЗаголовка = WebЦвета.Черный; // Остальные
							КонецЕсли;			
						Иначе                           
							КолонкаТЧ.Видимость = Ложь;
						КонецЕсли;
						Если НомерКолонки<>Объект.НомерИгрока Тогда
							КолонкаТЧ.РедактированиеТекста = Ложь;  // запрет редактирование текста в других колонках
							КолонкаТЧ.Подсказка = "Колонка с ответом другого игрока команды";
						Иначе
							КолонкаТЧ.Подсказка = "Колонка для ввода Вашего ответа";
							КолонкаТЧ.ПодсказкаВвода = "Введите ответ";
						КонецЕсли;	
					Иначе
						КолонкаТЧ.ТолькоПросмотр = Истина;
					КонецЕсли;				
				КонецЦикла;
				
			КонецЕсли;	
			
			Если Объект.НомерИгрока>0 Тогда // Отрисовываем данные если игрок обнаружен в игре:
				
				// Игрок должен видеть свою колонку как самую левую:
				Элементы.Переместить(Элементы["ОтветыИгроковОтвет"+Строка(Объект.НомерИгрока)], Элементы.ОтветыИгроков, Элементы.ОтветыИгроковПредставление);
				
				
				// Подсказка ТЧ.ОтветыИгроков
				Элементы.ОтветыИгроков.Подсказка = "Ввод ответа вручную осуществляется в своей колонке """ + Строка(ПараметрыСеанса.ТекущийПользователь)+"""" + Символы.ПС + 
				"Или нажатием на кнопку ""ОТВЕТ"" (Ctrl+Enter)";
				Если Объект.НомерИгрока = 1 Тогда
					Элементы.ОтветыИгроков.Подсказка = Элементы.ОтветыИгроков.Подсказка + Символы.ПС +Символы.ПС + 
					"Скопировать ответ игрока: нажать два раза левой кнопкой мышки";			
				КонецЕсли;		
				
				// Получение данных во выполнению текущего маршрута выполнения вопроса и ответов пользователей
				Объект.Вопрос = Справочники.Вопросы.ПустаяСсылка();
				Объект.НеСчитыватьОтветыИгроков = Ложь;
				Объект.ВремяПоследнегоОбновления = '00010101';
				СтрВопрос = ПолучитьДанныеТекущегоВопросаИОтветовИгроков(Объект.Игра, Объект.Вопрос, Объект.НеСчитыватьОтветыИгроков, Объект.Команда, Объект.ВремяПоследнегоОбновления);
				ЗаполнитьЗначенияСвойств(Объект, СтрВопрос);  // Заполнение реквизитов маршрута	
				ОбновитьДанные_Вопрос(Истина, СтрВопрос.МассивДанныхИгроков); // Заполнение реквизитов вопроса
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Реквизиты просморта вопроса
		Объект.Вопрос = Параметры.Вопрос;
		Объект.ДемонстрацияОтвета = Параметры.ДемонстрацияОтвета;
		
		// Интерфейсные - для красоты просмотра
		Объект.НомерИгрока = 1;
		Элементы.Переместить(Элементы["ОтветыИгроковОтвет"+Строка(Объект.НомерИгрока)], Элементы.ОтветыИгроков, Элементы.ОтветыИгроковПредставление);
		Элементы["ОтветыИгроковОтвет"+Строка(Объект.НомерИгрока)].Заголовок = ПараметрыСеанса.ТекущийПользователь;
		
		// Пустое:
		МассивИндексВопросов = Новый Массив;
		МассивИндексВопросов.Добавить(Неопределено); 
		МассивИндексВопросов.Добавить(Справочники.Вопросы.ПустаяСсылка());
		МассивДанных = Новый Массив;
		МассивДанных.Добавить(МассивИндексВопросов);		
		Объект.ДанныеВопросовТекущейИгры = Новый Структура("МассивДанных",МассивДанных);
		
		// Заполнение данных вопроса
		ОбновитьДанные_Вопрос(Истина, Новый Массив);
		
	КонецЕсли;
	
	// Для Отладки вопроса при Демонстрации
	ЕстьПраваНаОтладку = РольДоступна("ПолныеПрава") ИЛИ Константы.АдминистраторИгры.Получить()=ПараметрыСеанса.ТекущийПользователь;
	Элементы.ОткрытьВопрос.Видимость   = ЕстьПраваНаОтладку;
	Элементы.ОткрытьВопрос.Доступность = ЕстьПраваНаОтладку;
	
	
	// Переменная запоняется при запуске игрового стола и позволяет играть с разными часовыми поясами
	// в одно и тоже время on-line 
	Объект.ТекущаяДатаСеансаНаСервере = ТекущаяДатаСеанса();                             
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// При открытии обработки из элемента справочника "Вопросы"
	Если РежимДемонстрационногоПросмотраВопроса Тогда Возврат; КонецЕсли;
	
	// Переменная запоняется при запуске игрового стола и позволяет играть с разными часовыми поясами
	// в одно и тоже время on-line 
	Объект.СинхронизацияСВременемСервера = Объект.ТекущаяДатаСеансаНаСервере - ТекущаяДата();	
	
	// Критическая проверка на возможность дпльнейшей игры
	Если НЕ ЗначениеЗаполнено(Объект.Игра) Тогда
		ПоказатьПредупреждение(,"Игра ещё на началась!");
		Отказ = Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Игрок) Тогда
		ПоказатьПредупреждение(,"В параметрах сеанса не определён игрок!");
		Отказ = Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Команда) Тогда
		ПоказатьПредупреждение(,"Пользователь с именем "+Строка(Объект.Игрок)+" не введен ни в одну из учавствующих команд!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда Возврат; КонецЕсли;	
	
	// При обновлении данных формы:
	Масштаб = 100;
	
	// СТАРТ: счетчика Времени
	ПодключитьОбработчикОжидания("ОбновитьЭлементы_ОперативныйСчетчикВремени", 0.3, Истина);
	
	// СТАРТ: обновления игровых данных из базы
	ПодключитьОбработчикОжидания("ОбновитьДанные_ХодИгры", ВремяОбновленияДанныхИгрока);	
	
КонецПроцедуры



// Обработчики событий формы
&НаКлиенте
Процедура ОтветыИгроковПередНачаломИзменения(Элемент, Отказ)
	
	Если СтрНайти(Элемент.ТекущийЭлемент.Имя,"ОтветыИгроковОтвет")>0 Тогда
		
		НомерКолонкиОткуда = Число(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "ОтветыИгроковОтвет",""));
		Если Объект.НомерИгрока=НомерКолонкиОткуда Тогда 
			
			Если Объект.ВариантыОтветовНаТест.Количество()>0 Тогда // Выбор из списка (тест)
				Отказ = Истина;
				ОповещениеОВыбореИзСписка = Новый ОписаниеОповещения("ОтветыИгроковПередНачаломИзмененияВыборИзМеню", ЭтотОбъект);
				ПоказатьВыборИзМеню(ОповещениеОВыбореИзСписка, Объект.ВариантыОтветовНаТест, Элемент);				
			Иначе
				// Это ввод текста вручную ...
			КонецЕсли;
			
		Иначе
			
			Если Объект.НомерИгрока=1 Тогда // капитан команды может копировать себе в ответ данные
				СкопированноеЗначение = Элементы.ОтветыИгроков.ТекущиеДанные["Ответ"+Строка(НомерКолонкиОткуда)];				
				Если ЗначениеЗаполнено(СкопированноеЗначение) Тогда
					ТекДанные = Элементы.ОтветыИгроков.ТекущиеДанные;
					Если ТекДанные<>Неопределено Тогда
						// Помещение в свою ячейку
						ТекДанные["Ответ"+Строка(Объект.НомерИгрока)] = СкопированноеЗначение;
						// Запись ответа в регистр ОтветыИгроков
						ИгровойСерверПривилегированный.ОтправитьДанныеОтветаИгрока(Объект.Игра, Объект.Вопрос, Объект.Команда, ТекДанные.НомерСтроки, Объект.НомерИгрока, Объект.Игрок, СкопированноеЗначение);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Отказ = Истина;			
		КонецЕсли;		
	Иначе
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОтветыИгроковПередНачаломИзмененияВыборИзМеню(Результат, ДопПарам) Экспорт
	
	// Обработка результата выбора из списка для теста
	Если НЕ Объект.ДемонстрацияОтвета И Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.Тест") Тогда
		Если Результат<>Неопределено Тогда
			ТекДанные = Элементы.ОтветыИгроков.ТекущиеДанные;
			Если ТекДанные<>Неопределено Тогда
				ТекДанные["Ответ"+Строка(Объект.НомерИгрока)] = Результат.Значение;
				ИгровойСерверПривилегированный.ОтправитьДанныеОтветаИгрока(Объект.Игра, Объект.Вопрос, Объект.Команда, ТекДанные.НомерСтроки, Объект.НомерИгрока, Объект.Игрок, Результат.Значение);			
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветыИгроковБыстрыйВводСтроки(Результат, ДопПарам) Экспорт
	
	// Обработка результата ответа текстового вопроса
	Если НЕ Объект.ДемонстрацияОтвета И Объект.ВидВопроса=ПредопределенноеЗначение("Перечисление.ВидВопроса.ВопросСОтветом") Тогда
		Если Результат<>Неопределено Тогда
			ТекДанные = Элементы.ОтветыИгроков.ТекущиеДанные;
			Если ТекДанные<>Неопределено Тогда
				
				ТекДанные["Ответ"+Строка(Объект.НомерИгрока)] = Результат;
				ИгровойСерверПривилегированный.ОтправитьДанныеОтветаИгрока(Объект.Игра, Объект.Вопрос, Объект.Команда, ТекДанные.НомерСтроки, Объект.НомерИгрока, Объект.Игрок, Результат);				
				
				// Для множественных ответов после ввода строки передвигаем курсор на одну позицию вниз
				КоличествоОтветов = Объект.ОтветыИгроков.Количество();
				Если КоличествоОтветов>1 Тогда 
					ИдентификаторСтроки = Элементы.ОтветыИгроков.ТекущаяСтрока;
					Если ТипЗнч(ИдентификаторСтроки)=Тип("Число") Тогда // условие найденной строки
						Элементы.ОтветыИгроков.ТекущаяСтрока = ИдентификаторСтроки + 1;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветыИгроковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтветыИгроковПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтветыИгроковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Отправка данных ответа после редактирования в своей ячейке
	ТекЭлемент = Элементы.ОтветыИгроков.ТекущийЭлемент;
	Если ТекЭлемент<>Неопределено И ТекЭлемент.Имя="ОтветыИгроковОтвет"+Строка(Объект.НомерИгрока) Тогда		
		ТекДанные = Элементы.ОтветыИгроков.ТекущиеДанные;
		Если ТекДанные<>Неопределено Тогда
			// Запись ответа в регистр ОтветыИгроков
			ИгровойСерверПривилегированный.ОтправитьДанныеОтветаИгрока(Объект.Игра, Объект.Вопрос, Объект.Команда, ТекДанные.НомерСтроки, Объект.НомерИгрока, Объект.Игрок, ТекДанные["Ответ"+Строка(Объект.НомерИгрока)]); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры               

