



// Команды
&НаКлиенте
Процедура Отправить(Команда)
	
	Если ЗначениеЗаполнено(Отзыв) Тогда	
		ОтправитьНаСервере();
	КонецЕсли;	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Создание записи в регистре:
	Запись = РегистрыСведений.Отзывы.СоздатьМенеджерЗаписи();
	Запись.ДатаОтзыва = ТекущаяДатаСеанса();
	Запись.Игра = Константы.ТекущаяИгра.Получить();
	Запись.Вопрос = Вопрос;
	Запись.Отзыв = Отзыв;
	Если Не Анонимно Тогда
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
		
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры



// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение вопроса:
	Параметры.Свойство("Вопрос", Вопрос);
	
	Если ЗначениеЗаполнено(Вопрос) Тогда
		Заголовок = "Комментарий к вопросу: "+Строка(Вопрос);
	КонецЕсли;	                          
		
КонецПроцедуры

