

// Процедуры и функции
&НаСервере
Процедура УстановитьОтборПоИгреВДинамическихСписках()
	
	// Устанавливаем фиксированнный отбор в ДинамическихСписках
	//
	
	// ОтветыКоманд
	ФиксированныйОтбор = ОтветыКоманд.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяИгра;
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Команда");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяКоманда;
	
	
	// ПодачаАпелляции
	ФиксированныйОтбор = ПодачаАпелляции.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяИгра;
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Команда");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяКоманда;
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Рассмотрена");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
КонецПроцедуры




// Команды
&НаКлиенте
Процедура ПодатьНаАпелляцию(Команда)
	
	Если ЗначениеЗаполнено(ТекущаяИгра) И ЗначениеЗаполнено(ТекущаяКоманда) И ЗначениеЗаполнено(ТекущийВопрос) И ТекущийНомерСтр<>0 Тогда	
		Если НЕ ЗначениеЗаполнено(ТекущийОтветственный) Тогда
			ПоказатьПредупреждение(,"Ответ ещё не обработан");
		Иначе	
			Парам = Новый Структура("Игра,Команда,Вопрос,НомерСтр,ОтветКоманды,ОтветПравильный",ТекущаяИгра,ТекущаяКоманда,ТекущийВопрос,ТекущийНомерСтр,ОтветКоманды,ОтветПравильный);	
			ОткрытьФорму("ОбщаяФорма.ФормаПодачаАпелляции", Парам, ЭтаФорма);
			Если ТекущиеБаллы>0 Тогда
				ПоказатьПредупреждение(,"Апелляцию имеет смысл подавать при отсутствии баллов!");
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Нет данных для отпревки апелляции!");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры




// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение данных
	СтруктураИнф = ИгровойСерверПривилегированный.ПолучитьДанныеТекущейИгры();
	ТекущаяИгра    = СтруктураИнф.Игра;
	ТекущаяКоманда = СтруктураИнф.Команда;
	
	УстановитьОтборПоИгреВДинамическихСписках();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветыКомандПриАктивизацииСтроки(Элемент)
	
	// Установка текущих значений в строке
	ТекДанные = Элементы.ОтветыКоманд.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда
		ТекущийВопрос = ТекДанные.Вопрос;
		ТекущийНомерСтр = ТекДанные.НомерСтр;
		ТекущиеБаллы = ТекДанные.Баллы;
		ОтветКоманды = ТекДанные.Ответ;
		ОтветПравильный = ТекДанные.ОтветПравильный;
		ТекущийОтветственный = ТекДанные.Ответственный;
	Иначе
		ТекущийВопрос = Неопределено;
		ТекущийНомерСтр = 0;
		ТекущиеБаллы = 0;
		ОтветКоманды = "";
		ОтветПравильный = "";
		ТекущийОтветственный = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры


