


// Процедуры и функции (подключенные обработчики)	
&НаКлиенте
Процедура ОбновитьДанные_ОперативныйСчетчикВремени()
	
	ВремяНаСервере = ТекущаяДата() + Объект.СинхронизацияСВременемСервера;	
	
	Если ВремяНаСервере<=Объект.ВремяОкончанияПаузы Тогда
		
		ТекстИнформация_ПаузаИгра = "<Пауза>";
		ВремяСекунд = МАКС(Объект.ВремяОкончанияПаузы-ВремяНаСервере,0);	
		Если ВремяСекунд<=5 Тогда
			Цвет = WebЦвета.КрасноФиолетовый;
		Иначе
			Цвет = WebЦвета.Фиолетовый;
		КонецЕсли;
		
	Иначе 	
		
		ВремяСекунд = МАКС(Объект.ВремяЗавершения-ВремяНаСервере,0);
		
		Если ВремяНаСервере<=Объект.ВремяЗавершения Тогда // еще не истекло время			
			ТекстИнформация_ПаузаИгра = "Игра";
			Если Объект.ВремяЗавершения-ВремяНаСервере>5 Тогда
				Цвет = WebЦвета.Зеленый;
			Иначе	
				Цвет = WebЦвета.Красный
			КонецЕсли;			
		Иначе // время истекло а вопрос не сменился			
			Если ВремяНаСервере<Объект.ВремяЗавершения+10 Тогда
				ТекстИнформация_ПаузаИгра = "Игра";
				Цвет = WebЦвета.Красный;
			Иначе			
				ТекстИнформация_ПаузаИгра = "Игра остановлена";
				Цвет = WebЦвета.Черный;
			КонецЕсли;				
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ТекстИнформация_ПаузаИгра<>Информация_ПаузаИгра Тогда
		Информация_ПаузаИгра = ТекстИнформация_ПаузаИгра;
	КонецЕсли;
	
	Информация_Время = ИгровойКлиент.ПолучитьВремяВЧасахМинутахИСекундах(ВремяСекунд);
	Если Элементы.Информация_Время.ЦветТекста<>Цвет Тогда
		Элементы.Информация_Время.ЦветТекста = Цвет; 
	КонецЕсли;
	
	Заголовок = СокрЛП(Объект.ВопросНаименование);
	
	ПодключитьОбработчикОжидания("ОбновитьДанные_ОперативныйСчетчикВремени", 0.3, Истина);   // 0.3 - идеально:)
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьДанные_ХодИгры()
	
	Если ЗначениеЗаполнено(Объект.Игра) Тогда
		
		Если ФормаДоступнаТолькоНаПросмотр Тогда // Только обновление данных
			
			// Получение данных текущего вопроса, синхронизации времени
			СтрОбъект = ПолучитьДанныеТекущегоВопроса_ОбновитьСинхронизациюСВремениСервера(Объект.Игра);
			Если СтрОбъект.НомерСледования<>Объект.НомерСледования Тогда // Изменился номер следования
				Элементы.МаршрутИгры.Обновить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Объект, СтрОбъект);
			Объект.СинхронизацияСВременемСервера = Объект.ТекущаяДатаСеансаНаСервере - ТекущаяДата();
			
		Иначе
			
			// Обновление данных строки состояния
			Объект.СтрокаСостояния = ИгровойСерверПривилегированный.ОбновитьИнформациюСтрокиСостоянияТекущегоВопроса(Объект.Игра);
			
			// Т.к. данные в регистре могут обновляться только одним человеком - это администратор игры
			// то нет смысла частых запросов к информационной базе
			// Проверка дат завершения задания для переключения Хода игры на следующие по номеру следования вопрос
			Если Объект.ВремяЗавершения <= (ТекущаяДата()+Объект.СинхронизацияСВременемСервера) Тогда // Как только сравнялись - делаем запросы	
				Если Объект.АктивныйХодИгры И ЗначениеЗаполнено(Объект.Игра) Тогда	
					Если ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры() Тогда
						СтрОбъект = ПроверитьВыполнитьСледующийХод(Объект.Игра);
						ЗаполнитьЗначенияСвойств(Объект, СтрОбъект);
						Объект.СинхронизацияСВременемСервера = Объект.ТекущаяДатаСеансаНаСервере - ТекущаяДата();
						Если СтрОбъект.ЭтоНоваяЗапись=Истина Тогда Элементы.МаршрутИгры.Обновить(); КонецЕсли;
						Блокировка_РегистрМаршрутаЗанят = ?(Блокировка_РегистрМаршрутаЗанят, Ложь, Истина);		
					Иначе
						Сообщить("Конфликт разделенного доступа для записи в регистр сведений ""МаршрутПроведенияИгры""");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВыполнитьСледующийХод(Игра)
	
	// Процедура соуществляющая переход на следующую строку маршрута
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	ВЫБОР
	|		КОГДА МаршрутПроведенияИгры.ВремяЗавершения < &ТекущаяДатаСеанса
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХодЗавершен,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения
	|ПОМЕСТИТЬ ЗавершенныйХод
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.АктивныйВопрос
	|	И МаршрутПроведенияИгры.Игра = &Игра
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСледования УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос
	|ИЗ
	|	ЗавершенныйХод КАК ЗавершенныйХод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|		ПО ЗавершенныйХод.Игра = МаршрутПроведенияИгры.Игра
	|			И (ЗавершенныйХод.ХодЗавершен)
	|			И ЗавершенныйХод.НомерСледования < МаршрутПроведенияИгры.НомерСледования
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутПроведенияИгры.НомерСледования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗавершенныйХод.Игра КАК Игра,
	|	ЗавершенныйХод.АктивныйВопрос КАК АктивныйВопрос,
	|	ЗавершенныйХод.НомерСледования КАК НомерСледования,
	|	ЗавершенныйХод.Вопрос КАК Вопрос,
	|	ЗавершенныйХод.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы,
	|	ЗавершенныйХод.ВремяЗавершения КАК ВремяЗавершения
	|ИЗ
	|	ЗавершенныйХод КАК ЗавершенныйХод";	
	Запрос.УстановитьПараметр("Игра",              Игра);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	СтрОбъект = Новый Структура("ЭтоНоваяЗапись,НомерСледования,ВремяОкончанияПаузы,ВремяЗавершения,Вопрос,ТекущаяДатаСеансаНаСервере");
	
	ВыборкаНовыйХод = МассивРезультатов[1].Выбрать(); // - выборка 1 записи следующего хода
	Если ВыборкаНовыйХод.Количество()>0 Тогда
		ВыборкаНовыйХод.Следующий();
		
		// Делаем активной новую и снимаем активность у старой записи. СтрОбъект - новая запись.	
		
		// Обновление записи Нового* хода	
		Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаНовыйХод);	
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда			
			Запись.АктивныйВопрос = Истина; // Изменение активности записи
			Запись.ВремяСтарта = ТекущаяДатаСеанса();
			Запись.ВремяНачалаПаузы = Дата(1,1,1);
			Запись.ВремяОкончанияПаузы = Дата(1,1,1);
			Запись.Длительность = ?(ЗначениеЗаполнено(Запись.Длительность), Запись.Длительность, 60);
			Запись.ВремяЗавершения = Запись.ВремяСтарта + Запись.Длительность;	
			Запись.Записать(Истина);	
			
			ЗаполнитьЗначенияСвойств(СтрОбъект, Запись); 
			СтрОбъект.ЭтоНоваяЗапись = Истина;			
		КонецЕсли;	
		
		
		// Убираем активность со старой записи
		ВыборкаСтарыйХод = МассивРезультатов[2].Выбрать(); // - выборка 1 записи старого, уже завершенного хода
		ВыборкаСтарыйХод.Следующий();
		// Обновление записи Старого хода	
		Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаСтарыйХод);	
		Запись.Прочитать();		
		Если Запись.Выбран() Тогда			
			Запись.АктивныйВопрос = Ложь; // Изменение активности записи		
			Запись.Записать(Истина);		
		КонецЕсли;			
		
	Иначе
		
		ВыборкаСтарыйХод = МассивРезультатов[2].Выбрать(); // - выборка 1 записи старого, ещё не завершенного хода
		Если ВыборкаСтарыйХод.Количество()>0 Тогда
			ВыборкаСтарыйХод.Следующий();
			ЗаполнитьЗначенияСвойств(СтрОбъект, ВыборкаСтарыйХод);	
			СтрОбъект.ЭтоНоваяЗапись = Ложь;
		КонецЕсли;
		
	КонецЕсли;	
		
	// Наименование вопроса для Заголовка
	Если ЗначениеЗаполнено(СтрОбъект.Вопрос) Тогда
		СтрОбъект.Вставить("ВопросНаименование", СокрЛП(СтрОбъект.Вопрос.Наименование));    // 777 Оптимизация
	КонецЕсли;
	
	// Для синхронизации с временем Сервера
	СтрОбъект.ТекущаяДатаСеансаНаСервере = ТекущаяДатаСеанса();
	
	Возврат СтрОбъект;
	
КонецФункции




// Процедуры и функции (общие)
&НаКлиенте
Функция ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры()
	
	Если НЕ Блокировка_РегистрМаршрутаЗанят Тогда
		
		Блокировка_РегистрМаршрутаЗанят = Истина;
		Блокировка_ВремяУстановкиНаРегистрМаршрута = ТекущаяДата() + Объект.СинхронизацияСВременемСервера;
		Возврат Истина;		
		
	Иначе // идет изменение
		
		Если (ТекущаяДата()+Объект.СинхронизацияСВременемСервера)-Блокировка_ВремяУстановкиНаРегистрМаршрута>3 Тогда
			
			// слишком долго, поэтому мы обрываем процесс старый обновления
			Блокировка_ВремяУстановкиНаРегистрМаршрута = ТекущаяДата()+Объект.СинхронизацияСВременемСервера;
			Возврат Истина;				
			
		Иначе
			Возврат Ложь; // Ждём
		КонецЕсли;			
		
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Процедура УстановитьОтборПоИгреВДинамическихСписках()
	
	// Устанавливаем фиксированнный отбор в ДинамическихСписках
	//
	
	// МаршрутИгры
	ФиксированныйОтбор = МаршрутИгры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Игра;
	
	// МаршрутПроведенияИгры
	ФиксированныйОтбор = МаршрутПроведенияИгры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Игра;
	Элементы.МаршрутПроведенияИгры.Обновить(); // - почему-то не обновляется только этот список, поэтому принудительно обновляем только его :)
	
	// ОтветыКоманд
	ФиксированныйОтбор = ОтветыКоманд.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	ФиксированныйОтбор.Очистить();	
	ЭлементОтбора = ФиксированныйОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Игра");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Игра;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Проверить_ЭтоАдминистарорИгры()
	
	АдминистраторИгры = Константы.АдминистраторИгры.Получить();
	Если НЕ ЗначениеЗаполнено(АдминистраторИгры) Тогда
		Сообщить("Не установлен администратор игры!        [Констант.АдминистраторИгры]");
		ЭтоАдминистарорИгры = Ложь;
	Иначе
		Если АдминистраторИгры<>ПараметрыСеанса.ТекущийПользователь Тогда
			Сообщить("Установленный администратор игры """+СокрЛП(АдминистраторИгры)+""" не соответствует текущему пользователю """+СокрЛП(ПараметрыСеанса.ТекущийПользователь)+"""        [Констант.АдминистраторИгры]");
			ЭтоАдминистарорИгры = Ложь;
		Иначе
			ЭтоАдминистарорИгры = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЭтоАдминистарорИгры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеТекущегоВопроса_ОбновитьСинхронизациюСВремениСервера(Игра)
	
	// Обновление данных текущего вопроса
	СтрОбъект = ИгровойСерверПривилегированный.ПолучитьДанныеТекущегоВопроса(Игра);
	
	// Наименование вопроса для Заголовка
	СтрОбъект.Вставить("ВопросНаименование", СокрЛП(СтрОбъект.Вопрос.Наименование));
	
	// Переменная позволяет играть с разными часовыми поясами в одно и тоже время on-line 
	СтрОбъект.Вставить("ТекущаяДатаСеансаНаСервере", ТекущаяДатаСеанса());

	Возврат СтрОбъект;
	
КонецФункции	

&НаКлиенте
Процедура ДоступностьКнопок_СТАРТ_СТОП()
	
	// Видимость кнопок СТАРТ / STOP
	//
	Элементы.СтартИгры.Доступность = НЕ Объект.АктивныйХодИгры;
	Элементы.СтопИгры.Доступность  = Объект.АктивныйХодИгры;	
	
КонецПроцедуры	




// Команды (Игровой стол)

// СТАРТ>
&НаКлиенте
Процедура СтартСТекущейСтроки(Команда)
	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Только просмотр!");
		Возврат;
	КонецЕсли;	
	
	СтартИгрыВыборИзМеню(Новый Структура("Значение","С выбранной строки"), Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СтартИгры(Команда)
	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Только просмотр!");
		Возврат;
	КонецЕсли;	
	
	// Вопрос о старте из выпадающего меню	
	Оповещение = Новый ОписаниеОповещения("СтартИгрыВыборИзМеню", ЭтотОбъект);
	Список = Новый СписокЗначений;
	Список.Добавить("С начала игры");
	Список.Добавить("С выбранной строки №"+АктивныйНомер);
	Список.Добавить("Продолжить играть");
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.СтартИгры);
	
КонецПроцедуры

&НаКлиенте
Процедура СтартИгрыВыборИзМеню(Результат, ДопПарам) Экспорт
	
	Если Результат<>Неопределено Тогда
		
		Если Результат.Значение="С начала игры" Тогда		
			АктивныйНомер = 1;
			ЗапускПроцедурыСтартНаСервере = Истина;			
		ИначеЕсли СтрНайти(Результат.Значение, "С выбранной строки")>0 Тогда
			// АктивныйНомер - установлен по текущей строке в обработчике события МаршрутИгрыПриАктивизацииСтроки
			ЗапускПроцедурыСтартНаСервере = Истина;
		ИначеЕсли Результат.Значение="Продолжить играть" Тогда
			ЗапускПроцедурыСтартНаСервере = Ложь;
		КонецЕсли;
		
		Если ЗапускПроцедурыСтартНаСервере Тогда
			
			Если ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры() Тогда
				СообщениеРезультат = СтартНаСервере();
				Блокировка_РегистрМаршрутаЗанят = ?(Блокировка_РегистрМаршрутаЗанят, Ложь, Истина);
				Если ЗначениеЗаполнено(СообщениеРезультат) Тогда 
					ПоказатьПредупреждение(,СообщениеРезультат);
				Иначе
					Объект.АктивныйХодИгры = Истина;
				КонецЕсли;
			Иначе
				ПоказатьПредупреждение(,"Отказано в доступе! Повторите попытку.");
			КонецЕсли;
			
		Иначе
			Объект.АктивныйХодИгры = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ДоступностьКнопок_СТАРТ_СТОП();
	
КонецПроцедуры

&НаСервере
Функция СтартНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.ДемонстрацияОтвета КАК ДемонстрацияОтвета,
	|	МаршрутПроведенияИгры.Длительность КАК Длительность,
	|	МаршрутПроведенияИгры.ВремяСтарта КАК ВремяСтарта,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения,
	|	МаршрутПроведенияИгры.ВремяНачалаПаузы КАК ВремяНачалаПаузы,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	(МаршрутПроведенияИгры.АктивныйВопрос
	|			ИЛИ МаршрутПроведенияИгры.НомерСледования = &НовыйНомерСледования)
	|	И МаршрутПроведенияИгры.Игра = &Игра";	
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	Запрос.УстановитьПараметр("НовыйНомерСледования", АктивныйНомер);
	
	СообщениеРезультат = "";
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		
		СообщениеРезультат = "     Нет задач!";
		
	Иначе	
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			// Обновление текущих записей без проверок (действие принудительное)		
			Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,Выборка,"Игра,АктивныйВопрос,НомерСледования");
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда		
				Запись.АктивныйВопрос = (Выборка.НомерСледования=АктивныйНомер); // Изменение активности записи		
				Если Запись.АктивныйВопрос Тогда // Обновляем данные старта
					Запись.ВремяСтарта = ТекущаяДатаСеанса();
					Запись.ВремяНачалаПаузы = Дата(1,1,1);
					Запись.ВремяОкончанияПаузы = Дата(1,1,1);
					Запись.Длительность = ?(ЗначениеЗаполнено(Запись.Длительность), Запись.Длительность, 60);
					Запись.ВремяЗавершения = Запись.ВремяСтарта + Запись.Длительность;
					
					// Наименование вопроса для Заголовка				
					ЗаполнитьЗначенияСвойств(Объект, Запись); // - Обновление данных формы после выполнения команды
					Объект.ВопросНаименование = СокрЛП(Запись.Вопрос.Наименование);
				КонецЕсли;		
				Запись.Записать(Истина);		
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.МаршрутИгры.Обновить();
	
	Возврат СообщениеРезультат;
	
КонецФункции


// СТОП
&НаКлиенте
Процедура СтопИгры(Команда)
	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Только просмотр!");
		Возврат;
	КонецЕсли;	
	
	// Вопрос о завершении из выпадающего меню	
	Оповещение = Новый ОписаниеОповещения("СтопИгрыВыборИзМеню", ЭтотОбъект);
	Список = Новый СписокЗначений;
	Список.Добавить("Остановить после завершения текущей строки");
	Список.Добавить("Остановить сейчас");
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.СтопИгры);
	
КонецПроцедуры

&НаКлиенте
Процедура СтопИгрыВыборИзМеню(Результат, ДопПарам) Экспорт
	
	Если Результат<>Неопределено Тогда
		
		Если Результат.Значение="Остановить сейчас" Тогда
			ЗапускПроцедурыСтопНаСервере = Истина;
		ИначеЕсли Результат.Значение="Остановить после завершения текущей строки" Тогда
			ЗапускПроцедурыСтопНаСервере = Ложь;
		КонецЕсли;	
		
		Если ЗапускПроцедурыСтопНаСервере Тогда
			
			Если ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры() Тогда
				СообщениеРезультат = СтопИгрыНаСервере();
				Блокировка_РегистрМаршрутаЗанят = ?(Блокировка_РегистрМаршрутаЗанят, Ложь, Истина);
				Если ЗначениеЗаполнено(СообщениеРезультат) Тогда 
					ПоказатьПредупреждение(,СообщениеРезультат);
				Иначе
					Объект.АктивныйХодИгры = Ложь;
				КонецЕсли;		
			Иначе
				ПоказатьПредупреждение(,"Отказано в доступе! Повторите попытку.");
			КонецЕсли;
			
		Иначе
			Объект.АктивныйХодИгры = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ДоступностьКнопок_СТАРТ_СТОП();
	
КонецПроцедуры

&НаСервере
Функция СтопИгрыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.ДемонстрацияОтвета КАК ДемонстрацияОтвета,
	|	МаршрутПроведенияИгры.Длительность КАК Длительность,
	|	МаршрутПроведенияИгры.ВремяСтарта КАК ВремяСтарта,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения,
	|	МаршрутПроведенияИгры.ВремяНачалаПаузы КАК ВремяНачалаПаузы,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.АктивныйВопрос
	|	И МаршрутПроведенияИгры.Игра = &Игра
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСледования УБЫВ";
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	СообщениеРезультат = "";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			
			Если ТекущаяДатаСеанса>=Выборка.ВремяЗавершения Тогда 				
				//Текущая задача уже не активна				
				
			Иначе // - это исполняемая активная задача							
				
				// Обновление текущей записи		
				Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,Выборка,"Игра,АктивныйВопрос,НомерСледования");
				Запись.Прочитать();
				
				Если Запись.Выбран() Тогда
					Запись.ВремяЗавершения = ТекущаяДатаСеанса;
					Если ЗначениеЗаполнено(Запись.ВремяОкончанияПаузы) И Запись.ВремяОкончанияПаузы>ТекущаяДатаСеанса Тогда
						Запись.ВремяОкончанияПаузы = ТекущаяДатаСеанса;
					КонецЕсли;	
					ЗаполнитьЗначенияСвойств(Объект, Запись); // Обновление данных формы после выполнения команды
					Запись.Записать(Истина);				
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		СообщениеРезультат = "Нет активно выполнаемой задачи!";
	КонецЕсли;
	
	Элементы.МаршрутИгры.Обновить();
	
	Возврат СообщениеРезультат;
	
КонецФункции





// ПАУЗА
&НаКлиенте
Процедура Пауза(Команда)
	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Только просмотр!");
		Возврат;
	КонецЕсли;
	
	Если ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры() Тогда
		СообщениеРезультат = ПаузаНаСервере();
		Блокировка_РегистрМаршрутаЗанят = ?(Блокировка_РегистрМаршрутаЗанят, Ложь, Истина);
		Если ЗначениеЗаполнено(СообщениеРезультат) Тогда ПоказатьПредупреждение(,СообщениеРезультат); КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Отказано в доступе! Повторите попытку.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПаузаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.ДемонстрацияОтвета КАК ДемонстрацияОтвета,
	|	МаршрутПроведенияИгры.Длительность КАК Длительность,
	|	МаршрутПроведенияИгры.ВремяСтарта КАК ВремяСтарта,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения,
	|	МаршрутПроведенияИгры.ВремяНачалаПаузы КАК ВремяНачалаПаузы,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.АктивныйВопрос
	|	И МаршрутПроведенияИгры.Игра = &Игра
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСледования УБЫВ";
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	СообщениеРезультат = "";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			
			Если ТекущаяДатаСеанса>=Выборка.ВремяЗавершения Тогда // уже проскачили по времени				
				СообщениеРезультат = "Текущая задача уже не активна. Повторите попытку";				
				
			Иначе // - это исполняемая активная задача					
				
				Если ЗначениеЗаполнено(Выборка.ВремяОкончанияПаузы) Тогда 
					
					Если ТекущаяДатаСеанса>Выборка.ВремяОкончанияПаузы Тогда 
						// Т.е. пауза была, но уже прошла, тогда устанавливаем новую				
						Новое_ВремяНачалаПаузы    = ТекущаяДатаСеанса; 
						Новое_ВремяОкончанияПаузы = Новое_ВремяНачалаПаузы + ДлительностьПаузы;
						Новое_ВремяЗавершения     = Выборка.ВремяЗавершения + ДлительностьПаузы;
					Иначе // сейчас эта пауза активна, поэтому отменяем её			
						Новое_ВремяНачалаПаузы    = Выборка.ВремяНачалаПаузы; 
						Новое_ВремяОкончанияПаузы = ТекущаяДатаСеанса - 1;
						Новое_ВремяЗавершения     = Выборка.ВремяЗавершения - (Выборка.ВремяОкончанияПаузы-ТекущаяДатаСеанса) + 1;
					КонецЕсли;
					
				Иначе // устанавливаем новую*
					Новое_ВремяНачалаПаузы    = ТекущаяДатаСеанса; 
					Новое_ВремяОкончанияПаузы = Новое_ВремяНачалаПаузы + ДлительностьПаузы;
					Новое_ВремяЗавершения     = Выборка.ВремяЗавершения + ДлительностьПаузы;
				КонецЕсли; 									
				
				// Обновление текущей записи		
				Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,Выборка,"Игра,АктивныйВопрос,НомерСледования");
				Запись.Прочитать();
				
				Если Запись.Выбран() Тогда
					Запись.ВремяНачалаПаузы = Новое_ВремяНачалаПаузы;
					Запись.ВремяОкончанияПаузы = Новое_ВремяОкончанияПаузы;
					Запись.ВремяЗавершения = Новое_ВремяЗавершения;
					ЗаполнитьЗначенияСвойств(Объект, Запись); // Обновление данных формы после выполнения команды
					Запись.Записать(Истина);				
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		СообщениеРезультат = "Нет активно выполнаемой задачи!";
	КонецЕсли;
	
	Элементы.МаршрутИгры.Обновить();
	
	Возврат СообщениеРезультат;
	
КонецФункции


// ДОБАВИТЬ ВРЕМЯ
&НаКлиенте
Процедура ДобавитьВремя(Команда)
	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Только просмотр!");
		Возврат;
	КонецЕсли;	
	
	Если ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры() Тогда
		СообщениеРезультат = ДобавитьВремяНаСервере();
		Блокировка_РегистрМаршрутаЗанят = ?(Блокировка_РегистрМаршрутаЗанят, Ложь, Истина);
		Если ЗначениеЗаполнено(СообщениеРезультат) Тогда ПоказатьПредупреждение(,СообщениеРезультат); КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Отказано в доступе! Повторите попытку.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьВремяНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.ДемонстрацияОтвета КАК ДемонстрацияОтвета,
	|	МаршрутПроведенияИгры.Длительность КАК Длительность,
	|	МаршрутПроведенияИгры.ВремяСтарта КАК ВремяСтарта,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения,
	|	МаршрутПроведенияИгры.ВремяНачалаПаузы КАК ВремяНачалаПаузы,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.АктивныйВопрос
	|	И МаршрутПроведенияИгры.Игра = &Игра
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСледования УБЫВ";	
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	СообщениеРезультат = "";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			
			Если ТекущаяДатаСеанса>=Выборка.ВремяЗавершения Тогда // уже проскачили по времени
				
				СообщениеРезультат = "Текущая задача уже не активна. Повторите попытку.";					
				
			Иначе
				
				Если ТекущаяДатаСеанса<=Выборка.ВремяОкончанияПаузы Тогда // Т.е. сейчас идёт пауза
					Новое_ВремяОкончанияПаузы = Выборка.ВремяОкончанияПаузы  + ДлительностьДобавленногоВремени;
					Новое_ВремяЗавершения     = Выборка.ВремяЗавершения + ДлительностьДобавленногоВремени;											
				Иначе	
					Новое_ВремяОкончанияПаузы = Выборка.ВремяОкончанияПаузы;
					Новое_ВремяЗавершения     = Выборка.ВремяЗавершения + ДлительностьДобавленногоВремени;							
				КонецЕсли;
				
				// Обновление текущей записи		
				Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,Выборка,"Игра,АктивныйВопрос,НомерСледования");
				Запись.Прочитать();
				
				Если Запись.Выбран() Тогда	
					Запись.ВремяОкончанияПаузы = Новое_ВремяОкончанияПаузы;
					Запись.ВремяЗавершения     = Новое_ВремяЗавершения;				
					ЗаполнитьЗначенияСвойств(Объект, Запись); // Обновление данных формы после выполнения команды
					Запись.Записать(Истина);					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		СообщениеРезультат = "Нет активно выполнаемой задачи!";
	КонецЕсли;
	
	Элементы.МаршрутИгры.Обновить();
	
	Возврат СообщениеРезультат;
	
КонецФункции


// ОСТАВИТЬ ВРЕМЯ 
&НаКлиенте
Процедура ОставитьВремя(Команда)
	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Только просмотр!");
		Возврат;
	КонецЕсли;
	
	Если ЕстьВозможностьЗаписиВРегистрМаршрутПроведенияИгры() Тогда
		СообщениеРезультат = ОставитьВремяНаСервере();
		Блокировка_РегистрМаршрутаЗанят = ?(Блокировка_РегистрМаршрутаЗанят, Ложь, Истина);
		Если ЗначениеЗаполнено(СообщениеРезультат) Тогда ПоказатьПредупреждение(,СообщениеРезультат); КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Отказано в доступе! Повторите попытку.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОставитьВремяНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутПроведенияИгры.Игра КАК Игра,
	|	МаршрутПроведенияИгры.АктивныйВопрос КАК АктивныйВопрос,
	|	МаршрутПроведенияИгры.НомерСледования КАК НомерСледования,
	|	МаршрутПроведенияИгры.Вопрос КАК Вопрос,
	|	МаршрутПроведенияИгры.ДемонстрацияОтвета КАК ДемонстрацияОтвета,
	|	МаршрутПроведенияИгры.Длительность КАК Длительность,
	|	МаршрутПроведенияИгры.ВремяСтарта КАК ВремяСтарта,
	|	МаршрутПроведенияИгры.ВремяЗавершения КАК ВремяЗавершения,
	|	МаршрутПроведенияИгры.ВремяНачалаПаузы КАК ВремяНачалаПаузы,
	|	МаршрутПроведенияИгры.ВремяОкончанияПаузы КАК ВремяОкончанияПаузы
	|ИЗ
	|	РегистрСведений.МаршрутПроведенияИгры КАК МаршрутПроведенияИгры
	|ГДЕ
	|	МаршрутПроведенияИгры.АктивныйВопрос
	|	И МаршрутПроведенияИгры.Игра = &Игра
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСледования УБЫВ";	
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	СообщениеРезультат = "";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			
			Если ТекущаяДатаСеанса>=Выборка.ВремяЗавершения Тогда // уже проскачили по времени
				
				СообщениеРезультат = "Текущая задача уже не активна. Повторите попытку.";					
				
			Иначе
				
				Если ТекущаяДатаСеанса<=Выборка.ВремяОкончанияПаузы Тогда // Т.е. сейчас идёт пауза
					Новое_ВремяОкончанияПаузы = ТекущаяДатаСеанса + ДлительностьОставленногоВремени;
					Новое_ВремяЗавершения     = Выборка.ВремяЗавершения + (Новое_ВремяОкончанияПаузы - Выборка.ВремяОкончанияПаузы);											
				Иначе	
					Новое_ВремяОкончанияПаузы = Выборка.ВремяОкончанияПаузы;
					Новое_ВремяЗавершения     = ТекущаяДатаСеанса + ДлительностьОставленногоВремени;
				КонецЕсли;
				
				// Обновление текущей записи		
				Запись = РегистрыСведений.МаршрутПроведенияИгры.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,Выборка,"Игра,АктивныйВопрос,НомерСледования");
				Запись.Прочитать();
				
				Если Запись.Выбран() Тогда	
					Запись.ВремяОкончанияПаузы = Новое_ВремяОкончанияПаузы;
					Запись.ВремяЗавершения     = Новое_ВремяЗавершения;				
					ЗаполнитьЗначенияСвойств(Объект, Запись); // Обновление данных формы после выполнения команды
					Запись.Записать(Истина);					
				КонецЕсли;	
				
			КонецЕсли;		
			
		КонецЦикла;
		
	Иначе
		СообщениеРезультат = "Нет активно выполнаемой задачи!";
	КонецЕсли;
	
	Элементы.МаршрутИгры.Обновить();
	
	Возврат СообщениеРезультат;
	
КонецФункции




// Команды (Отчеты)
&НаКлиенте
Процедура ОбновитьАктивностьУчастников(Команда)
	ОбновитьАктивностьУчастниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктивностьУчастниковНаСервере()
	
	ДеревоУчастниковКоманд.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИграСписокКоманд.Команда КАК Команда,
	|	ИграСписокКоманд.НомерСтроки КАК НомерКоманды
	|ПОМЕСТИТЬ Команды
	|ИЗ
	|	Документ.Игра.СписокКоманд КАК ИграСписокКоманд
	|ГДЕ
	|	ИграСписокКоманд.Ссылка = &Игра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомандыИгроки.Ссылка КАК Команда,
	|	Команды.НомерКоманды КАК НомерКоманды,
	|	КомандыИгроки.НомерСтроки КАК НомерИгрока,
	|	КомандыИгроки.Игрок КАК Игрок,
	|	КомандыИгроки.Игрок.Код КАК Имя
	|ИЗ
	|	Команды КАК Команды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды.Игроки КАК КомандыИгроки
	|		ПО Команды.Команда = КомандыИгроки.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Команды.НомерКоманды,
	|	КомандыИгроки.НомерСтроки
	|ИТОГИ ПО
	|	Команда ИЕРАРХИЯ";	
	Запрос.УстановитьПараметр("Игра", Объект.Игра);
	
	// Получение списка активных пользователей
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	МассивИменПользователей = Новый Массив;
	Для Каждого Соединение Из МассивСоединений Цикл
		МассивИменПользователей.Добавить(Соединение.Пользователь.Имя);
	КонецЦикла;
	
	// Счетчики:
	КоличествоВсегоИгроков = 0;
	КоличествоПодключившихсяИгроков = 0;	
	
	// Вывод Дерева
	Результат = Запрос.Выполнить();
	ВыборкаКоманда = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаКоманда.Следующий() Цикл		
		
		СтрКоманда = ДеревоУчастниковКоманд.ПолучитьЭлементы().Добавить();
		СтрКоманда.КомандаИгрок = ВыборкаКоманда.Команда;
		СоставИгроков = СтрКоманда.ПолучитьЭлементы();	
		
		ВыборкаДетали = ВыборкаКоманда.Выбрать();
		КоличествоПодключившихсяИгроковИзКоманды = 0;
		НомерКоманды = "";
		Пока ВыборкаДетали.Следующий() Цикл		
			СтрИгрок = СоставИгроков.Добавить();
			СтрИгрок.КомандаИгрок = ВыборкаДетали.Игрок;
			СтрИгрок.Номер = Строка(ВыборкаДетали.НомерКоманды)+"." + Строка(ВыборкаДетали.НомерИгрока)+"."+?(ВыборкаДетали.НомерИгрока=1,".К","");
			НомерКоманды = Строка(ВыборкаДетали.НомерКоманды)+".";
			КоличествоВсегоИгроков = КоличествоВсегоИгроков + 1;
			Если МассивИменПользователей.Найти(ВыборкаДетали.Имя)<>Неопределено Тогда
				КоличествоПодключившихсяИгроковИзКоманды = КоличествоПодключившихсяИгроковИзКоманды + 1;
				СтрИгрок.Активен = Истина;
				КоличествоПодключившихсяИгроков = КоличествоПодключившихсяИгроков + 1;
			КонецЕсли;				
		КонецЦикла;		
		СтрКоманда.Номер = НомерКоманды;
		Если ВыборкаДетали.Количество()=КоличествоПодключившихсяИгроковИзКоманды Тогда
			СтрКоманда.Активен = Истина;
		КонецЕсли;		
		
	КонецЦикла;
	
	// Ждём:
	КоличествоЖдемИгроков = КоличествоВсегоИгроков - КоличествоПодключившихсяИгроков;
	
КонецПроцедуры




// Команды (Настройки)
&НаКлиенте
Процедура ПроверитьИгру(Команда)
	ПроверитьИгруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьИгруНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Игра) Тогда
		Попытка
			// Все проверки при проведении документа
			Объект.Игра.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);		
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОВремени(Команда)
	
	// Получение данных текущего вопроса, синхронизации времени
	СтрОбъект = ПолучитьДанныеТекущегоВопроса_ОбновитьСинхронизациюСВремениСервера(Объект.Игра);
	ЗаполнитьЗначенияСвойств(Объект, СтрОбъект);
	Объект.СинхронизацияСВременемСервера = СтрОбъект.ТекущаяДатаСеансаНаСервере - ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонстантуАдминистраторИгры(Команда)
	
	ОткрытьФорму("Константа.АдминистраторИгры.ФормаКонстант");
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабФормы(Команда)
	
	// Масштаб формы (+)
	Масштаб = Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьМасштабФормы(Команда)
	
	// Масштаб формы (-)
	Если Масштаб > 10 Тогда
		Масштаб = Масштаб - 10;
	КонецЕсли;
	
КонецПроцедуры





// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Текущая игра
	Объект.Игра = Константы.ТекущаяИгра.Получить();
	
	// Получение данных текущего вопроса, синхронизациz времени
	СтрОбъект = ПолучитьДанныеТекущегоВопроса_ОбновитьСинхронизациюСВремениСервера(Объект.Игра);
	ЗаполнитьЗначенияСвойств(Объект, СтрОбъект);
	
	
	// Проверка основного администратора игры	
	ФормаДоступнаТолькоНаПросмотр = НЕ Проверить_ЭтоАдминистарорИгры();
	
	Если НЕ ФормаДоступнаТолькоНаПросмотр Тогда
		// Если есть активная задача> СТАРТ ИГРЫ
		Объект.АктивныйХодИгры = СтрОбъект.ЕстьАктивныйВопрос;
	Иначе
		Элементы.Игра.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Отборы:
	УстановитьОтборПоИгреВДинамическихСписках();
	
	
	// Значения по-умолчанию:
	ДлительностьПаузы = 60;
	ДлительностьДобавленногоВремени = 60;
	ДлительностьОставленногоВремени = 10;	
	
	// Только для полных прав
	Элементы.ОткрытьКонстантуАдминистраторИгры.Доступность = РольДоступна("ПолныеПрава");
	
	// Переменная запоняется при запуске игрового стола и позволяет играть с разными часовыми поясами
	// в одно и тоже время on-line 
	Объект.ТекущаяДатаСеансаНаСервере = ТекущаяДатаСеанса();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Переменная запоняется при запуске игрового стола и позволяет играть с разными часовыми поясами
	// в одно и тоже время on-line 
	Объект.СинхронизацияСВременемСервера = Объект.ТекущаяДатаСеансаНаСервере - ТекущаяДата();

	
	Если ФормаДоступнаТолькоНаПросмотр Тогда
		ПоказатьПредупреждение(,"Форма доступна только для просмотра!");
	КонецЕсли;
	
	// Обновление доступности кнопок СТАРТ/STOP
	ДоступностьКнопок_СТАРТ_СТОП();
	
	// СТАРТ: счетчика Времени
	ПодключитьОбработчикОжидания("ОбновитьДанные_ОперативныйСчетчикВремени", 0.3, Истина);
	
	// СТАРТ: обновления игровых данных из базы
	ПодключитьОбработчикОжидания("ОбновитьДанные_ХодИгры", 1);	// - запускается 1 раз при открытии формы	
	
КонецПроцедуры

&НаКлиенте
Процедура ИграПриИзменении(Элемент)
	
	ИграПриИзмененииНаСервере();
	ДоступностьКнопок_СТАРТ_СТОП();
	
КонецПроцедуры

&НаСервере
Процедура ИграПриИзмененииНаСервере()
	
	// Изменение игры
	Если ЗначениеЗаполнено(Объект.Игра) Тогда	
		Если Объект.Игра.Проведен Тогда
			Константы.ТекущаяИгра.Установить(Объект.Игра);
		Иначе			
			ИгровойКлиентСервер.СообщитьПользователю("В качестве игры можно выбирать только проведенный документ!", , "Объект.Игра", "Объект.Игра");
			Объект.Игра = Документы.Игра.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;	
	
	// Всегда отменяем активные действия после изменения игры
	Объект.АктивныйХодИгры = Ложь;
	
	
	// Получение данных текущего вопроса, синхронизации времени
	СтрОбъект = ПолучитьДанныеТекущегоВопроса_ОбновитьСинхронизациюСВремениСервера(Объект.Игра);
	ЗаполнитьЗначенияСвойств(Объект, СтрОбъект);
	
	// Отборы Динамических списков
	УстановитьОтборПоИгреВДинамическихСписках();
	
КонецПроцедуры

&НаКлиенте            
Процедура МаршрутИгрыПриАктивизацииСтроки(Элемент)
	
	// Номер для старта с текущей задачи
	АктивныйНомер = ?(Элемент.ТекущиеДанные<>Неопределено, Элемент.ТекущиеДанные.НомерСледования, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Т.к. форма является одновременно и службой хода игры, то обязательно предупреждаем
	Если НЕ ЗавершениеРаботы И Объект.АктивныйХодИгры И НЕ ФормаДоступнаТолькоНаПросмотр Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемОбработкаВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Идёт активный ход игры.
		|Закрытие приведёт к прекращению работы механизма перехода к следующей задаче.
		|Все равно закрыть?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемОбработкаВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.АктивныйХодИгры = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры




