

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если Новый*
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Параметры.Свойство("ВладелецИгра") Тогда // Создание из формы документа "Игра"
			ЗаполнитьЗначенияСвойств(Объект, Параметры, "ВладелецИгра,Родитель,Наименование"); // Заполнение параметров из формы документа "Игра"
		Иначе // Если из любого другого места
			Объект.ВладелецИгра = Документы.Игра.ПустаяСсылка(); // на всякий случай очищаем
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры
