





// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстПодсказки",      Заголовок);
	Параметры.Свойство("ТекущиеДанныеСтроки", Ответ);
	Параметры.Свойство("Масштаб",             Масштаб);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Закрыть(Текст);
	
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Ответ);
	
КонецПроцедуры

