

Процедура ПередЗаписью(Отказ)
	
	// Проверки состава команды
	//
	
	Если НЕ ЭтоГруппа Тогда
				
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Если Игроки.Количество()=0 Тогда
			ИгровойКлиентСервер.СообщитьПользователю("В команде должен быть минимум 1 игрок!", Ссылка, "Объект.Игроки", , Отказ);
		КонецЕсли;	
		
		Если Игроки.Количество()>9 Тогда
			ИгровойКлиентСервер.СообщитьПользователю("В команде не может быть больше 9 игроков!", Ссылка, "Объект.Игроки", , Отказ);
		КонецЕсли;	
		
		МассивУчастников = Новый Массив;	
		Для Каждого ЭлТЧ Из Игроки Цикл	
			Если ЗначениеЗаполнено(ЭлТЧ.Игрок) Тогда	
				Если МассивУчастников.Найти(ЭлТЧ.Игрок)=Неопределено Тогда
					МассивУчастников.Добавить(ЭлТЧ.Игрок);
				Иначе
					ИгровойКлиентСервер.СообщитьПользователю("В строке №"+ЭлТЧ.НомерСтроки+" повторяющийся игрок!", Ссылка, "Объект.Игроки["+(ЭлТЧ.НомерСтроки-1)+"].Игрок", , Отказ);
				КонецЕсли;				
			Иначе
				ИгровойКлиентСервер.СообщитьПользователю("В строке №"+ЭлТЧ.НомерСтроки+" не выбран игрок!", Ссылка, "Объект.Игроки["+(ЭлТЧ.НомерСтроки-1)+"].Игрок", , Отказ);
			КонецЕсли;		
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

// МАА+ 2026.10.16 Пример изменнеия для проверки в GIT