


// Процедуры и функции
&НаКлиенте
Процедура ДоступностьПоляНовыйПароль()
	
	// Для установки
	Элементы.НовыйПароль.Доступность = ИзменитьПароль;
	Элементы.НовыйПароль.Видимость   = ИзменитьПароль;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРольДоступна(ИмяРоли)
	
	Возврат РольДоступна(ИмяРоли);
	
КонецФункции




// Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользователюДоступнаРольПолныеПрава = Ложь;
	
	// Заполнение списка ролей метаданных
	Для Каждого Роль Из Метаданные.Роли Цикл
		нСтр = Роли.Добавить();
		Нстр.Роль = Строка(Роль.Имя);		
	КонецЦикла;		
	
	Если Объект.Ссылка.Пустая() Тогда // Это НОВЫЙ*	
		
		ПоказыватьВСпискеВыбора = Истина;
		ИнформацияОСвязиСПользователемИБ = "Ввод нового пользователя *";
		Элементы.ИнформацияОСвязиСПользователемИБ.ЦветТекста = WebЦвета.Черный;		
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
	Иначе
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.УникальныйИдентификатор);		
		Если ПользовательИБ=Неопределено Тогда		
			ИнформацияОСвязиСПользователемИБ = "Пользователь в базе не обнаружен!";
			Элементы.ИнформацияОСвязиСПользователемИБ.ЦветТекста = WebЦвета.Красный;		
		Иначе		
			
			// Обновление данных по данныи пользовтелей ИБ
			Объект.Код              = ПользовательИБ.Имя;
			Объект.Наименование     = ПользовательИБ.ПолноеИмя;
			ПоказыватьВСпискеВыбора = ПользовательИБ.ПоказыватьВСпискеВыбора;	
			
			// Заполнение доступных ролей
			Для Каждого Роль Из ПользовательИБ.Роли Цикл
				МассивСтрок = Роли.НайтиСтроки(Новый Структура("Роль", Роль.Имя));
				Для Каждого СтрокаРоль Из МассивСтрок Цикл
					СтрокаРоль.Выбор = Истина;
				КонецЦикла;
				Если Роль.Имя = "ПолныеПрава" Тогда
					ПользователюДоступнаРольПолныеПрава = Истина;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ПользователюДоступнаРольПолныеПрава И НЕ РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Роли.ТолькоПросмотр = Истина;
		Элементы.ПоказыватьВСпискеВыбора.ТолькоПросмотр = Истина;
		Элементы.ИзменитьПароль.ТолькоПросмотр = Истина;
	КонецЕсли;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступностьПоляНовыйПароль();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПарольПриИзменении(Элемент)
	
	ДоступностьПоляНовыйПароль();
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	// Начальное редактирование
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Код = СокрЛП(Объект.Код);
		Объект.Наименование = Объект.Код;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// ЗАполнение реквизита "ДоступныеРоли"
	ДоступныеРолиСписок = "";
	Для Каждого Роль Из Роли Цикл
		Если Роль.Выбор Тогда
			ДоступныеРолиСписок = ДоступныеРолиСписок + Роль.Роль + "; ";
		КонецЕсли;
	КонецЦикла;	
	Объект.ДоступныеРоли = ДоступныеРолиСписок;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обновление пользователя в ИБ
	//
	
	УстановитьПривилегированныйРежим(Истина);	
	
	// Поиск пользователя в ИБ:
	Если ЗначениеЗаполнено(ТекущийОбъект.УникальныйИдентификатор) Тогда 		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);		 
	Иначе
		ПользовательИБ = Неопределено;
	КонецЕсли;	
	
	// Обновление:		
	Если ПользовательИБ=Неопределено Тогда
		
		// Создание НОВОГО* пользователя в ИБ и обновление УникальныйИдентификатор в 1C:
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ПользовательИБ.Имя       = Объект.Код;
		ПользовательИБ.ПолноеИмя = Объект.Наименование;
		ПользовательИБ.Роли.Очистить();
		Для Каждого РольСтрока Из Роли Цикл
			Если РольСтрока.Выбор Тогда
				Если РольСтрока.Роль="ПолныеПрава" И НЕ РольДоступна("ПолныеПрава") Тогда Продолжить; КонецЕсли;
				ПользовательИБ.Роли.Добавить(Метаданные.Роли[РольСтрока.Роль]);
			КонецЕсли;
		КонецЦикла;				
		Если ИзменитьПароль Тогда
			ПользовательИБ.Пароль = НовыйПароль;
		КонецЕсли;
		ПользовательИБ.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;	
		Попытка
			ПользовательИБ.Записать();;
			ПользовательОбъект1С = ТекущийОбъект.Ссылка.ПолучитьОбъект();
			ПользовательОбъект1С.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
			ПользовательОбъект1С.Записать();
			Объект.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
			ИнформацияОСвязиСПользователемИБ = "";
			Сообщить("Успешно создан новый пользователь!");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;		
		
	Иначе
		
		// Обновление данных пользователей ИБ
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ПользовательИБ.Имя       = Объект.Код;
		ПользовательИБ.ПолноеИмя = Объект.Наименование;
		ПользовательИБ.Роли.Очистить();
		Для Каждого РольСтрока Из Роли Цикл
			Если РольСтрока.Выбор Тогда
				Если РольСтрока.Роль="ПолныеПрава" И НЕ РольДоступна("ПолныеПрава") Тогда Продолжить; КонецЕсли;
				ПользовательИБ.Роли.Добавить(Метаданные.Роли[РольСтрока.Роль]);
			КонецЕсли;
		КонецЦикла;	
		Если ИзменитьПароль Тогда
			ПользовательИБ.Пароль = НовыйПароль;
		КонецЕсли;
		ПользовательИБ.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;	
		Попытка
			ПользовательИБ.Записать();
			ИнформацияОСвязиСПользователемИБ = "";
			Сообщить("Данные пользователя успешно обновлены!");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;		
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);		
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломИзменения(Элемент, Отказ)
	
	// Ошраничение доступа на редактирование роли "ПолныеПрава"
	//
	ТекДанные = Элементы.Роли.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда
		Если ТекДанные.Роль = "ПолныеПрава" Тогда					
			Если НЕ ПолучитьРольДоступна("ПолныеПрава") Тогда
				Отказ = Истина;
				ПоказатьПредупреждение(,"Полные права может назначать только пользователель с полными правами!");
			КонецЕсли;					
		КонецЕсли;				
	КонецЕсли;	
	
КонецПроцедуры








